const t={map:'[{"正在努力编写中":["0.0"],"html5":["1.0"],"语义化标签":["2.0"],"多媒体标签":["3.0"],"视频":["3.1"],"音频":["3.2"],"总结":["3.3","11.7","75.3"],"表单控件":["4.0"],"表单属性":["4.1"],"选择器":["5.0","16.0"],"属性选择器":["5.1"],"结构伪类选择器":["5.2"],"伪元素选择器":["5.3"],"ui元素状态伪类选择器":["5.4"],"否定伪类选择器":["5.5"],"目标伪类选择器":["5.6"],"网站tdk三大标签seo优化":["6.0"],"seo是什么":["6.1"],"t":["6.2"],"d":["6.3"],"k":["6.4"],"logo":["7.0"],"图片模糊处理":["8.0"],"blur":["8.1"],"contrast":["8.2"],"grayscale":["8.3"],"hue":["8.4"],"drop":["8.5"],"invert":["8.6"],"calc":["9.0"],"transition过渡":["10.0"],"平面转换":["11.1"],"移动":["11.2"],"旋转":["11.3"],"旋转中心点":["11.4"],"缩放":["11.5"],"综合写法":["11.6"],"动画":["12.0"],"动画序列":["12.1"],"动画属性":["12.2"],"动画简写":["12.3"],"速度曲线":["12.4"],"渐变":["13.0"],"空间转换":["14.0"],"空间位移":["14.1"],"透视":["14.2"],"空间旋转":["14.3"],"立体呈现":["14.4"],"空间缩放":["14.5"],"起步":["15.0"],"什么是css":["15.1"],"css层叠样式表":["15.2"],"link和import的区别":["15.3"],"选择器基本用法":["16.1"],"选择器分类":["16.2"],"选择器权重":["16.3"],"复合选择器":["16.4"],"后代选择器":["16.5"],"子选择器":["16.6"],"并集选择器":["16.7"],"伪类选择器":["16.8"],"focus伪类选择器":["16.9"],"命名规范":["17.0"],"标签命名":["17.1"],"注释写法":["17.2"],"id命名":["17.3"],"css文件命名":["17.12"],"win快捷键":["18.0"],"字体属性":["19.0"],"文本属性":["20.0"],"emmet语法":["21.0"],"快速生成html结构语法":["21.1"],"快速格式化代码":["21.2"],"元素显示模式":["22.0"],"什么是元素显示模式":["22.1"],"块元素":["22.2"],"行内元素":["22.3"],"元素显示模式转换":["22.4"],"css背景":["23.0"],"背景颜色":["23.1"],"背景图片":["23.2"],"背景平铺":["23.3"],"背景图片位置":["23.4"],"背景滚动":["23.5"],"背景复合写法":["23.6"],"背景透明":["23.7"],"背景总结":["23.8"],"css特性":["24.0"],"层叠性":["24.1"],"继承性":["24.2"],"行高的继承性":["24.3"],"优先级":["24.4"],"盒子模型":["25.0"],"盒子模型的组成":["25.1"],"边框border":["25.2"],"边框":["25.3"],"边框粗细":["25.4"],"边框样式":["25.5"],"边框颜色":["25.6"],"边框复合写法":["25.7"],"表格边框":["25.8"],"内边距padding":["25.9"],"外边距margin":["25.10"],"外边距合并":["25.11"],"圆角边框":["25.12"],"盒子阴影":["25.13"],"文字阴影":["25.14"],"盒子模型新增":["25.15"],"浮动":["26.0"],"什么是浮动":["26.1"],"浮动特性":["26.2"],"浮动布局注意点":["26.3"],"清除浮动":["26.4"],"清除浮动的方法":["26.5"],"额外标签法":["26.6"],"父级添加overflow":["26.7"],"after伪元素法":["26.8"],"双伪元素清除浮动":["26.9"],"清除浮动总结":["26.10"],"定位":["27.0"],"定位组成":["27.1"],"定位模式":["27.2"],"边偏移":["27.3"],"定位方式":["27.4"],"静态定位":["27.5"],"相对定位":["27.6"],"绝对定位":["27.7","27.16"],"固定定位":["27.8"],"根据版心定位":["27.9"],"粘性定位":["27.10"],"定位总结":["27.11"],"定位叠放次序":["27.12"],"定位的拓展":["27.13"],"定位特殊特性":["27.14"],"脱标的盒子不会触发外边距塌陷":["27.15"],"元素的显示与隐藏":["28.0"],"display属性":["28.1"],"visibility可见性":["28.2"],"overflow":["28.3"],"字体图标":["29.0"],"字体图标的产生":["29.1"],"字体图标引入":["29.2"],"字体图标追加":["29.3"],"移动web":["30.0"],"分辨率":["30.1"],"视口":["30.2"],"二倍图":["30.3"],"设计稿尺寸":["30.4"],"百分比布局":["30.5"],"flex布局":["31.0"],"弹性布局":["31.1"],"flex布局的特点":["31.2"],"flex布局模型构成":["31.3"],"主轴对齐方式":["31.4"],"侧轴对齐方式":["31.5"],"伸缩比":["31.6"],"主轴方向":["31.7"],"弹性盒子换行":["31.8"],"移动适配":["32.0"],"rem":["32.2"],"rem移动适配":["32.3"],"视口适配方案":["32.4"],"常用适配范围":["32.5"],"flexible":["32.6"],"less":["32.7"],"less语法":["32.8"],"使用":["32.9"],"注释":["32.10","53.2"],"计算":["32.11"],"嵌套":["32.12"],"变量":["32.13","54.0"],"导入":["32.14"],"导出":["32.15"],"禁止导出":["32.16"],"vw":["32.17","32.18"],"vw适配原理":["32.19"],"媒体查询":["33.0"],"语法":["33.1"],"媒体类型":["33.2"],"媒体特征":["33.3"],"外链式css引入":["33.4"],"css三角形":["34.0"],"css用户界面":["35.0"],"鼠标样式":["35.1"],"轮廓线":["35.2"],"文本框":["35.3"],"解决图片底部默认空白缝隙问题":["36.0"],"vertical":["37.0"],"溢出的文字省略号显示":["38.0"],"单行文本溢出显示省略号":["38.1"],"多行文本溢出显示省略号":["38.2"],"布局技巧":["39.0"],"margin负值的运用":["39.1"],"文字围绕浮动元素":["39.2"],"行内块的巧妙运用":["39.3"],"css三角强化":["39.4"],"css初始化":["40.0"],"图片边框":["41.0"],"精灵图":["42.0","42.2"],"为什么需要精灵图":["42.1"],"基本概念":["43.0"],"网页组成部分":["43.1"],"doctype":["43.2"],"lang":["43.3"],"charset字符集":["43.4"],"常见标签":["44.0","44.2"],"html语法":["44.1"],"常用标记嵌套规范":["44.3"],"转义字符":["44.4"],"插入图片":["45.0"],"超链接":["46.0"],"划分":["47.0"],"表格":["48.0"],"列表":["49.0"],"表单":["50.0"],"表单示例":["50.1"],"表单域":["50.2"],"表单元素":["50.3"],"新增表单":["50.4"],"序言":["51.0"],"javascript发展历史":["51.1"],"javascript能干什么":["51.2"],"javascript实现":["52.0"],"ecmascript":["52.1"],"ecmascript发展阶段":["52.2"],"dom":["52.3"],"bom":["52.4","79.0"],"javascript基础语法":["53.0"],"书写格式":["53.1"],"输入输出语句":["53.3"],"变量概述":["54.1"],"什么是变量":["54.2"],"变量的使用":["54.3"],"变量的语法扩展":["54.4"],"更新变量":["54.5"],"同时声明多个变量":["54.6"],"声明变量的特殊情况":["54.7"],"变量命名规范":["54.8"],"交换变量值":["54.9"],"数据类型":["55.0"],"变量的数据类型":["55.1"],"数据类型分类":["55.2"],"简单数据类型":["55.3"],"获取变量的数据类型":["55.9"],"获取检测变量的数据类型":["55.10"],"数据类型转换":["55.11"],"标识符":["55.12"],"运算符":["56.0","56.1"],"算数运算符":["56.2"],"浮点数的精度问题":["56.3"],"表达式和返回值":["56.4"],"递增和递减运算符":["56.5"],"前置递增运算符":["56.6"],"后置递增运算符":["56.7"],"比较运算符":["56.8"],"逻辑运算符":["56.9"],"短路运算":["56.10"],"赋值运算符":["56.11"],"运算符优先级":["56.12"],"流程控制":["57.0","57.1"],"顺序流程控制":["57.2"],"分支流程控制if语句":["57.3"],"if语句":["57.4"],"if":["57.5","57.6"],"三元表达式":["57.7"],"分支流程控制switch语句":["57.8"],"switch语句和if":["57.9"],"循环":["58.0","58.1"],"循环的目的":["58.2"],"js中的循环":["58.3"],"for循环":["58.4"],"断点调试":["58.5"],"双重for循环":["58.6"],"while循环":["58.7"],"do":["58.8"],"continue":["58.9"],"continue关键字":["58.10"],"break关键字":["58.11"],"javascript命名规范":["59.0"],"标识符命名规范":["59.1"],"操作符命名规范":["59.2"],"单行注释规范":["59.3"],"其他规范":["59.4"],"数组":["60.0"],"数组的概念":["60.1"],"创建数组":["60.2"],"数组的创建方式":["60.3"],"数组的元素类型":["60.4"],"获取数组中的元素":["60.5"],"数组的索引":["60.6"],"遍历数组":["60.7"],"数组的长度":["60.8"],"数组中新增元素":["60.9"],"冒泡排序":["60.10"],"什么是数组":["61.0"],"array":["61.1"],"描述array":["61.2"],"创建一个数组":["61.3"],"数组的基本使用方式":["61.4"],"数组的判断":["61.5"],"函数":["62.0"],"函数的概念":["62.1"],"函数的使用":["62.2"],"函数的参数":["62.6"],"函数的返回值":["62.10"],"return语句":["62.11"],"break":["62.12"],"arguments的使用":["62.13"],"函数案例":["62.14"],"函数的两种声明方式":["62.15"],"作用域":["63.0","63.1"],"变量的作用域":["63.4"],"作用域链":["63.9"],"预解析":["64.0","64.1"],"变量预解析":["64.2","64.3"],"函数预解析":["64.4"],"对象":["65.0","65.1","85.3"],"创建对象的三种方式":["65.2"],"变量和属性的异同":["65.4"],"new关键字":["65.7"],"遍历对象属性":["65.8"],"练习":["65.9"],"math对象":["66.0"],"math常用方法":["66.1"],"math":["66.2"],"random":["66.3"],"日期对象":["67.0"],"date":["67.1"],"日期格式化":["67.2"],"获取日期的总的毫秒形式":["67.3"],"获取毫秒数":["67.4"],"倒计时":["67.5"],"数组对象":["68.0"],"数组创建":["68.1"],"数组判断":["68.2"],"添加或者删除数组元素":["68.3"],"数组排序":["68.4"],"数组索引":["68.5"],"数组转换为字符串":["68.6"],"其他方法":["68.7"],"字符串对象":["69.0"],"简单数据类型为什么有length属性呢":["69.1"],"基本包装类型":["69.2"],"字符串不可变":["69.3"],"根据字符返回位置":["69.4"],"根据位置返回字符":["69.5"],"字符串操作方法":["69.6"],"替换字符串":["69.7"],"字符转大写和小写":["69.8"],"作业":["69.9"],"简单类型与复杂类型":["70.0","70.1"],"堆和栈":["70.2"],"简单类型的内存分配":["70.3"],"复杂类型的内存分配":["70.4"],"简单类型传参":["70.5"],"复杂类型传参":["70.6"],"查阅文档":["71.0"],"mdn":["71.1"],"如何学习对象中的方法":["71.2"],"dom简介":["72.0"],"什么是dom":["72.1"],"dom树":["72.2"],"获取元素":["73.0"],"根据id获取":["73.1"],"根据标签名获取":["73.2"],"通过h5新增方法获取":["73.3"],"获取特殊元素":["73.4"],"获取body元素":["73.5"],"获取html元素":["73.6"],"事件基础":["74.0"],"事件概述":["74.1"],"事件三要素":["74.2"],"执行事件的步骤":["74.3"],"常见的鼠标事件":["74.4"],"操作元素":["75.0"],"改变元素内容":["75.1"],"样式属性操作":["75.2"],"排他思想":["75.4"],"自定义属性":["75.5"],"获取属性值":["75.6"],"设置属性值":["75.7"],"移除属性":["75.8"],"h5自定义属性":["75.9"],"设置h5自定义属性":["75.10"],"获取h5自定义属性":["75.11"],"节点操作":["76.0"],"节点概述":["76.1"],"节点层级":["76.2"],"父级节点":["76.3"],"子节点":["76.4"],"第一个子节点":["76.5","76.7"],"最后一个子节点":["76.6","76.8"],"解决方案":["76.9"],"兄弟节点":["76.10"],"下一个兄弟节点":["76.11","76.13"],"上一个兄弟节点":["76.12","76.14"],"创建节点":["76.15"],"添加节点":["76.16"],"删除节点":["76.17"],"复制节点":["76.18"],"三种创建元素的方式区别":["76.19"],"dom重点核心":["77.0"],"创建元素":["77.1","120.2"],"增":["77.2"],"删":["77.3"],"改":["77.4"],"查":["77.5"],"属性操作":["77.6"],"事件高级":["78.0"],"目标":["78.1"],"注册事件":["78.2"],"注册事件概述":["78.3"],"删除事件":["78.7"],"removeeventlistener删除事件方式":["78.8"],"detachevent删除事件方式":["78.9"],"传统事件删除方式":["78.10"],"删除事件兼容性解决方案":["78.11"],"dom事件流":["78.12"],"捕获阶段":["78.13"],"冒泡阶段":["78.14"],"事件对象":["78.15","78.16"],"事件对象的兼容性方案":["78.17"],"事件对象的常见属性和方法":["78.18"],"事件对象阻止默认行为":["78.19"],"阻止事件冒泡":["78.20"],"阻止事件冒泡的兼容性解决方案":["78.21"],"事件委托":["78.22","122.5"],"常用的鼠标事件":["78.23"],"禁止鼠标右键与鼠标选中":["78.24"],"鼠标事件对象":["78.25"],"常用的键盘事件":["78.26"],"键盘对象属性":["78.27"],"ascii表":["78.28"],"bom概述":["79.1"],"bom构成":["79.2"],"window":["80.0"],"窗口加载事件":["80.1"],"区别":["80.2"],"调整窗口大小事件":["80.3"],"定时器":["80.4"],"settimeout":["80.5"],"cleartimeout":["80.6"],"setinterval":["80.7"],"this指向":["80.8"],"js执行机制":["81.0"],"js是单线程":["81.1"],"一个问题":["81.2"],"同步和异步":["81.3"],"同步任务":["81.4"],"异步任务":["81.5"],"location对象":["82.0"],"url":["82.1"],"location对象属性":["82.2"],"location对象方法":["82.3"],"navigator对象":["83.0"],"history对象":["84.0"],"面向对象编程介绍":["85.0"],"面向过程编程pop":["85.1"],"面向对象编程oop":["85.2"],"类":["85.4"],"创建类":["85.5"],"添加方法":["85.6"],"类的继承":["85.7"],"继承":["85.8","87.0"],"super关键字":["85.9"],"子类和父类方法的继承":["85.10"],"同时调用子类和父类方法":["85.11"],"注意点":["85.12"],"构造函数和原型":["86.0"],"概述":["86.1","94.0","98.1","99.1","100.1","101.1","102.1","104.4","106.1"],"静态成员和实例成员":["86.2"],"实例成员":["86.3"],"静态成员":["86.4"],"构造函数":["86.5","86.11"],"构造函数的特点":["86.6"],"构造函数的问题":["86.7"],"构造函数原型prototype":["86.8"],"原型对象":["86.9"],"constrctor构造函数":["86.10"],"原型链":["86.12"],"javascript的成员查找机制":["86.13"],"原型对象中this指向":["86.14"],"扩展内置对象":["86.15"],"call":["87.1","89.5","89.8"],"借用构造函数继承父类型属性":["87.2"],"借用原型对象继承方法":["87.3"],"类的本质":["87.4"],"语法糖":["87.5"],"es5新增方法":["88.0"],"数组方法":["88.1"],"字符串方法":["88.2"],"对象方法":["88.3"],"函数进阶":["89.0"],"函数的定义方式":["89.1"],"函数的调用方式":["89.2"],"函数内this指向":["89.3"],"改变函数内部this指向":["89.4"],"apply":["89.6"],"bind":["89.7"],"严格模式":["90.0"],"什么是严格模式":["90.1"],"开启严格模式":["90.2"],"严格模式中的变化":["90.5"],"变量的规定":["90.6"],"严格模式下this指向问题":["90.7"],"函数变化":["90.8"],"高阶函数":["90.9"],"闭包":["91.0"],"变量作用域":["91.1"],"什么是闭包":["91.2"],"在chrome中调式闭包":["91.3"],"闭包的作用":["91.4"],"点击li输出索引号":["91.5"],"定时器中的闭包":["91.6"],"递归":["92.0"],"浅拷贝和深拷贝":["92.1"],"浅拷贝":["92.2"],"深拷贝":["92.3"],"正则表达式":["93.0"],"正则表达式概述":["93.1"],"什么是正则表达式":["93.2"],"正则表达式的特点":["93.3"],"正则表达式在javascript中的使用":["93.4"],"创建正则表达式":["93.5"],"测试正则表达式test":["93.6"],"正则表达式的组成":["93.7"],"边界符":["93.8"],"字符类":["93.9"],"方括号":["93.10"],"方括号内部":["93.11"],"量词符":["93.12"],"界符和":["93.13"],"用户验证":["93.14"],"括号总结":["93.15"],"预定义类":["93.16"],"表单验证":["93.17"],"正则表达式替换replace":["93.18"],"正则表达式参数":["93.19"],"let关键字":["95.0"],"特性":["95.1","96.1","100.3"],"let创建变量代码示例":["95.2"],"不允许重复声明":["95.3"],"块级作用域":["95.4"],"不存在变量提升":["95.5"],"什么是变量提升":["95.6"],"不影响作用域链":["95.7"],"let案例":["95.8"],"const关键字":["96.0"],"变量和对象的解构赋值":["97.0"],"什么是解构赋值":["97.1"],"模板字符串":["98.0"],"string的扩展方法":["98.2"],"startswith":["98.3"],"repeat":["98.4"],"set":["98.5"],"简化对象和函数写法":["99.0"],"箭头函数":["100.0"],"箭头函数的注意点":["100.2"],"从数组中返回偶数的元素":["100.4"],"es6中函数参数的默认值":["101.0"],"rest参数":["102.0"],"扩展运算符":["103.0"],"应用":["103.1"],"array的扩展方法":["103.2"],"构造函数方法":["103.3"],"find":["103.4"],"findindex":["103.5"],"includes":["103.6"],"symbol":["104.0"],"symbol概述":["104.1"],"symbol特点":["104.2"],"symbol内置值":["104.3"],"生成器":["105.0"],"迭代器":["106.0"],"promise":["107.0","109.0","109.10","109.11"],"es6模块化":["108.0"],"默认导出":["108.6"],"默认导入":["108.7"],"默认导出的":["108.8"],"默认导入的":["108.9"],"按需导出":["108.10"],"按需导入":["108.11","108.12"],"直接导入并执行模块中的代码":["108.13"],"回调地狱":["109.1"],"如何解决回调地狱的问题":["109.2"],"promise的基本概念":["109.3"],"基于回调函数按顺序读取文件内容":["109.4"],"基于":["109.5"],"then":["109.6","109.7"],"基于promise按顺序读取文件的内容":["109.8"],"通过":["109.9"],"基于promise封装读文件的方法":["109.12"],"async":["110.0","110.2","110.3"],"什么是async":["110.1"],"eventloop":["111.0"],"javascript是单线程的语言":["111.1"],"同步任务和异步任务":["111.2"],"同步任务和异步任务的执行过程":["111.3"],"eventloop基本概念":["111.4"],"结合eventloop分析输出的顺序":["111.5"],"宏任务和微任务":["112.0"],"什么是宏任务和微任务":["112.1"],"宏任务和微任务的执行顺序":["112.2"],"分析以下代码输出的顺序":["112.3"],"经典面试题":["112.4"],"jquery概述":["113.0"],"javascript库":["113.1"],"jquery的概念":["113.2"],"jquery的优点":["113.3"],"jquery基本使用":["114.0"],"jquery的入口函数":["114.1"],"jquery的顶级对象":["114.2"],"jquery对象和dom对象":["114.3"],"jquery对象和dom对象转换":["114.4"],"jquery选择器":["115.0"],"jquery基础选择器":["115.1"],"jquery层级选择器":["115.2"],"隐式迭代":["115.3"],"jquery筛选选择器":["115.4"],"jquery筛选方法":["115.5"],"链式编程":["115.6"],"jquery样式操作":["116.0"],"操作css方法":["116.1"],"设置类样式方法":["116.2"],"类操作和classname的区别":["116.3"],"jquery效果":["117.0"],"显示隐藏":["117.1"],"事件切换":["117.2"],"滑动":["117.3"],"淡入淡出":["117.4"],"自定义动画":["117.5"],"动画队列及其停止排队方法":["117.6"],"动画或效果队列":["117.7"],"停止排队":["117.8"],"jquery属性操作":["118.0"],"设置或获取元素固有属性值prop":["118.1"],"设置或获取自定义属性值":["118.2"],"数据缓存data":["118.3"],"jquery文本属性值":["119.0"],"普通元素内容html":["119.1"],"普通元素文本内容text":["119.2"],"设置表单值val":["119.3"],"jquery元素操作":["120.0"],"遍历元素":["120.1"],"添加元素":["120.3"],"删除元素":["120.4"],"jquery尺寸":["121.0","121.1"],"jquery位置":["121.2"],"jquery事件":["122.0"],"jquery事件注册":["122.1"],"单个事件注册":["122.2"],"jquery事件处理":["122.3"],"事件处理on":["122.4"],"事件处理off":["122.6"],"自动触发事件":["122.7"],"trigger":["122.8"],"jquery事件对象":["122.9"],"jquery方法":["123.0"],"jquery拷贝对象":["123.1"],"多库共存":["123.2"],"jquery插件":["123.3"],"图片懒加载":["123.4"],"全屏滚动":["123.5"],"jquery":["124.0"],"基本选择器":["124.1"],"层次选择器":["124.2"],"基本过滤选择器":["124.3"],"内容过滤选择器":["124.4"],"可见性过滤选择器":["124.5"],"属性过滤选择器":["124.6"],"子元素过滤选择器":["124.7"],"表单对象属性过滤选择器":["124.8"],"表单选择器":["124.9"]},{"0":["12.1","39.4","62.14","66.3","67.2","69.5","69.9"],"1":["7.0","11.2","11.6","17.4","17.8","21.1","25.11","26.0","26.3","26.5","26.10","27.9","29.1","29.2","32.4","43.1","44.1","44.3","50.3","51.2","53.1","53.2","54.3","55.4","55.11","55.12","57.4","57.7","58.4","60.9","60.10","61.2","61.4","61.6","62.3","62.4","62.7","62.14","62.15","63.2","63.5","63.7","64.4","65.3","65.7","66.2","66.3","68.2","68.5","69.4","69.7","69.9","70.2","71.2","74.2","74.3","75.2","76.0","77.5","78.13","78.17","85.12","86.6","86.13","86.14","87.4","88.1","89.1","89.2","90.3","90.6","90.7","90.8","91.3","92.0","92.2","92.3","93.3","93.14","93.15","93.17","94.1","96.1","100.2","100.3","104.2","108.1","109.3","109.12","110.3","114.2","114.3","116.1","116.2","121.2"],"2":["17.5","17.9","21.1","26.10","43.1","54.3","55.5","60.10","61.2","61.7","62.4","62.8","63.3","63.6","63.7","64.4","65.5","68.2","69.9","85.12","90.4","92.2","93.15","94.2","104.2","108.2","109.12"],"3":["17.6","17.10","21.1","43.1","55.6","61.2","62.5","62.9","63.7","64.4","65.6","69.9","94.3","104.2","108.3"],"4":["17.7","17.11","55.7","63.8","69.9","94.4","95.7","108.4"],"5":["29.2","55.8","69.9","94.5","108.5"],"6":["60.10","69.9","94.6"],"7":["60.10","94.7"],"8":["60.10","66.1"],"9":["66.1"],"10":["64.4"],"11":["64.4","67.2"],"20":["64.4"],"21":["55.4"],"24":["67.5"],"41":["60.10"],"60":["67.5"],"100":["12.1"],"255":["18.0"],"262":["94.4"],"666":["62.11"],"新特性":["1.0"],"css":["2.0","5.5","15.2","16.1","17.12","25.13","25.14","26.9","28.2","28.3","32.5","34.0","38.1","39.1","39.4"],"header":["2.0"],"头部标签":["2.0"],"音频":["3.0"],"当前":["3.1"],"video":["3.1"],"元素支持三种视频格式":["3.1"],"尽量使用mp4格式":["3.1"],"image":["3.1","3.2","15.3","16.5","16.6","16.7","16.8","16.9","23.6","23.7","23.8","24.3","24.4","25.1","25.5","25.7","27.11","29.3","33.4","39.2","39.4","43.2","48.0","49.0","59.4","72.2","75.3","78.28","79.2","111.3","111.5","112.2","112.3"],"20230414195132235":["3.1"],"mp3":["3.2"],"wav":["3.2"],"ogg":["3.2"],"20230414195456269":["3.2"],"html":["3.2","43.4","44.1","45.0","46.0","47.0","50.1","50.3","50.4","78.13","78.14","95.8","103.1"],"音频标签和视频标签使用方式基本一致":["3.3"],"html5新增的input类型":["4.0"],"属性值":["4.0"],"说明":["4.0","4.1","5.4","53.3","54.7","55.3","55.11","62.9","67.2","68.3","68.4","68.5","68.7","69.4","69.5","69.6","78.18","78.27","93.8","93.16","115.5"],"type":["4.0","65.9"],"属性":["4.1","5.4","12.2","20.0","31.8","48.0","55.12","76.1","77.4","78.27"],"值":["4.1","56.10"],"required":["4.1"],"属性选择器可以根据元素特定属性的来选择元素":["5.1"],"这样就可以不用借助于类或者id选择器":["5.1"],"选择符":["5.1","5.2","5.3"],"简介":["5.1","5.2","5.3"],"结构伪类选择器主要根据文档结构来选择器元素":["5.2"],"常用于根据父级选择器里面的子元素":["5.2"],"e":["5.2","18.0","78.18"],"first":["5.2","124.3"],"child":["5.2","76.17"],"伪元素选择器可以帮助我们利用css创建新标签元素":["5.3"],"而不需要html标签":["5.3"],"从而简化html结构":["5.3"],"before":["5.3"],"input":["5.4","50.3","124.6","124.9"],"checked":["5.4"],"选择单选或者复选框选中状态":["5.4"],"实现跳转内容":["5.6"],"seo":["6.1"],"search":["6.1"],"title":["6.2"],"网站标题":["6.2"],"description":["6.3"],"网站描述":["6.3"],"简要说明我们网站主要是做什么的":["6.3"],"我们提倡":["6.3"],"keywords":["6.4"],"关键字":["6.4","55.12","89.1"],"是页面关键词":["6.4"],"是搜索引擎的关注点之一":["6.4"],"seo优化":["7.0"],"里面首先放一个h1标签":["7.0"],"filter":["8.0","88.1"],"px":["8.1"],"调整图像的对比度":["8.2"],"将图像转换为灰度图像":["8.3","8.6"],"rotate":["8.4","11.3"],"shadow":["8.5","25.13","25.14"],"h":["8.5","67.5"],"v":["8.5","18.0"],"blur":["8.5"],"spread":["8.5"],"color":["8.5","20.0","23.1","65.9"],"给图像设置一个阴影效果":["8.5"],"阴影是合成在图像下面":["8.5"],"可以有模糊度的":["8.5"],"可以以特定颜色画出的遮罩图的偏移版本":["8.5"],"函数接受":["8.5"],"宽度计算":["9.0"],"过渡":["10.0"],"transition":["10.0"],"是css3中具有颠覆性的特征之":["10.0"],"我们可以在不使用":["10.0"],"flash":["10.0"],"2d转换":["11.0"],"转换":["11.0"],"改变盒子在平面内的状态":["11.1"],"translate":["11.2"],"语法":["11.2","14.1","23.3","23.4","25.13","25.14","28.2","28.3","32.10","115.4","115.5","121.1"],"2d旋转指的是让元素在2维平面内顺势针旋转或者逆时针旋转":["11.3"],"transform":["11.4","11.5","14.1"],"scale":["11.5"],"注意":["11.6","32.5"],"转换transform":["11.7"],"我们简单理解就是变形有2d和3d之分":["11.7"],"我们暂且学了三个":["11.7"],"keyframes":["12.1","12.2"],"是动画的开始":["12.1"],"描述":["12.2","27.3","66.1","115.4"],"规定动画":["12.2"],"animation":["12.2","12.3","12.4"],"所有动画属性的简写属性":["12.2"],"动画名称":["12.3"],"持续时间":["12.3"],"timing":["12.4"],"function":["12.4","62.11","62.14","64.4","65.9","66.3","78.11","78.16","87.3","88.1","89.1","92.0","105.0","110.3","114.1","120.1","122.5"],"目标":["13.0","14.0","14.2","14.3","14.4","14.5","30.2"],"使用rotate实现元素空间旋转效果":["14.3"],"使用transform":["14.4"],"使用scale实现空间缩放效果":["14.5"],"英文全名":["15.1"],"选择器分为":["16.2"],"基础选择器":["16.2"],"和":["16.2","76.9","86.10"],"复合选择器":["16.2"],"两大类":["16.2"],"先介绍基础选择器":["16.2"],"基础选择器是由":["16.2"],"单个选择器组成":["16.2"],"id选择器100":["16.3"],"内容":["17.1"],"content":["17.1","31.4"],"container":["17.1"],"导航":["17.1","17.5"],"nav":["17.1","91.6"],"侧栏":["17.1"],"sidebar":["17.1"],"栏目":["17.1"],"column":["17.1"],"注释的写法":["17.2"],"页面结构":["17.4"],"容器":["17.4"],"功能":["17.6"],"标志":["17.6"],"logo":["17.6"],"广告":["17.6"],"banner":["17.6"],"登陆":["17.6"],"字体大小":["17.9"],"标题栏样式":["17.11"],"主要的":["17.12"],"master":["17.12"],"ctrl":["18.0"],"s":["18.0","98.5"],"保存":["18.0"],"w":["18.0"],"关闭程序":["18.0"],"n":["18.0","92.0"],"新建":["18.0"],"o":["18.0"],"打开":["18.0"],"z":["18.0","27.12","54.8"],"撤销":["18.0"],"f":["18.0"],"查找":["18.0"],"x":["18.0","66.1","66.3","85.9"],"剪切":["18.0"],"c":["18.0","65.9","69.9"],"复制":["18.0"],"粘贴":["18.0"],"a":["18.0","22.3","46.0","54.8","85.11","93.11"],"全选":["18.0"],"缩小文字":["18.0"],"放大文字":["18.0"],"b":["18.0","22.3","85.11"],"粗体":["18.0"],"i":["18.0","62.14","69.9"],"斜体":["18.0"],"u":["18.0"],"下划线":["18.0"],"shift":["18.0","21.2"],"输入法切换":["18.0"],"空格":["18.0"],"中英文切换":["18.0"],"回车":["18.0"],"qq号中发送信息":["18.0"],"home":["18.0"],"光标快速移到文件头":["18.0"],"end":["18.0","68.7"],"光标快速移到文件尾":["18.0"],"esc":["18.0"],"显示开始菜单":["18.0"],"快速缩小文字":["18.0"],"快速放大文字":["18.0"],"f5":["18.0"],"在ie中强行刷新":["18.0"],"拖动文件":["18.0"],"复制文件":["18.0"],"backspace":["18.0"],"启动":["18.0"],"关闭输入法":["18.0"],"拖动文件时按住ctrl":["18.0"],"创建快捷方式":["18.0"],"alt":["18.0"],"关闭窗口":["18.0"],"最小化当前窗口":["18.0"],"r":["18.0"],"恢复最小化窗口":["18.0"],"最大化当前窗口":["18.0"],"m":["18.0"],"移动窗口":["18.0"],"改变窗口大小":["18.0"],"tab":["18.0"],"两个程序交换":["18.0"],"qq号中输入无名人":["18.0"],"打开文件菜单":["18.0"],"打开视图菜单":["18.0"],"打开编辑菜单":["18.0"],"打开插入菜单":["18.0"],"打开格式菜单":["18.0"],"t":["18.0"],"打开工具菜单":["18.0"],"font":["19.0"],"family":["19.0"],"字体":["19.0"],"解释":["20.0"],"用法":["20.0","115.2","115.4","115.5","121.1"],"文本颜色":["20.0"],"生成标签直接输入标签名按tab键即可比如":["21.1"],"div":["21.1","34.0","78.19","116.1","120.1","122.7","124.2","124.3","124.4","124.6","124.7"],"然后tab键":["21.1"],"就可以生成":["21.1"],"如果想要生成多个相同标签加上":["21.1"],"就可以了比如":["21.1"],"3就可以快速生成3个div":["21.1"],"vscode快速格式化代码":["21.2"],"作用":["22.1","31.3","32.12","48.0"],"网页的标签非常多":["22.1"],"常见的块元素有":["22.2"],"h1":["22.2","44.2"],"h6":["22.2"],"p":["22.2"],"常见的行内元素有":["22.3"],"strong":["22.3"],"特殊情况下":["22.4"],"background":["23.1","23.2","23.3","23.4","23.5"],"repeat":["23.3"],"position":["23.4","121.2"],"attachment":["23.5"],"相同选择器给设置相同的样式":["24.1"],"css中的继承":["24.2"],"20230414181520748":["24.4"],"本质":["25.0"],"border":["25.3","25.4","25.5","25.6","25.8","25.12"],"style":["25.5"],"20230414184451480":["25.5"],"参数":["25.5"],"collapse":["25.8"],"padding属性用于设置内边距":["25.9"],"即边框与内容之间的距离":["25.9"],"会影响盒子实际大小":["25.9"],"已有宽高":["25.9"],"会撑大盒子":["25.9"],"margin属性用于设置外边距":["25.10"],"即控制盒子和盒子之间的距离":["25.10"],"margin简写和padding一样":["25.10"],"外边距可以让块级盒子水平居中":["25.10"],"嵌套块元素塌陷":["25.11"],"相邻块元素垂直外边距的合并":["25.11"],"当上下相邻的两个块元素":["25.11"],"box":["25.13"],"text":["25.14","39.3"],"怪异盒":["25.15"],"css3中可以通过box":["25.15"],"sizing来指定盒模型":["25.15"],"传统网页布局的三种方式":["26.0"],"普通流":["26.0"],"标准流":["26.0"],"float属性用于创建浮动框":["26.1"],"将其移动到一边":["26.1"],"加了浮动之后的元素":["26.2"],"会具有很多特性需要我们掌握的":["26.2"],"清除浮动本质":["26.4"],"清除浮动的本质是清除浮动元素造成的影响":["26.4"],"如果父盒子本身有高度":["26.4"],"也称为隔墙法":["26.6"],"是w3c推荐的做法":["26.6"],"可以给父级添加overflow属性":["26.7"],"after方式是额外标签法的升级版":["26.8"],"也是给父元素添加":["26.8","26.9"],"为什么需要清除浮动":["26.10"],"父级没高度":["26.10"],"某个元素可以自由在一个盒子内移动位置":["27.0"],"决定元素的定位方式":["27.2"],"边偏移属性":["27.3"],"示例":["27.3","66.1"],"静态定位是元素的":["27.5"],"相对定位是元素在移动位置的时候":["27.6"],"是相对于它":["27.6","27.7"],"绝对定位是元素在移动位置的时候":["27.7"],"固定定位是元素固定于浏览器可视区的位置":["27.8"],"sticky":["27.10"],"粘性定位可以被认为是相对定位和固定定位的混合":["27.10"],"index":["27.12","69.5","88.1","120.1"],"在使用定位布局时":["27.12"],"绝对定位和固定定位也和浮动类似":["27.14"],"浮动元素":["27.15"],"固定定位":["27.16"],"类似网站广告":["28.0"],"display属性用于设置":["28.1"],"个元索应如何显示":["28.1"],"display":["28.1"],"none":["28.1"],"隐藏对象":["28.1"],"block":["28.1"],"除了转换为块级元索之外":["28.1"],"同时还有显示元素的意思":["28.1"],"display隐藏元素":["28.1"],"不再占有原来的位置":["28.1"],"溢出":["28.3"],"字体图标使用场景":["29.1"],"主要用于显示网页中通用":["29.1"],"常用的一些小图标":["29.1"],"精灵图是有诸多优点的":["29.1"],"但是缺点很明显":["29.1"],"字体文件格式":["29.2"],"不同浏览器所支持的字体格式是不样的":["29.2"],"字体图标之所以兼容":["29.2"],"就是因为包含了生流浏览器支持的字体文件":["29.2"],"turetype":["29.2"],"tt":["29.2"],"格式t字体":["29.2"],"是windows和mac的最常见的字体":["29.2"],"支持这种字体的浏览器有ie9":["29.2"],"firefox3":["29.2"],"chrome4":["29.2"],"屏幕尺寸":["30.1"],"指的是屏幕对角线的长度":["30.1"],"使用meta标签设置视口宽度":["30.2"],"制作适配不同设备宽度的网页":["30.2"],"网页宽度和设备宽度":["30.2"],"分辨率":["30.2","33.3"],"相同":["30.2"],"能够使用像素大厨软件测量二倍图中元素的尺寸":["30.3"],"现阶段设计稿参考iphone6":["30.4"],"能够使用百分比布局开发网页":["30.5"],"问题":["31.1","109.4"],"是一种浏览器提倡的布局模型":["31.2"],"基于flex精确灵活控制块级盒子的布局方式":["31.3"],"避免浮动布局中脱离文档流现象发生":["31.3"],"justify":["31.4"],"修改主轴对齐方式":["31.4"],"使用justify":["31.4"],"align":["31.5","37.0"],"items":["31.5"],"使用align":["31.5"],"items调节元素在侧轴的对齐方式":["31.5"],"flex":["31.6","31.7"],"direction":["31.7"],"使用flex":["31.7","31.8"],"direction改变元素排列方向":["31.7"],"wrap实现弹性盒子多行排列效果":["31.8"],"rem":["32.0"],"能够使用rem单位设置网页元素的尺寸":["32.2"],"网页效果":["32.2"],"媒体查询":["32.3"],"能够使用媒体查询设置差异化css样式":["32.3"],"能够":["32.3"],"目前rem布局方案中":["32.4"],"将网页等分成10份":["32.4"],"html标签的字号为视口宽度的":["32.4"],"设备范围":["32.5"],"默认样式":["32.5"],"默认样式要写在最前面":["32.5"],"打印样式":["32.5"],"media":["32.5"],"使用flexible":["32.6"],"less是一个css预处理器":["32.7"],"使用less运算写法完成px单位到rem单位的转换":["32.8"],"导入":["32.9"],"单行注释":["32.10"],"加减乘除的基本表达式":["32.11"],"不能单独写100":["32.11"],"把颜色提前存储到一个容器":["32.13"],"方法一":["32.15"],"配置easyless插件":["32.15"],"在less文件第一行添加":["32.16"],"vh适配":["32.17"],"vh":["32.18"],"相对单位":["32.18"],"vw单位尺寸":["32.19"],"开发常用写法":["33.0"],"媒体特性常用写法":["33.0"],"max":["33.0","62.14","66.3"],"width":["33.0","39.4","121.1"],"完整写法":["33.1"],"能够根据设备宽度的变化":["33.2"],"设置差异化样式":["33.2"],"媒体是用来区分设备类型的":["33.2"],"媒体特性主要用来描述媒体类型的具体特征":["33.3"],"如当前屏幕的宽高":["33.3"],"什么是界面样式":["35.0"],"cursor":["35.1"],"设置或检索在对象上移动的鼠标指针采用何种系统预定义的光标形状":["35.1"],"outline":["35.2"],"textarea":["35.3"],"bug":["36.0"],"垂直居中":["37.0"],"css的vertical":["37.0"],"align属性使用场景":["37.0"],"必须满足三个条件":["38.1"],"有较大兼容性问题":["38.2"],"适合于webkit浏览器或移动端":["38.2"],"移动端大部分是webkit内核":["38.2"],"盒子左浮":["39.1"],"边框重叠解决方法":["39.1"],"20230414193432997":["39.4"],"不同浏览器对有些标签的默认值是不同的":["40.0"],"为了消除不同浏览器对html文本呈现的差异":["40.0"],"照顾浏览器的兼容":["40.0"],"object":["41.0","79.1","85.2","88.3"],"fit":["41.0"],"一个网页中往往会应用很多小的背景图像作为修饰":["42.1"],"当网页中的图像过多时":["42.1"],"sprites":["42.2"],"使用":["42.2","69.5","110.2"],"html结构":["43.1"],"表现":["43.1"],"w3c制定了结构html的语法":["43.1"],"标准":["43.1","76.4","78.18"],"css表现":["43.1"],"样式":["43.1"],"w3c制定了表现css的语法":["43.1"],"js行为":["43.1"],"标签":["43.2","76.1"],"我们使用vscode的快捷方式来创建基本标签时":["43.2"],"会出现如下图所示的情况":["43.2"],"是用来定义当前文档显示的语言":["43.3"],"字符集":["43.4"],"character":["43.4"],"set":["43.4"],"是多个字符的集合":["43.4"],"以便计算机能够识别和存储各种文字":["43.4"],"在":["43.4","62.7","62.13","78.22","108.2","109.9"],"head":["43.4","95.8"],"标签内":["43.4"],"可以通过":["43.4"],"meta":["43.4"],"标签的charset属性来规定html文档应该使用哪种字符编码":["43.4"],"charset":["43.4"],"utf":["43.4"],"常规标记":["44.1"],"双标记":["44.1"],"单标记":["44.1"],"含义":["44.2"],"语法书写和语法":["44.2"],"文本标题":["44.2"],"文章或者重点标题":["44.2"],"h2":["44.2"],"大模块的标题":["44.2"],"同类型标签相互嵌套":["44.3"],"nbsp":["44.4"],"20230413195852071":["48.0"],"table":["48.0"],"form":["50.1"],"method":["50.1"],"get或者post":["50.1"],"action":["50.1"],"向何处发送表单数据":["50.1"],"包含表单元素的区域":["50.2"],"label":["50.3","50.4"],"for":["50.3","58.4","60.10","62.14","65.8"],"fieldset":["50.4"],"表单字段集":["50.4"],"对表单内容分组和嵌套":["50.4"],"lengend":["50.4"],"表单字段集标题":["50.4"],"提示信息":["50.4"],"for属性可以绑定input控件":["50.4"],"body":["50.4","78.13","78.14","78.19","91.5","91.6"],"1994年":["51.1"],"网景公司":["51.1"],"netscape":["51.1"],"发布了navigator浏览器0":["51.1"],"9版":["51.1"],"这是世界上第一款比较成熟的网络浏览器":["51.1"],"常见的网页效果":["51.2"],"表单验证":["51.2"],"轮播图":["51.2"],"完整的javascript实现包含以下几个部分":["52.0"],"es6":["52.2","105.0","108.2","108.3"],"类":["52.2"],"模块":["52.2"],"迭代器":["52.2"],"生成器":["52.2"],"箭头函数":["52.2"],"期约":["52.2"],"文档对象模型":["52.3","72.1"],"提供与网页内容交互的方法和接口":["52.3"],"浏览器对象模型":["52.4","79.1"],"行内式js":["53.1"],"javascript":["53.1","54.9","55.4","55.5","57.8","60.3","60.10","62.4","62.8","62.11","62.13","62.14","64.4","65.8","65.9","66.2","66.3","67.1","67.4","67.5","68.1","68.5","69.1","69.7","69.8","69.9","73.2","73.3","73.5","73.6","74.1","75.4","75.8","76.3","76.4","76.5","76.6","76.11","76.12","76.14","76.15","76.16","76.17","76.18","78.6","78.8","78.10","78.11","78.16","78.19","78.21","81.1","81.2","85.6","85.8","85.9","85.10","85.11","85.12","87.2","87.3","91.5","91.6","92.0","92.3","93.11","93.19","95.2","95.3","95.7","95.8","98.5","100.4","101.1","103.1","105.0","108.7","109.9","111.1","111.4","112.1","114.1","117.1","117.5","124.1","124.2","124.3","124.4","124.5","124.6","124.7","124.8","124.9"],"方法":["53.3","66.1","88.1","89.5","89.6","89.7","103.4","109.6","109.10","109.11"],"变量是用于存放数据的":["54.2"],"变量在使用时分为两步":["54.3"],"声明变量":["54.3"],"一个变量被重新复赋值后":["54.5"],"同时声明多个变量时":["54.6"],"情况":["54.7"],"结果":["54.7"],"由字母":["54.8"],"za":["54.8"],"数字":["54.8"],"变量是用来存储值的所在处":["55.1"],"它们有名字和数据类型":["55.1"],"变量的数据类型决定了如何将代表这些值的位存储到计算机的":["55.1"],"默认值":["55.3"],"number":["55.3"],"数字型number":["55.4"],"数字类型既可以用来保存整数值":["55.4"],"也可以保存小数":["55.4"],"浮点数":["55.4"],"var":["55.4","55.5","55.11","60.3","60.10","62.14","64.4","65.9","67.4","68.1","68.5","69.1","69.8","92.3"],"age":["55.4","85.12","87.3"],"整数":["55.4"],"字符串型string":["55.5"],"字符串型可以是引号中的任意文本":["55.5"],"其语法为双引号":["55.5"],"和单引号":["55.5"],"布尔型boolean":["55.6"],"undefined":["55.7"],"一个声明后没有被赋值的变量会有一个默认值":["55.7"],"null":["55.8"],"一个声明变量给":["55.8"],"typeof":["55.10"],"使用表单":["55.11"],"prompt":["55.11"],"获取过来的数据默认是字符串类型的":["55.11"],"此时就不能直接简单的进行加法运算":["55.11"],"而需要转换变量的数据类型":["55.11"],"通俗来说":["55.11"],"就是把一种数据类型的变量转换成另外一种数据类型":["55.11"],"转换为字符串类型":["55.11"],"方式":["55.11"],"案例":["55.11","67.5"],"tostring":["55.11"],"转成字符串":["55.11"],"保留字":["55.12"],"标识":["55.12"],"zhi":["55.12"],"符":["55.12"],"就是指开发人员为变量":["55.12"],"函数":["55.12","62.1"],"参数取的名字":["55.12"],"概念":["56.2","56.8","56.9","56.11"],"算术运算使用的符号":["56.2"],"用于执行两个变量或值的算术运算":["56.2"],"浮点数值的最高精度是":["56.3"],"表达式":["56.4","57.8"],"如果需要反复给数字变量添加或减去1":["56.5"],"可以使用":["56.5","109.9"],"递增":["56.5"],"num":["56.6","56.7","64.4"],"关系运算符":["56.8"],"是两个数据进行比较时所使用的运算符":["56.8"],"比较运算后":["56.8"],"逻辑运算符是用来进行布尔值运算的运算符":["56.9"],"逻辑中断":["56.10"],"短路运算的原理":["56.10"],"当有多个表达式":["56.10"],"优先级":["56.12"],"运算符":["56.12","104.4"],"顺序":["56.12"],"在一个程序执行的过程中":["57.1"],"顺序结构是程序中最简单":["57.2"],"由上到下执行代码的过程中":["57.3"],"else语句":["57.5"],"双分支语句":["57.5"],"else":["57.6","57.9"],"语句":["57.6"],"三元表达式也能做一些简单的条件选择":["57.7"],"由三元运算符组成的式子称为三元表达式":["57.7"],"语法结构":["57.7","58.4"],"switch":["57.8"],"语句也是多分支语句":["57.8"],"它用于基于不同的条件来执行不同的代码":["57.8"],"当要针对变量设置一系列的特定值的选项时":["57.8"],"就可以使用":["57.8"],"if":["57.9","62.14","92.0"],"语句的区别":["57.9"],"①":["57.9"],"在实际问题中":["58.2"],"在js中":["58.3"],"断点调试是指自己在程序的某一行设置一个断点":["58.5"],"调试时":["58.5"],"程序运行到这一行就会停住":["58.5"],"然后你可以一步一步往下调试":["58.5"],"调试":["58.5"],"过程中可以看各个变量当前的值":["58.5"],"出错的话":["58.5"],"调试到出错的代码行即显示错误":["58.5"],"停下":["58.5"],"断点调试可以帮我们观察程序的运行过程":["58.5"],"浏览器中按":["58.5"],"f12":["58.5","91.3"],"sources":["58.5"],"找到需要调试的文件":["58.5"],"循环嵌套是指在一个循环语句中再定义一个循环语句的语法结构":["58.6"],"例如在for循环语句中":["58.6"],"可以再嵌套一个":["58.6"],"while":["58.7","58.8"],"语句可以在条件表达式为真的前提下":["58.7"],"循环执行指定的一段代码":["58.7"],"循环":["58.8"],"break循环":["58.9"],"continue":["58.10","62.12"],"关键字用于立即跳出本次循环":["58.10"],"继续下一次循环":["58.10"],"本次循环体中":["58.10"],"break":["58.11"],"关键字用于立即跳出整个循环":["58.11"],"变量":["59.1"],"操作符左右两侧尽量保留一个空格":["59.2"],"单行注释前面注意有一个空格":["59.3"],"数组是指一组数据的集合":["60.1"],"利用new创建数组":["60.3"],"数组元素可以是任何类型的值":["60.4"],"索引":["60.6"],"下标":["60.6"],"用来访问数组元素的序号":["60.6"],"数组下标从0开始":["60.6"],"遍历":["60.7","88.1"],"就是把数组中的每个元素从头到尾都访问一次":["60.7"],"数组名":["60.8"],"升序":["60.10"],"arr":["60.10","68.1","68.2","68.5","88.1"],"参考文献":["61.0"],"数组":["61.1"],"mdn解释":["61.2"],"数组是一种类列表对象":["61.2"],"它的原型中提供了遍历和修改元素的相关操作":["61.2"],"数组的元素类型和长度不固定":["61.2"],"其长度可以随时改变":["61.2"],"数组的索引必须是整数":["61.2"],"其中包含的内容":["61.3"],"instanceof":["61.6","68.2","104.4"],"可以通过其原型链上是否存在array原型对象来判断该对象类型":["61.6"],"因为数组对象是由构造函数产生":["61.6"],"在原型链的底层是一个array的类的构造函数":["61.6"],"只要在原型链上有array的原型对象":["61.6"],"即可判断该对象的类型":["61.6"],"如何确定这个方法可行呢":["61.6"],"例子如下":["61.6"],"isarray":["61.7"],"推荐":["61.7"],"array":["61.7","68.2","88.1","103.3"],"用于确定":["61.7"],"传递的值":["61.7"],"是否是一个":["61.7"],"函数在使用时分为两步":["62.2"],"调用函数":["62.4","62.11"],"形参和实参":["62.7"],"声明函数":["62.7","62.11"],"时":["62.7"],"函数参数的传递过程":["62.8"],"函数形参和实参个数不匹配问题":["62.9"],"参数个数":["62.9"],"实参个数等于形参个数":["62.9"],"sum":["62.11"],"return":["62.11","62.14","66.3","85.10"],"此时":["62.11"],"的值就等于666":["62.11"],"因为":["62.11"],"当我们不确定有多少个参数传递的时候":["62.13"],"可以用":["62.13"],"arguments":["62.13","62.14"],"来获取":["62.13"],"利用函数求任意个数的最大值":["62.14"],"getmax":["62.14"],"length":["62.14"],"console":["62.14","64.4","65.9","66.2","66.3","81.2"],"log":["62.14","64.4","65.9","66.2","66.3"],"利用函数关键字自定义函数":["62.15"],"命名函数":["62.15"],"通常来说":["63.1"],"全局变量":["63.5"],"从执行效率来看全局变量和局部变量":["63.7"],"全局变量只有在浏览器关闭的时候才会销毁":["63.7"],"比较占内存资源":["63.7"],"只要有代码":["63.9"],"javascript代码是由浏览器中的javascript解释器来执行的":["64.1"],"变量提升":["64.2","64.3","64.4"],"函数提升":["64.4"],"把所有函数声明提升到当前作用域的最前面":["64.4"],"不调用函数":["64.4"],"预解析案例":["64.4"],"先变量提升":["64.4"],"再依次罗列":["64.4"],"num没有声明":["64.4"],"结果是undefined":["64.4"],"执行步骤":["64.4"],"fn":["64.4","65.9","87.1","92.0","117.1"],"对象是一个具体的事物":["65.1","85.3"],"在javascript中":["65.1","93.5"],"对象是一组无序的相关属性和方法的集合":["65.1"],"利用字面量创建对象":["65.3"],"对象字面量":["65.3"],"就是花括号":["65.3"],"里面包含了表达这个具体事物":["65.3"],"对象":["65.3","84.0"],"的属性和方法":["65.3"],"一":["65.4"],"对象调用":["65.4"],"相同点":["65.4","89.8"],"利用new":["65.5"],"object创建对象":["65.5"],"利用构造函数创建对象":["65.6"],"因为我们前面两种创建对象的方式一次只能创建一个对象":["65.6"],"构造函数":["65.6","86.10"],"是一种特殊的函数":["65.6"],"主要用来初始化对象":["65.6"],"即为对象成员变量赋初始值":["65.6"],"它总与":["65.6"],"new":["65.6","65.9","67.1"],"in":["65.8"],"语句用于对数组或者对象的属性进行循环操作":["65.8"],"创建一个电脑对象":["65.9"],"有颜色":["65.9"],"重量":["65.9"],"weight":["65.9"],"品牌":["65.9"],"brand":["65.9"],"型号":["65.9"],"等属性":["65.9"],"有看电影":["65.9"],"watch":["65.9"],"听音乐":["65.9"],"listen":["65.9"],"打游戏":["65.9"],"play":["65.9"],"和敲代码":["65.9"],"coding":["65.9"],"等方法":["65.9"],"题目描述":["65.9"],"颜色":["65.9"],"型号是属性":["65.9"],"看电影":["65.9"],"敲代码是方法":["65.9"],"在调用方法时分别打印":["65.9"],"我在看电影":["65.9"],"敲代码":["65.9"],"函数创建方法":["65.9"],"computer":["65.9"],"this":["65.9","85.9","85.12","87.3","89.3"],"我在听音乐":["65.9"],"我在打游戏":["65.9"],"我在敲代码":["65.9"],"red":["65.9"],"math数学对象":["66.0"],"math":["66.1","66.3"],"pi":["66.1"],"表示一个圆的周长与直径的比例":["66.1"],"输出为3":["66.1"],"141592653589793":["66.1"],"abs":["66.1"],"函数返回指定数字":["66.1"],"的绝对值":["66.1"],"ceil":["66.1"],"返回大于或等于一个给定数字的最小整数":["66.1"],"小于0时向上取整":["66.1"],"如":["66.1","69.9","81.5"],"输出为":["66.1"],"round":["66.2"],"取整方法":["66.2"],"向下取整":["66.2"],"floor":["66.2"],"random随机数":["66.3"],"random返回一个随机小数":["66.3"],"不跟参数":["66.3"],"待验证":["66.3"],"得到两个数之间的随机整数":["66.3"],"并且包含这两个整数":["66.3"],"getrandom":["66.3"],"min":["66.3"],"方法的使用":["67.1"],"日期对象是一个构造函数":["67.1"],"必须使用new来调用创建我们的日期对象":["67.1"],"如果没有参数":["67.1"],"方法名":["67.2","68.3","68.4","68.5","68.6","68.7","69.4","69.5","69.6"],"代码":["67.2"],"getfullyear":["67.2"],"获取当年":["67.2"],"dobj":["67.2"],"getmonth":["67.2"],"获取当月":["67.2"],"getdate":["67.2"],"获取当天日期":["67.2"],"getday":["67.2"],"获取星期几":["67.2"],"周日0":["67.2"],"周六6":["67.2"],"date":["67.3","67.4"],"获取毫秒数的三种方法":["67.4"],"转换公式如下":["67.5"],"d":["67.5","93.16"],"parseint":["67.5"],"总秒数":["67.5"],"计算天数":["67.5"],"字面量":["68.1"],"原型的方式":["68.2"],"返回值":["68.3","68.5","68.7","82.2","82.3"],"push":["68.3"],"参数1":["68.3"],"末尾添加一个或多个元素":["68.3"],"注意修改原数组":["68.3"],"并返回新的长度":["68.3"],"pop":["68.3"],"删除数组最后一个元素":["68.3"],"把数组长度减1无参数":["68.3"],"修改原数组":["68.3"],"返回它删除的元素的值":["68.3"],"unshift":["68.3"],"向数组的开头添加一个或更多元素":["68.3"],"是否修改原数组":["68.4"],"reverse":["68.4"],"颠倒数组中元素的顺序":["68.4"],"无参数":["68.4"],"indexof":["68.5","69.4"],"数组中查找给定元素的第一个索引":["68.5"],"如果存在返回索引号":["68.5"],"如果不存在":["68.5"],"则返回":["68.5"],"lastindexof":["68.5"],"在数组中的最后一个索引":["68.5"],"以下有两个数组":["68.5"],"一个数组arr是班级里所有的学员的名称":["68.5"],"一个数组currentarr是提交了每日反馈的学员名单":["68.5"],"请创建一种算法":["68.5"],"把未提交每日反馈的学员筛选出来":["68.5"],"张瑞淑":["68.5"],"徐海涛":["68.5"],"谢岗岗":["68.5"],"薛鹏":["68.5"],"截取字符串":["68.7"],"concat":["68.7","69.6"],"链接两个数组":["68.7"],"不影响原数组":["68.7"],"返回一个新数组":["68.7"],"slice":["68.7"],"数组截取slice":["68.7"],"begin":["68.7"],"包括":["68.7"],"不包括":["68.7"],"str":["69.1","69.5"],"为了方便操作基本数据类型":["69.2"],"指里面的值不可变":["69.3"],"虽然看上去可以改变内容":["69.3"],"字符串所有的方法":["69.4"],"都不会修改字符串本身":["69.4"],"字符串是不可变的":["69.4"],"操作完成会返回一个新的字符串":["69.4"],"要查找的字符":["69.4"],"开始的位置":["69.4"],"返回制定内容在原字符串中的位置":["69.4"],"如果找不到就返回":["69.4"],"开始的位置是index索引号":["69.4"],"重点":["69.5","69.6","78.15","89.7","95.0","96.0","98.0","99.0","100.0","103.0","107.0","115.5"],"charat":["69.5"],"返回指定位置的字符":["69.5"],"字符串索引号":["69.5"],"charcodeat":["69.5"],"获取指定位置处字符的ascii码":["69.5"],"index索引号":["69.5"],"str1":["69.6"],"str2":["69.6"],"方法用于链接两个或多个字符串":["69.6"],"拼接字符串":["69.6"],"等效于":["69.6"],"转为数组":["69.7"],"replace":["69.7","93.18"],"被替换字符":["69.7"],"替换为的字符":["69.7"],"替换字符":["69.7"],"被替换的字符":["69.7"],"给定一个字符串":["69.9"],"abaasdffggghhjjkkgfddsssss3444343":["69.9"],"问题如下":["69.9"],"字符串的长度":["69.9"],"取出指定位置的字符":["69.9"],"9等":["69.9"],"查找指定字符是否在以上字符串中存在":["69.9"],"b等":["69.9"],"替换指定的字符":["69.9"],"g替换为22":["69.9"],"ss替换为b等操作方法":["69.9"],"截取指定开始位置到结束位置的字符串":["69.9"],"取得1":["69.9"],"5的字符串":["69.9"],"简单类型又叫做基本数据类型或者":["70.1"],"值类型":["70.1","70.3"],"复杂类型又叫做":["70.1"],"栈":["70.2"],"操作系统":["70.2"],"引用类型":["70.4"],"函数的形参也可以看做是一个变量":["70.5","70.6"],"mozilla":["71.1"],"开发者网络":["71.1"],"document":["72.1","73.3","76.19","78.13"],"20220417210945485":["72.2"],"使用getelementbyid":["73.1"],"使用getelementsbytagname":["73.2"],"方法可以返回带有指定标签名的对象的集合":["73.2"],"ul":["73.2","91.6","122.5"],"li":["73.2","91.6","115.5","120.2","122.5"],"①getelementsbyclassname":["73.3"],"根据类名返回元素对象集合":["73.3"],"鼠标事件":["74.4","78.23"],"触发条件":["74.4","78.23","78.26"],"javascript的dom的操作可以改变网页内容":["75.0"],"从起始位置到终止位置的内容":["75.1"],"element":["75.2","75.8","75.11","76.19","78.11","120.4","122.2","122.9"],"获取内置属性值":["75.6"],"设置内置属性值":["75.7"],"自定义属性的目的":["75.9"],"h5规定自定义属性":["75.10"],"兼容性获取":["75.11"],"getattribute":["75.11"],"获取元素通常使用两种方式":["76.0"],"网页中的所有内容都是节点":["76.1"],"文本":["76.1"],"注释等":["76.1"],"在dom":["76.1"],"利用dom树可以把节点划分为不同的层级关系":["76.2"],"node":["76.3","76.14","76.16","76.17","76.18","108.4"],"parentnode":["76.3","76.4","76.6"],"属性可以返回某节点的父结点":["76.3"],"childnodes":["76.4"],"lastchild":["76.6","76.9"],"兼容性":["76.7","76.8","76.13","76.14"],"实际开发中":["76.9"],"firstchild":["76.9"],"包含其他节点":["76.9"],"previouselementsibling":["76.14"],"appendchild":["76.16"],"removechild":["76.17"],"doucument":["76.19"],"write":["76.19"],"innerhtml":["76.19"],"带引号":["77.1"],"不带引号":["77.2","77.3"],"主要修改dom的元素属性":["77.4"],"dom元素的内容":["77.4"],"主要获取查询dom的元素":["77.5"],"主要针对于自定义属性":["77.6"],"能够写出元素注册事件的两种方式":["78.1"],"绑定事件":["78.2","122.4"],"给元素添加事件":["78.3"],"称为注册事件或者绑定事件":["78.3"],"注册事件有两种方式":["78.3"],"传统方式和方法监听注册方式":["78.3"],"1addeventlistener事件监听方式":["78.4"],"最佳方案":["78.4"],"eventtarget":["78.4","78.8","78.10","78.16"],"addeventlistener":["78.4"],"方法将指定的监听器注册到":["78.4"],"2attachevent事件监听方式":["78.5"],"兼容":["78.5","78.9"],"了解":["78.5"],"3注册事件兼容性解决方案":["78.6"],"兼容性处理的原则":["78.6"],"首先照顾大多数浏览器":["78.6"],"再处理特殊浏览器":["78.6"],"解绑事件":["78.7","122.6"],"removeeventlistener":["78.8","78.11"],"不考虑":["78.9"],"事件流":["78.12"],"描述的是从页面中接收事件的顺序":["78.12"],"事件":["78.12"],"发生时会在元素节点之间按照特定的顺序传播":["78.12"],"father":["78.13","78.14","85.9","85.10","85.11","85.12","87.3"],"son":["78.13","78.14"],"js":["78.13","123.5"],"代码中只能执行捕获或者冒泡其中的一个阶段":["78.13"],"onclick":["78.16"],"event":["78.16"],"这个":["78.16"],"事件对象本身的获取存在兼容问题":["78.17"],"标准浏览器中是浏览器给方法传递的参数":["78.17"],"事件对象属性方法":["78.18"],"target":["78.18"],"返回触发事件的对象":["78.18"],"事件冒泡":["78.20"],"开始时由最具体的元素接收":["78.20"],"然后逐级向上传播到到":["78.20"],"dom":["78.20","79.2"],"代理":["78.22"],"委派":["78.22"],"事件委托也称为事件代理":["78.22"],"contextmenu":["78.24"],"event对象代表事件的状态":["78.25"],"跟事件相关的一系列信息的集合":["78.25"],"现阶段我们主要是用鼠标事件对象":["78.25"],"mouseevent":["78.25"],"和键盘事件对象":["78.25"],"键盘事件":["78.26"],"onkeyup":["78.26"],"键盘事件对象":["78.27"],"bom":["79.1","79.2"],"browser":["79.1"],"model":["79.1"],"20230415022303647":["79.2"],"比":["79.2"],"更大":["79.2"],"它包含":["79.2"],"对象的常见事件":["80.0"],"window":["80.1","80.3","80.4","82.0","84.0"],"onload":["80.1"],"是窗口":["80.1"],"页面":["80.1"],"加载事件":["80.1"],"当文档内容完全加载完成会触发该事件":["80.1"],"load":["80.2","81.5"],"onresize":["80.3"],"是调整窗口大小加载事件":["80.3"],"定时器":["80.5","80.7"],"方法用于设置一个定时器":["80.5"],"该定时器在定时器到期后执行调用函数":["80.5"],"停止定时器":["80.6"],"this的指向在函数定义的时候是确定不了的":["80.8"],"语言的一大特点就是":["81.1"],"单线程":["81.1"],"以下代码执行的结果是什么":["81.2"],"为了解决这个问题":["81.3"],"利用多核":["81.3"],"同步任务都在主线程上执行":["81.4"],"js中的异步是通过回调函数实现的":["81.5"],"异步任务有以下三种类型":["81.5"],"普通事件":["81.5"],"click":["81.5","122.5"],"resize":["81.5"],"等":["81.5"],"资源加载":["81.5"],"error":["81.5"],"统一资源定位符":["82.1"],"uniform":["82.1"],"resouce":["82.1"],"locator":["82.1"],"是互联网上标准资源的地址":["82.1"],"互联网上的每个文件都有一个唯一的":["82.1"],"location":["82.2","82.3"],"href":["82.2"],"获取或者设置整个url":["82.2"],"navigator":["83.0"],"对象包含有关浏览器的信息":["83.0"],"它有很多属性":["83.0"],"我们常用的是":["83.0"],"useragent":["83.0"],"该属性可以返回由客户机发送服务器的":["83.0"],"对象给我们提供了一个":["84.0"],"history":["84.0"],"process":["85.1"],"oriented":["85.2"],"class":["85.4","85.5","85.6","85.9","85.10","85.11","85.12","91.6"],"name":["85.5","124.6"],"创建类":["85.6"],"子类可以继承父类的方法":["85.8"],"用于访问和调用对象父类上的函数":["85.9"],"可以调用父类的构造函数":["85.9"],"也可以调用父类的普通函数":["85.9"],"constructor":["85.9","85.12"],"y":["85.9"],"say":["85.10"],"woshi":["85.10"],"参数一定要给super":["85.11"],"super要放在this前面":["85.11"],"实例化写在创建类的下面":["85.12"],"不然会报错":["85.12"],"方法里面传参":["85.12"],"如果不声明形参":["85.12"],"需要用this":["85.12"],"uname":["85.12","87.3"],"在典型的oop的语言中":["86.1"],"就是通过构造函数内部通过this添加的成员":["86.3"],"静态成员只能通过构造函数来访问":["86.4"],"存在浪费内存的问题":["86.7"],"构造函数通过原型分配的函数是所有对象所":["86.8"],"共享的":["86.8"],"javascript规定":["86.8"],"每一个构造函数都有一个prototype属性":["86.8"],"指向另一个对象":["86.8"],"proto":["86.9","86.10"],"对象都会有一个属性":["86.9"],"指向构造函数的prototype原型对象":["86.9"],"之所以我们对象可以使用构造函数prototype原型对象的属性和方法":["86.9"],"就是因为对象有":["86.9"],"原型存在":["86.9"],"对象原型":["86.10"],"prototype":["86.10","109.9"],"原型对象":["86.10"],"里面都有一个属性constructor属性":["86.10"],"constructor我们称为构造函数":["86.10"],"因为它指回构造函数本身":["86.10"],"constructor主要用于记录该对象引用于哪一个构造函数":["86.10"],"它可以让原型对象重新指向原来的构造函数":["86.10"],"实例":["86.11"],"只要是对象就有":["86.12"],"规则":["86.13"],"当访问一个对象的属性":["86.13"],"可以通过原型对象":["86.15"],"对原来的内置对象进行扩展自定义方法":["86.15"],"比如给数组增加自定义求偶数和的功能":["86.15"],"es6之前没有给我们提供extends继承":["87.0"],"调用这个函数":["87.1"],"并且修改函数运行时的this指向":["87.1"],"thisarg":["87.1"],"arg1":["87.1"],"arg2":["87.1"],"当前调用函数this的指向对象":["87.1"],"核心原理":["87.2"],"通过call":["87.2"],"把父类型的this指向子类型的this":["87.2"],"这样就可以实现子类型继承父类型的属性":["87.2"],"父构造函数":["87.3"],"this指向父构造函数的对象实例":["87.3"],"es6通过类实现面向对象编程":["87.4"],"语法糖是一种便捷的写法":["87.5"],"迭代":["88.1"],"foreach":["88.1"],"map":["88.1"],"some":["88.1"],"every":["88.1"],"currentvalue":["88.1"],"数组当前项的值":["88.1"],"trim":["88.2"],"方法会从一个字符串的两端删除空白字符":["88.2"],"defineproperty":["88.3"],"定义对象中新属性或修改原有的属性":["88.3"],"函数声明方式":["89.1"],"普通函数":["89.2"],"指向":["89.3"],"是当我们调用函数的时候确定的":["89.3"],"javascript为我们专门提供了一些函数方法来帮我们更优雅的处理函数内部this的指向问题":["89.4"],"方法调用一个对象":["89.5"],"简单理解为调用函数的方式":["89.5","89.6"],"方法调用一个函数":["89.6"],"apply":["89.8"],"bind总结":["89.8"],"javascript除了提供正常模式外":["90.1"],"还提供了":["90.1"],"严格模式":["90.1"],"严格模式可以应用到":["90.2"],"为脚本开启严格模式":["90.3"],"在正常模式下":["90.6"],"以前在全局作用域函数中的this指向window对象":["90.7"],"函数不能有重名的参数":["90.8"],"是对其他函数进行操作的函数":["90.9"],"它":["90.9"],"变量根据作用域的不同分为两种":["91.1"],"闭包":["91.2"],"打开浏览器":["91.3"],"按":["91.3"],"延伸变量的作用范围":["91.4"],"榴莲":["91.6"],"臭豆腐":["91.6"],"鲱鱼罐头":["91.6"],"大猪蹄子":["91.6"],"如果":["92.0"],"一个函数在内部可以调用其本身":["92.0"],"那么这个函数就是":["92.0"],"递归函数":["92.0"],"简单理解":["92.0"],"函数内部自己调用自己":["92.0"],"这个函数就是递归函数":["92.0"],"递归函数的作用和循环效果一样":["92.0"],"由于递归很容易发生":["92.0"],"栈溢出":["92.0"],"错误":["92.0"],"stack":["92.0"],"overflow":["92.0"],"所以":["92.0"],"必须要加退出条件return":["92.0"],"递归求阶乘":["92.0"],"浅拷贝只是拷贝一层":["92.2","92.3"],"更深层次对象级别的只拷贝引用":["92.2","92.3"],"深拷贝拷贝多层":["92.2","92.3"],"每一级别的数据都会拷贝":["92.3"],"obj":["92.3"],"id":["92.3","124.6"],"正则表达式":["93.2"],"regular":["93.2"],"灵活性":["93.3"],"逻辑性和功能性非常强":["93.3"],"test":["93.6","124.6"],"一个正则表达式可以":["93.7"],"由简单的字符构成":["93.7"],"比如":["93.7"],"正则表达式中的边界符":["93.8"],"位置符":["93.8"],"用来":["93.8"],"提供字符所处的位置":["93.8"],"主要有两个字符":["93.8"],"表示匹配行首的文本":["93.8"],"字符类表示有一系列字符可供选择":["93.9"],"多选一":["93.10"],"范围符":["93.11"],"量词符用来设定某个模式出现的次数":["93.12"],"量词":["93.12"],"只能多选1":["93.13"],"功能需求":["93.14"],"如果用户名输入合法":["93.14"],"则后面提示信息为":["93.14"],"用户名合法":["93.14"],"并且颜色为绿色":["93.14"],"大括号":["93.15"],"量词符":["93.15"],"里面面表示重复次数":["93.15"],"预定义类指的是":["93.16"],"某些常见模式的简写写法":["93.16"],"预定类":["93.16"],"匹配0":["93.16"],"分析":["93.17"],"手机号码":["93.17"],"方法可以实现替换字符串操作":["93.18"],"用来替换的参数可以是一个字符串或是一个正则表达式":["93.18"],"什么是ecma":["94.3"],"ecma":["94.4"],"262历史":["94.4"],"ecmascript":["94.4"],"历史版本查看网址":["94.4"],"http":["94.4"],"www":["94.4"],"international":["94.4"],"谁在维护ecma":["94.5"],"let关键字用来声明变量":["95.1"],"let关键字使用示例":["95.2"],"代码实现":["95.3","95.4","95.8"],"局部变量":["95.4"],"就是在变量创建之前使用":["95.6"],"比如输出":["95.6"],"输出的是默认值":["95.6"],"let不存在":["95.6"],"点击div更改颜色":["95.8"],"doctype":["95.8","100.4","103.1"],"lang":["95.8"],"en":["95.8"],"const关键字用来声明":["96.1"],"常量":["96.1"],"const声明有以下特点":["96.1"],"es6允许按照一定模式":["97.1"],"从数组和对象中提取值":["97.1"],"模板字符串":["98.1"],"template":["98.1"],"string":["98.1"],"和endswith":["98.3"],"表示参数字符串是否在原字符串的头部":["98.3"],"repeat方法表示将原字符串重复n次":["98.4"],"返回一个新字符串":["98.4"],"数据结构":["98.5"],"es6提供了新的数据结构set":["98.5"],"它类似于数组":["98.5"],"但是成员的值都是唯一的":["98.5"],"没有重复的值":["98.5"],"set本身是一个构造函数":["98.5"],"用来生成set数据结构":["98.5"],"需要实例化":["98.5"],"数组去重":["98.5"],"const":["98.5","109.3"],"es6允许在大括号里面":["99.1"],"直接写入变量和函数":["99.1"],"es6允许使用箭头":["100.1"],"箭头函数的this是静态的":["100.3"],"始终指向函数声明时所在作用域下的this值":["100.3"],"es6允许给函数的参数赋初始值":["101.1"],"es6引入rest参数":["102.1"],"用于获取函数的实参":["102.1"],"扩展运算符能将数组转换为逗号分隔的参数序列":["103.0"],"from":["103.3","109.9"],"将数组或可遍历对象转换为真正的数组":["103.3"],"用于找出第一个符合条件的数组成员":["103.4"],"如果没有找到返回undefined":["103.4"],"用于找出第一个符合条件的数组成员的位置":["103.5"],"如果没有找到返回":["103.5"],"用来判断一个数组是否包含一个指定的值":["103.6"],"根据情况":["103.6"],"es6引入了一种新的原始数据类型symbol":["104.1"],"symbol的值是唯一的":["104.2"],"用来解决命名冲突问题":["104.2"],"symbol值不能与其他数据进行运算":["104.2"],"symbol定义的对象属性不能使用for":["104.2"],"in循环遍历":["104.2"],"但是可以使用reflect":["104.2"],"除了定义自己使用的symbol值以外":["104.4"],"es6还提供了11个内置的symbol值":["104.4"],"指向语言内部使用的方法":["104.4"],"可以称这些方法为魔术方法":["104.4"],"因为他们会在特定的场景下自动执行":["104.4"],"内置symbol的值":["104.4"],"调用时机":["104.4"],"symbol":["104.4"],"hasinstance":["104.4"],"当其他对象使用":["104.4"],"判断是否为该对象的实例时":["104.4"],"会调用这个方法":["104.4"],"生成器函数是":["105.0"],"提供的一种异步编程解决方案":["105.0"],"语法行为与传统函数完全不同":["105.0"],"遍历器":["106.1"],"iterator":["106.1"],"就是一种机制":["106.1"],"它是一种接口":["106.1"],"回顾":["108.1"],"前端模块化规范的分类":["108.2"],"什么是":["108.3"],"在nodejs中体验es6模块化":["108.4"],"默认导出的语法":["108.6"],"export":["108.6"],"注意事项":["108.8","108.9","108.12"],"按需导出的语法":["108.10"],"按需导入的语法":["108.11"],"import":["108.11","109.9"],"导出的":["108.12"],"如果只想单纯地执行某个模块中的代码":["108.13"],"star":["109.1","109.8","109.9","109.10","109.11","110.2","111.2"],"多层回调函数的相互嵌套":["109.1"],"就形成了回调地狱":["109.1"],"为了解决回调地狱的问题":["109.2"],"promise是一个构造函数":["109.3"],"可以创建promise的实例":["109.3"],"then":["109.5"],"fs":["109.5","109.6"],"读取文件内容":["109.5"],"fs的基本使用":["109.6"],"调用":["109.6"],"提供的":["109.6"],"readfile":["109.6"],"方法的特性":["109.7"],"promise":["109.8","109.9"],"支持链式调用":["109.8"],"从而来解决回调地狱的问题":["109.8"],"示例代码如下":["109.8"],"catch捕获错误":["109.9"],"的链式操作中如果发生了错误":["109.9"],"catch":["109.9"],"方法进行捕获和处理":["109.9"],"thenfs":["109.9"],"all":["109.10"],"方法会发起并行的":["109.10","109.11"],"race":["109.11"],"sparkles":["109.12"],"要求":["109.12"],"方法的名称要定义为":["109.12"],"getfile":["109.12"],"方法接收一个形参":["109.12"],"fpath":["109.12"],"await":["110.0","110.1","110.3"],"async":["110.1"],"await基本使用":["110.2"],"加上await后返回值不再是promise实例":["110.2"],"而是真正的内容":["110.2"],"如果用了await":["110.2"],"则该方法必须被async修饰":["110.2"],"await的注意事项":["110.3"],"如果在":["110.3"],"中使用了":["110.3"],"则":["110.3"],"必须被":["110.3"],"为防止某个":["111.2"],"耗时任务":["111.2"],"20220519011856859":["111.3"],"20220519013043403":["111.5"],"把":["112.1"],"异步任务":["112.1"],"20220519160037761":["112.3"],"正确的输出顺序是":["112.3"],"请分析以下代码输出的顺序":["112.4"],"仓库":["113.1"],"可以把很多东西放到这个仓库里面":["113.1"],"找东西只需要到仓库里面查找到就可以了":["113.1"],"jquery是一个快速":["113.2"],"简洁的javascript库":["113.2"],"其设计的宗旨是":["113.2"],"轻量级":["113.3"],"核心文件才几十kb":["113.3"],"官网地址":["114.0"],"因为原生js比jquery更大":["114.4"],"原生的一些属性和方法jquery没有给我们封装":["114.4"],"选择器":["115.1","124.0"],"名称":["115.2"],"重要":["115.3"],"parents":["115.5"],"parent":["115.5"],"链式编程时为了节省代码量":["115.6"],"参数只写属性名":["116.1"],"返回属性值":["116.1"],"带单位":["116.1"],"注意操作类里面的参数不要加点":["116.2"],"原生js中classname会覆盖元素原先里面的类名":["116.3"],"show":["117.1"],"speed":["117.1"],"easing":["117.1"],"参数都可以省略":["117.1"],"无动画直接显示":["117.1"],"同时实现鼠标移入和移出":["117.2"],"slidedown":["117.3"],"fadein":["117.4"],"animate":["117.5"],"params":["117.5"],"动画或者效果一旦触发就会执行":["117.7"],"stop":["117.8"],"不能获取自定义属性":["118.1"],"attr":["118.2"],"data":["118.3"],"主要针对元素的内容还有表单的值操作":["119.0"],"相当于原生innerhtml":["119.1"],"相当于原生innertext":["119.2"],"相当于原生value":["119.3"],"jquery隐式迭代是对同一类元素做了同样的操作":["120.1"],"如果想要给同一类元素做不同操作":["120.1"],"就需要用到遍历":["120.1"],"语法1":["120.1"],"each":["120.1"],"domele":["120.1"],"内部添加":["120.3"],"同一个元素只能添加一次":["120.3"],"后面的添加会覆盖前面添加":["120.3"],"位置操作":["121.0"],"位置主要有三个":["121.2"],"offset":["121.2"],"scrolltop":["121.2"],"scrollleft":["121.2"],"on":["122.4","122.5","122.9"],"off":["122.6"],"自动触发":["122.8"],"如果想要把某个对象拷贝":["123.1"],"合并":["123.1"],"给另外一个对象使用":["123.1"],"此时可以使用":["123.1"],"jquery使用":["123.2"],"作为标识符":["123.2"],"jquery插件库":["123.3"],"图片使用延迟加载可提高网页下载速度":["123.4"],"alvarotrigo":["123.5"],"fullpage":["123.5"],"选择器允许对":["124.0"],"span":["124.2"],"选取":["124.2"],"里的所有":["124.2"],"元素":["124.2","124.3"],"选取所有":["124.3","124.9"],"元素中第1个":["124.3"],"contains":["124.4"],"选取所有拥有属性id的元素":["124.6"],"选取所有的name属性等于":["124.6"],"one":["124.7"],"nth":["124.7"],"form1":["124.8"]},{"0":["34.0","35.2","54.8","55.3","60.10","91.6","93.16"],"1":["25.0","25.10","26.2","27.14","32.12","32.19","38.1","42.2","43.3","56.10","56.12","57.5","57.6","61.7","65.4","65.9","67.4","68.3","69.5","77.1","77.2","77.3","77.4","77.6","81.2","81.5","89.8","93.5","95.1","95.3","98.5","103.5","106.1","108.12","111.3","112.3","114.4","118.1","120.1"],"2":["7.0","25.10","29.1","29.2","44.3","51.2","55.12","56.12","62.14","65.7","68.3","75.2","78.13","81.5","86.6","88.1","89.1","89.2","90.7","90.8","91.3","92.0","93.3","93.14","95.4","96.1","100.3","110.3","116.1","120.1","124.7"],"3":["26.10","29.1","62.14","68.3","78.13","90.7","92.0","92.2","93.3","93.15","93.17","95.6","98.5","100.3","109.12"],"4":["21.1","61.2","62.14","64.4","93.17","98.5","109.12"],"5":["21.1","61.2","93.17"],"6":["6.4","66.1","92.0"],"7":["30.4","69.9"],"8":["6.4","43.4","95.8"],"9":["54.8","66.2","93.16"],"10":["32.4"],"11":["66.3","109.9"],"13":["91.6"],"17":["56.3"],"18":["92.3"],"21":["55.3","92.0"],"22":["64.4"],"50":["27.9"],"123":["78.19"],"180":["65.9"],"262":["94.3","94.5"],"888":["87.3"],"2017":["110.1"],"2431":["112.3"],"11111":["62.14"],"37447":["55.4"],"html5的新增特性主要是针对于以前的不足":["1.0"],"nav":["2.0","17.5","91.5"],"导航标签":["2.0"],"article":["2.0"],"audio":["3.0","3.2"],"css":["3.1","5.6","9.0","23.1","23.3","23.4","23.5","26.8","28.1","31.4","32.3","32.10","32.11","35.1","38.2","116.1"],"src":["3.1","3.2"],"文件地址":["3.1","3.2"],"controls":["3.1","3.2"],"浏览器支持情况不同":["3.3"],"email":["4.0"],"限制用户输入必须为email类型":["4.0"],"url":["4.0","84.0"],"表单拥有该属性表示其内容不能为空":["4.1"],"必填":["4.1"],"placeholder":["4.1"],"e":["5.1","5.4","5.5","78.16","78.17","78.21","78.25"],"att":["5.1"],"选择具有att":["5.1"],"属性的e元素":["5.1"],"匹配父元素中的第一个子元素e":["5.2"],"last":["5.2","124.3"],"匹配父元素中最后一个e元素":["5.2"],"nth":["5.2"],"在元素内部的前面插入内容":["5.3"],"after":["5.3","26.8"],"在元素内部的后面插入内容":["5.3"],"注意":["5.3","43.4","68.7"],"和after创建一个元素":["5.3"],"enabled":["5.4","124.8"],"表单元素可用状态":["5.4"],"disabled":["5.4"],"engine":["6.1"],"optimization":["6.1"],"具有不可替代性":["6.2"],"是我们内页的第一个重要标签":["6.2"],"是搜索引擎了解网页的入口和对网页主题归属的最佳判断点":["6.2"],"作为网站的总体业务和主题概括":["6.3"],"多采用":["6.3"],"我们是":["6.3"],"最好限制为":["6.4"],"个关键词":["6.4"],"目的是为了提权":["7.0"],"告诉搜索引攀":["7.0"],"这个地方很重要":["7.0"],"给图像设置高斯模糊":["8.1"],"值是0":["8.2"],"值定义转换的比例":["8.3","8.6"],"值为100":["8.3","8.6"],"deg":["8.4"],"给图像应用色相旋转":["8.4"],"在css3背景中定义":["8.5"],"类型的值":["8.5"],"除了":["8.5"],"inset":["8.5"],"关键字是不允许的":["8.5"],"该函数与已有的box":["8.5"],"box":["8.5","25.15"],"shadow属性很相似":["8.5"],"不同之处在于":["8.5"],"通过滤镜":["8.5"],"一些浏览器为了更好的性能会提供硬件加速":["8.5"],"动画或javascript的情况下":["10.0"],"当元素从一种样式变换为另":["10.0"],"种样式时为元素添加效果":["10.0"],"过渡动画":["10.0"],"是从一个状态渐渐的过渡到另外个状态":["10.0"],"可以让我们页面更好看":["10.0"],"transform":["11.0","11.2","11.3","14.3","14.5"],"是css3中具有颠爱性的特征之一":["11.0"],"位移":["11.1"],"x":["11.2","11.5","11.7","14.1","85.11","85.12"],"origin":["11.4"],"同时使用多个转换":["11.6"],"其格式为":["11.6"],"分别是位移旋转和缩放":["11.7"],"2d":["11.7"],"移动translate":["11.7"],"animation":["12.0"],"是动画的完成":["12.1"],"这样的规则就是动画序列":["12.1"],"在":["12.1","110.3"],"keyframes中规定某项css样式":["12.1"],"就能创建由当前样式逐渐改为新样式的动画效果":["12.1"],"除了animation":["12.2"],"play":["12.2"],"state属性":["12.2"],"name":["12.2","50.1","61.6","86.10","92.3","95.8","124.4"],"规定":["12.2"],"keyframes动画的名称":["12.2"],"运动曲线":["12.3"],"何时开始":["12.3"],"播放次数":["12.3"],"是否反方向":["12.3"],"值":["12.4","33.3","55.8"],"描述":["12.4","56.2","115.2"],"linear":["12.4"],"使用background":["13.0"],"使用transform属性实现元素在空间内的位移":["14.0"],"旋转":["14.0"],"translate3d":["14.1"],"使用perspective属性实现透视效果":["14.2"],"语法":["14.3","14.5","23.1","23.2","23.5","25.3","26.1","52.1"],"rotatez":["14.3"],"style":["14.4","15.1","75.2"],"preserve":["14.4"],"3d呈现立体图形":["14.4"],"cascading":["15.1"],"选择器":["15.2","16.1"],"属性":["15.2","25.9","33.3","41.0","75.8","118.2"],"20230414163954048":["15.3"],"的":["16.2","124.6","124.7"],"基础选择器又包括":["16.2"],"标签选择器":["16.2"],"类选择器":["16.2"],"id选择器":["16.2"],"和通配符选择器":["16.2"],"选择器整体分为5大类":["16.2"],"基本选择器":["16.2"],"class选择器10":["16.3"],"20230414174832335":["16.5"],"20230414174843237":["16.6"],"20230414174851085":["16.7"],"20230414174915002":["16.8"],"20230414174937886":["16.9"],"标志":["17.1"],"logo":["17.1"],"页面主体":["17.1"],"main":["17.1"],"广告":["17.1"],"banner":["17.1"],"热点":["17.1"],"hot":["17.1"],"新闻":["17.1"],"footer":["17.2"],"container":["17.4"],"页头":["17.4"],"header":["17.4"],"主导航":["17.5"],"mainbav":["17.5"],"login":["17.6"],"登录条":["17.6"],"loginbar":["17.6"],"注册":["17.6"],"regsiter":["17.6"],"搜索":["17.6"],"search":["17.6"],"class命名":["17.7"],"颜色":["17.8"],"使用颜色的名称或者16进制代码":["17.8"],"直接使用":["17.9"],"font":["17.9","29.2"],"对齐样式":["17.10"],"使用对齐目标的英文名称":["17.10"],"使用类别":["17.11"],"功能的方式命名":["17.11"],"模块":["17.12"],"module":["17.12"],"基本共用":["17.12"],"打开表格菜单":["18.0"],"打开窗口菜单":["18.0"],"h":["18.0","25.13","25.14"],"打开帮助菜单":["18.0"],"查看文件属性":["18.0"],"双击文件":["18.0"],"关闭c语言":["18.0"],"shift快捷键":["18.0"],"半":["18.0"],"全角切换":["18.0"],"delete":["18.0"],"永久删除所选项":["18.0"],"而不将它放到":["18.0"],"回收站":["18.0"],"中":["18.0","62.13","76.1"],"拖动某一项时按":["18.0"],"复制所选项":["18.0"],"创建所选项目的快捷键":["18.0"],"word全套快捷键小技巧":["18.0"],"p":["18.0","21.1","109.3"],"打印":["18.0"],"对文字进行大小设置":["18.0"],"在选中目标情况下":["18.0"],"d":["18.0"],"字体设置":["18.0"],"g":["18.0"],"替换":["18.0"],"全文删除":["18.0"],"左边距":["18.0"],"绘制下划线":["18.0"],"加粗文字":["18.0"],"倾斜文字":["18.0"],"q":["18.0"],"两边对齐":["18.0"],"无首行缩进":["18.0"],"或将光标放置目标文":["18.0"],"字的段尾":["18.0"],"亦可操作":["18.0"],"j":["18.0"],"两端对齐":["18.0"],"操作同上":["18.0"],"居中":["18.0"],"右对齐":["18.0"],"k":["18.0"],"插入超链接":["18.0"],"y":["18.0","85.11","85.12"],"可进行首行缩进":["18.0"],"将光标移到需做此操作的段尾":["18.0"],"或将此段选中进行操作":["18.0"],"或ctrl":["18.0"],"小键盘上数字5":["18.0"],"选中全文":["18.0"],"给选中的文字加粗":["18.0"],"再按一次":["18.0"],"取消加粗":["18.0"],"将选中的文字复制到剪贴板中":["18.0"],"字体":["18.0"],"对话框":["18.0"],"快速完成字体的各种设置":["18.0"],"使光标所在行的文本居中":["18.0"],"size":["19.0"],"字体大小":["19.0"],"weight":["19.0"],"字体粗细":["19.0"],"red":["20.0","39.4","69.8"],"green":["20.0"],"blue":["20.0"],"pink":["20.0"],"ffoooo":["20.0"],"ff6600":["20.0"],"如果有父了级关系的标签":["21.1"],"可以用":["21.1"],"比如ul":["21.1"],"li就可以了":["21.1"],"如果有兄弟关系的标签":["21.1"],"用":["21.1"],"如果生成带有类名或者id名字的":["21.1"],"直接写":["21.1"],"demo或者":["21.1"],"alt":["21.2"],"f":["21.2"],"在不同地方会用到不同类型的标签":["22.1"],"了解他们的特点":["22.1"],"可以更好的布局我们的页面":["22.1"],"div":["22.2","47.0","78.14","116.2","124.5"],"u":["22.2"],"ol":["22.2"],"li":["22.2","35.1","115.4"],"等":["22.2"],"em":["22.3"],"i":["22.3","60.10"],"del":["22.3"],"s":["22.3","67.5"],"我们需要元素模式的转换":["22.4"],"简单理解一个模式的元素需要另外一种模式的特性比如想要增加链接":["22.4"],"image":["23.2","32.4","33.0","33.1","78.12","81.5","86.9","86.10","91.6"],"length":["23.4","60.8","60.10","69.6","69.9"],"20230414180416235":["23.6"],"20230414180424964":["23.7"],"20230414180438812":["23.8"],"此时一个样式就会覆盖":["24.1"],"层曼":["24.1"],"子标签会继承父标签的某些样式":["24.2"],"如文本颜色和字号":["24.2"],"20230414181133732":["24.3"],"行高可以跟单位也可以不跟单位":["24.3"],"权重是有4组数字组成但是不会有进位":["24.4"],"可以理解为类选择器永远大于元素选择器":["24.4"],"id选择器永远大于类选择器":["24.4"],"20230414184106921":["25.1"],"width":["25.4","25.10","34.0","95.8","116.1"],"参数":["25.4"],"none":["25.5"],"无边框":["25.5"],"与任何指定的border":["25.5"],"width值无关":["25.5"],"hidden":["25.5","28.3","38.2","124.5"],"color":["25.6","39.4"],"20230414184517907":["25.7"],"控制浏览器绘制表格边框的方式":["25.8"],"它控制相邻单元格的边框":["25.8"],"作用":["25.9","31.8"],"padding":["25.9"],"left":["25.9","39.1"],"左内边距":["25.9"],"但是必须满足两个条件":["25.10"],"盒子必须指定了宽度":["25.10"],"兄弟关系":["25.11"],"相遇时":["25.11"],"如果上面的元素有下外边距margin":["25.11"],"bottom":["25.11"],"下面的元素有上外边距margin":["25.11"],"radius":["25.12"],"v":["25.13"],"有2个值":["25.15"],"即可指定为content":["25.15"],"border":["25.15","39.1","39.4"],"按照规定好的默认方式排列":["26.0"],"块级元素会独占一行":["26.0"],"从上向下顺序排列":["26.0"],"直到左边缘或右边缘触及包含块或另一个浮动框的边缘":["26.1"],"浮动元素会脱离标准流":["26.2"],"脱标":["26.2"],"浮动和标准流的父盒子搭配":["26.3"],"先用标准流的父元素排列上下位置":["26.3"],"则不需要清除浮动":["26.4"],"清除浮动之后":["26.4"],"父级就会根据浮动的子盒子自动检测高度":["26.4"],"父级有了高度":["26.4"],"额外标签法也称为隔墙法":["26.5"],"额外标签法会在浮动元素末尾添加一个空的标签":["26.6"],"html":["26.6","50.2","76.1","100.4","101.1","119.1","124.0"],"将其属性值设置为hidden":["26.7"],"clearfix":["26.8","26.9"],"before":["26.9"],"子盒子浮动了":["26.10"],"影响下面布局了":["26.10"],"我们就应该清除浮动了":["26.10"],"并且压住屏幕某个位置":["27.0"],"它通过css的position属性来设置":["27.2"],"其值可以分为四个":["27.2"],"top":["27.3"],"80px":["27.3"],"默认定位方式":["27.5"],"原来的位置":["27.6"],"来说的":["27.6","27.7"],"祖先元素":["27.7"],"主要使用场景":["27.8"],"可以在浏览器页面滚动时元素的位置不会改变":["27.8"],"让固定定位的盒子left":["27.9"],"sticky粘性的":["27.10"],"粘性定位的特点":["27.10"],"20230414190952891":["27.11"],"可能会出现盒子重叠的情况":["27.12"],"此时":["27.12","29.1"],"可以使用z":["27.12"],"绝对定位":["27.15"],"会完全压住盒子":["27.16"],"当我们点击关闭就不见了":["28.0"],"后面应用及其广泛":["28.1"],"搭配js可以做很多的网页特效":["28.1"],"css1":["28.1"],"块对象的默认值":["28.1"],"用该值为对象之后添加新行":["28.1"],"与visibility属性的hidden值不同":["28.1"],"visibility":["28.2"],"inherit":["28.2"],"visible":["28.2","28.3"],"auto":["28.3"],"图片文件还是比较大的":["29.1"],"图片本身放大和缩小会失真":["29.1"],"一旦图片制作完毕想要更换非常复杂":["29.1"],"safari3":["29.2"],"opera10":["29.2"],"ios":["29.2"],"mobile":["29.2"],"safari4":["29.2"],"web":["29.2","43.1"],"open":["29.2","71.1"],"format":["29.2"],"wof":["29.2"],"格式woff字体":["29.2"],"20230414192416711":["29.3"],"一般用英寸来度量":["30.1"],"分辨率分类":["30.1"],"物理分辨率":["30.1"],"解决办法":["30.2"],"添加视口标签":["30.2"],"显示html网页的区域":["30.2"],"用来约束html尺寸":["30.2"],"手机屏幕尺寸都不同":["30.2"],"图片分辨率":["30.3"],"多个盒子横向排列使用什么属性":["31.1"],"布局网页更简单":["31.2"],"flex布局非常适合结构化布局":["31.3"],"设置方式":["31.3"],"父元素添加":["31.3"],"content调节元素在主轴的对齐方式":["31.4"],"修改侧轴对齐方式属性":["31.5"],"添加到弹性容器":["31.5"],"使用flex属性修改弹性盒子伸缩比":["31.6"],"主轴默认是水平方向":["31.7"],"侧轴默认是垂直方向":["31.7"],"修改主轴方向属性":["31.7"],"nowrap":["31.8"],"默认值":["31.8"],"规定灵活的项目不拆行或不拆列":["31.8"],"目前多数企业在用的解决方案":["32.0"],"屏幕宽度不同":["32.2"],"网页元素尺寸不同":["32.2"],"等比缩放":["32.2"],"检测视口的宽度":["32.3"],"然后编写":["32.3"],"差异化的":["32.3"],"20220409154225181":["32.4"],"rem单位尺寸":["32.4"],"print":["32.5"],"手机或小屏手持设备":["32.5"],"screen":["32.5"],"and":["32.5"],"min":["32.5","33.0","66.1"],"js配合rem实现在不同宽度的设备中":["32.6"],"less文件后缀为":["32.7"],"思考":["32.8"],"在vscode里面找到easy":["32.9"],"注释内容":["32.10"],"4px":["32.11"],"除法需要添加小括号或者":["32.11"],"快速生成后代选择器":["32.12"],"设置属性值为这个容器名":["32.13"],"import":["32.14","108.7","109.8","110.2"],"实现所有less有相同的导出路径":["32.15"],"配置插件":["32.15"],"设置":["32.15","60.6"],"out":["32.16"],"实现在不同宽度的设备中":["32.17"],"相对视口的尺寸计算结果":["32.18"],"20220410192304279":["33.0"],"如屏幕设备":["33.2"],"打印设备等":["33.2"],"其中手机":["33.2"],"横屏或竖屏等":["33.3"],"特性名称":["33.3"],"20220410194952713":["33.4"],"height":["34.0","39.4","121.1"],"所谓的界面样式":["35.0"],"给表单添加outline":["35.2"],"防止拖拽":["35.3"],"图片底侧会有一个白缝隙":["36.0"],"原因是行内块元素会和文字的基线对齐":["36.0"],"经常用于设置图片或者表单":["37.0"],"行内块元素":["37.0"],"和文字垂直对齐":["37.0"],"官方解释":["37.0"],"先强制":["38.1"],"如下设置":["38.2"],"overflow":["38.2"],"float":["39.1"],"1px":["39.1"],"20230414193402887":["39.2"],"align会使行内元素和行内块元素全部水平居中":["39.3"],"transparent":["39.4"],"我们需要对css初始化":["40.0"],"简单理解":["40.0","87.5"],"css初始化是指重设浏览器的样式":["40.0"],"方法":["41.0","87.3","123.1"],"fill":["41.0"],"服务器就会频繁地接收和发送请求图片":["42.1"],"造成服务器请求压力过大":["42.1"],"这将大大降低页面的加载速度":["42.1"],"使用精灵图核心":["42.2"],"精灵技术主要针对于背景图片使用":["42.2"],"交互":["43.1"],"ecma制定了行为标准":["43.1"],"dom":["43.1","76.1","76.17"],"ecmascript":["43.1","110.1"],"w3c":["43.1"],"world":["43.1"],"wide":["43.1"],"consortium":["43.1"],"万维网联盟":["43.1"],"创建于1994年是web技术领域最具权威和影响力的国际中立性技术标准机构":["43.1"],"20230413193140630":["43.2"],"这是文档类型声明标签":["43.2"],"它是由doc和type两个单词组成的":["43.2"],"语言的种类":["43.3"],"en定义语言为英语":["43.3"],"charset常用的值有":["43.4"],"gb2312":["43.4"],"big5":["43.4"],"gbk和utf":["43.4"],"其中":["43.4"],"8也被称为万国码":["43.4"],"基本包含了全世界所有国家需要用到的字符":["43.4"],"上面语法是必须要写的代码":["43.4"],"否则可能引起乱码的情况":["43.4"],"一般情况下":["43.4","57.9"],"统一使用":["43.4"],"标记名":["44.1"],"文字内容":["44.1"],"h3":["44.2"],"小模块的标题":["44.2"],"h4":["44.2"],"标题h4":["44.2"],"h5":["44.2"],"自动换行可以嵌套不换行的标签":["44.3"],"空格":["44.4"],"img":["45.0"],"href":["46.0","78.19"],"网址":["46.0"],"target":["46.0","92.2"],"tr":["48.0"],"行":["48.0"],"th":["48.0"],"标题列":["48.0"],"td":["48.0"],"内容列":["48.0"],"20230413200419522":["49.0"],"form属性":["50.1"],"提交的地址":["50.1"],"数据提交的方式":["50.1"],"提交":["50.1"],"form":["50.2","50.4"],"sex":["50.3"],"男":["50.3"],"type":["50.3","53.1","78.8","78.13"],"radio":["50.3"],"action":["50.4"],"legend":["50.4"],"用户登录":["50.4"],"for":["50.4","58.6","58.11","104.2"],"username":["50.4"],"用户名":["50.4"],"轰动一时":["51.1"],"但是这是一款名副其实的浏览器":["51.1"],"只能浏览页面":["51.1"],"浏览器无法与用户互动":["51.1"],"当时解决这个问题有两个办法":["51.1"],"一个是采用现有的语言":["51.1"],"许它们直接嵌入网页":["51.1"],"利用js配合canvas实现游戏":["51.2"],"cocos2d":["51.2"],"js":["51.2","79.2","108.4","109.5"],"核心":["52.0"],"反射":["52.2"],"代理等":["52.2"],"es7":["52.2"],"array":["52.2","60.3","61.0","68.1","104.4"],"prototype":["52.2","87.3","104.4"],"includes和指数操作符":["52.2"],"es8":["52.2","110.1"],"异步函数":["52.2"],"document":["52.3","73.5","73.6","76.0","76.15","78.14","114.1"],"object":["52.3","61.2","65.9","72.1","92.2"],"model":["52.3","72.1"],"是一个应用编程接口":["52.3"],"api":["52.3"],"提供与浏览器交互的方法和接口":["52.4"],"行内式":["53.1"],"input":["53.1","124.3"],"单行注释":["53.2"],"javascript":["53.2","55.7","57.4","57.5","57.7","58.4","58.7","58.10","58.11","60.7","61.3","61.6","61.7","62.3","62.15","63.7","65.3","65.5","67.2","68.2","68.3","68.4","68.7","69.3","69.4","69.5","73.1","75.7","76.7","76.8","76.13","78.4","78.9","78.14","80.1","80.3","80.5","82.1","86.10","86.15","87.1","91.4","93.8","93.10","95.4","95.6","98.4","99.1","102.1","103.3","103.4","103.5","104.2","108.2","109.1","109.8","110.2","111.3","117.2","122.5"],"归属":["53.3"],"alert":["53.3","55.11"],"msg":["53.3","92.3"],"容器":["54.2"],"赋值":["54.3","64.4"],"它原有的值就会被覆盖":["54.5"],"只需要写一个":["54.6"],"var":["54.7","60.7","63.7","65.3","65.5","66.3","67.1","67.2","68.3","68.7","69.4","69.5","69.7","69.9","88.1","91.6","92.0","103.3"],"age":["54.7","87.2","92.3"],"console":["54.7","67.2","67.4","69.1","69.4","69.5","69.7","69.9","85.9","85.10","85.12","87.1","87.3","92.0","109.9"],"下划线":["54.8"],"美元符号":["54.8"],"组成":["54.8"],"如":["54.8"],"内存中":["55.1"],"javascript是一种弱类型或者说动态语言":["55.1"],"这意味着不用提前声明变量的类型":["55.1"],"在程序运行过程中":["55.1"],"数字型":["55.3"],"包含整型值和浮点型值":["55.3"],"如21":["55.3"],"小数":["55.4"],"数字型进制":["55.4"],"二进制":["55.4"],"八进制":["55.4"],"十进制":["55.4"],"十六进制":["55.4"],"strmsg":["55.5"],"我爱北京天安门":["55.5"],"使用双引号表示字符串":["55.5"],"strmsg2":["55.5"],"我爱吃猪蹄":["55.5"],"使用单引号表示字符串":["55.5"],"布尔类型有两个值":["55.6"],"true":["55.6","56.8","103.6"],"和":["55.6","56.5","78.13","93.8","124.9"],"如果进行相连或者相加时":["55.7"],"注意结果":["55.7"],"里面存的值为空":["55.8"],"学习对象时":["55.8"],"可用来获取检测变量的数据类型":["55.10"],"num":["55.11","63.7"],"string":["55.11","70.3"],"强制转换":["55.11"],"加号拼接字符串":["55.11"],"标识符不能是关键字或保留字":["55.12"],"是指":["55.12"],"js本身已经使用了的字":["55.12"],"不能再用它们充当变量名":["55.12"],"方法名":["55.12"],"包括":["55.12","81.5"],"break":["55.12","57.8"],"case":["55.12","57.8"],"catch":["55.12"],"operator":["56.1"],"运算符":["56.2"],"实例":["56.2"],"加":["56.2"],"是由数字":["56.4"],"递减":["56.5"],"运算符来完成":["56.5"],"前置递增":["56.6"],"就是自加1":["56.6","56.7"],"后置递增":["56.7"],"会返回一个布尔值":["56.8"],"false":["56.8"],"作为比较运算的结果":["56.8"],"运算符名称":["56.8"],"其返回值也是布尔值":["56.9"],"后面开发中经常用于多个条件的判断":["56.9"],"时":["56.10","86.13","104.4"],"左边的表达式值可以确定结果时":["56.10"],"就不再继续运算右边的表达式的值":["56.10"],"用来把数据赋值给变量的运算符":["56.11"],"小括号":["56.12","93.15"],"各条代码的执行顺序对程序的结果是有直接影响的":["57.1"],"很多时候我们要通过控制代码":["57.1"],"最基本的流程控制":["57.2"],"根据不同的条件":["57.3"],"语法结构":["57.4","57.5","57.6"],"多分支语句":["57.6"],"表达式1":["57.7"],"表达式2":["57.7"],"表达式3":["57.7"],"value1":["57.8","66.1"],"等于":["57.8"],"时要执行的代码":["57.8"],"value2":["57.8","66.1"],"它们两个语句可以相互替换":["57.9"],"②":["57.9"],"switch":["57.9","93.19"],"有许多具有":["58.2"],"主要有三种类型的循环语句":["58.3"],"循环主要用于把某些代码循环若干次":["58.4"],"通常跟计数有关系":["58.4"],"其语法结构如下":["58.4"],"在程序的某一行设置断点":["58.5"],"watch":["58.5"],"监视":["58.5"],"通过watch可以监视变量的值的变化":["58.5"],"非常的常用":["58.5"],"f11":["58.5"],"程序单步执行":["58.5"],"让程序一行一行的执行":["58.5"],"这个时候":["58.5"],"观察watch中变量的值的变化":["58.5"],"代码调试的能力非常重要":["58.5"],"只有学会了代码调试":["58.5"],"才能学会自己解决bug的能力":["58.5"],"初学者不要觉得调试代码麻烦就不去调试":["58.5"],"知识点花点功夫肯定学的会":["58.5"],"循环":["58.6"],"这样的":["58.6"],"直到表达式不为真时结束循环":["58.7"],"while语句的语法结构如下":["58.7"],"语句其实是":["58.8"],"语句的一个变体":["58.8"],"该循环会先执行一次代码块":["58.8"],"之后的代码就会少执行一次":["58.10"],"求1":["58.10"],"循环结束":["58.11"],"函数的命名必须要有意义":["59.1"],"20230415011826626":["59.4"],"其中的每个数据被称作元素":["60.1"],"arr":["60.3","62.14","66.1","66.3","68.3","68.7","98.5"],"new":["60.3","65.5","67.2","67.4","68.1","98.5","109.3"],"数组可以通过索引来访问":["60.6"],"修改对应的数组元素":["60.6"],"我们可以通过":["60.6","87.0"],"arr2":["60.7","61.7"],"修改length长度":["60.9"],"m":["60.10","67.5"],"javascript的":["61.1"],"不能使用字符串":["61.2"],"不考虑关联数组":["61.2"],"数组对象的属性和数组元素列表是分开储存的":["61.2"],"并且数组的遍历和修改操作也不能作用于这些命名属性":["61.2"],"即只能对元素进行操作":["61.2"],"扩展":["61.2"],"通过最简单的方式创建一个新数组":["61.3"],"数组字面量创建":["61.4"],"例子表明":["61.6"],"在item1的原型链上有item构造函数":["61.6"],"而item构造函数的原型链有object":["61.6"],"所以item1上有object的属性":["61.6"],"即可以判断item1为对象":["61.6"],"class":["61.6","85.8","91.5","115.5"],"item":["61.6"],"constructor":["61.6","85.6","85.8","85.11"],"该方法不仅可以判断一个变量的类型":["61.7"],"还可以判断其内部的值是否为数组":["61.7"],"const":["61.7","98.4","103.4","103.5"],"newarr":["61.7"],"就是封装了一段可被重复调用执行的代码块":["62.1"],"声明函数和调用函数":["62.2"],"声明函数":["62.3","62.4","62.8"],"100的累加和":["62.4"],"function":["62.4","62.8","62.15","67.5","78.6","81.2","86.10","87.1","87.2","91.6","92.3","122.2"],"getsum":["62.4","62.8"],"函数的封装":["62.5"],"可以在函数名称后面的小括号中添加一些参数":["62.7"],"这些参数被称为":["62.7"],"形参":["62.7"],"而在":["62.7"],"调用该函数时":["62.7"],"同样也需要传递相应的参数":["62.7"],"num1":["62.8","62.11"],"输出正确结果":["62.9"],"实参个数多于形参个数":["62.9"],"只取到形参的个数":["62.9"],"实参个数小于形参个数":["62.9"],"多的形参定义为undefined":["62.9"],"语句会把自身后面的值返回给调用者":["62.11"],"return后面的代码不会被执行":["62.11"],"add":["62.11"],"num2":["62.11"],"函数体":["62.11"],"return的区别":["62.12"],"实际上":["62.13"],"它是当前函数的一个内置对象":["62.13"],"所有函数都内置了一个":["62.13"],"翻转任意数组":["62.14"],"reversearr":["62.14"],"fn":["62.15","78.6","78.11","89.7","117.5"],"一段代码程序中所用到的名字并不总是有效和可用的":["63.1"],"全局作用域":["63.2"],"局部作用域":["63.3"],"在全局作用域下的变量":["63.5"],"如果在函数内部没有声明直接赋值的变量也属于全局变量":["63.5"],"局部变量":["63.6","63.7"],"当我们程序执行完毕就会销毁":["63.7"],"会比较节约内存资源":["63.7"],"js现阶段没有块级作用域":["63.8"],"就有一个作用域":["63.9"],"javascript解释器在运行javascript代码的时候分为两步":["64.1"],"和函数预解析":["64.2"],"把所有的变量声明提升到当前的作用域最前面":["64.3"],"fun":["64.4","89.5","89.6"],"结果报错":["64.4"],"未定义函数":["64.4"],"调用函数":["64.4","80.5"],"依次罗列":["64.4"],"案例一":["64.4"],"所有的事物都是对象":["65.1"],"例如字符串":["65.1"],"数值":["65.1"],"数组":["65.1"],"obj":["65.3","65.5","88.3"],"空对象":["65.3"],"都是用来存储数据":["65.4"],"区别":["65.4","76.19"],"运算符一起使用":["65.6"],"我们可以把对象中一些公共的属性和方法抽取出来":["65.6"],"然后封装到这个函数里面":["65.6"],"构造函数用于创建某一类对象":["65.6"],"其":["65.6"],"首字母要大写":["65.6"],"构造函数要":["65.6"],"和new一起使用":["65.6"],"才有意义":["65.6"],"在内存中创建一个新的空对象":["65.7"],"变量":["65.8"],"对象名字":["65.8"],"在此执行代码":["65.8"],"abc":["65.9","93.7","93.10"],"会显示undefined":["65.9"],"字面量":["65.9"],"不是一个构造函数":["66.0"],"如4":["66.1"],"输出为5":["66.1"],"floor":["66.1","66.3"],"返回小于或等于一个给定数字的最大整数":["66.1"],"小于0向下取整":["66.1"],"输出值永远小于目标值":["66.1"],"max":["66.1"],"返回一组数中的最大值":["66.1"],"返回零个或更多个数值的最小值":["66.1"],"向上取整":["66.2"],"随机点名":["66.3"],"张三":["66.3"],"张三丰":["66.3"],"李四":["66.3"],"李思思":["66.3"],"返回当前系统时间":["67.1"],"value":["67.1"],"datestring":["67.1"],"gethours":["67.2"],"获取当前小时":["67.2"],"getminutes":["67.2"],"获取当前分钟":["67.2"],"getsecond":["67.2"],"获取当前秒钟":["67.2"],"date":["67.2"],"log":["67.2","69.1","69.4","69.5","69.7","69.9","81.2","85.9","85.10","85.12","87.1","87.3","92.0","109.9"],"对象是基于1970年1月1日":["67.3"],"valueof":["67.4"],"计算小时":["67.5"],"计算分数":["67.5"],"计算当前秒数":["67.5"],"对象的方式":["68.2"],"h5新增":["68.2"],"ie9以上才支持":["68.2"],"isarray":["68.2"],"shift":["68.3"],"删除数组的第一个元素":["68.3"],"数组长度减1":["68.3"],"无参数":["68.3"],"返回第一个元素的值":["68.3"],"push在数组末尾添加元素":["68.3"],"返回长度":["68.3"],"会改变原来的数组":["68.4"],"返回新数组":["68.4"],"sort":["68.4"],"对数组的元素进行排序":["68.4"],"魏明杨":["68.5"],"党婷":["68.5"],"熊飞":["68.5"],"郑翠翠":["68.5"],"李航卫":["68.5"],"屈涛":["68.5"],"汪孝双":["68.5"],"代攀飞":["68.5"],"武志钰":["68.5"],"王亚龙":["68.5"],"周芙榕":["68.5"],"李涛":["68.5"],"郝颖":["68.5"],"文冲洋":["68.5"],"王旭拯":["68.5"],"胡佳豪":["68.5"],"寇晓丽":["68.5"],"马晓晗":["68.5"],"王思聪":["68.5"],"张绿":["68.5"],"李德":["68.5"],"郑萍":["68.5"],"张凯":["68.5"],"张嘉成":["68.5"],"葛云侠":["68.5"],"杨磊":["68.5"],"任变":["68.5"],"说明":["68.6","78.25","93.12"],"返回值":["68.6"],"返回被截取项目的新数组":["68.7"],"不改变原数组":["68.7"],"splice":["68.7"],"数组删除splice":["68.7"],"第几个开始":["68.7"],"要删除个数":["68.7"],"返回被删除项目的新数组":["68.7"],"这个会影响原数组":["68.7"],"连接数组":["68.7"],"c":["68.7"],"a":["68.7","69.7","78.19","95.2"],"andy":["69.1","69.5","92.3"],"javascript还提供了三个特殊的引用类型":["69.2"],"但其实是地址变量":["69.3"],"内存中新开辟了一个内存空间":["69.3"],"lastindexof":["69.4"],"从后往前找":["69.4"],"只找第一个匹配的":["69.4"],"str":["69.4","69.7","69.9","88.2"],"改革春风吹满地":["69.4"],"春":["69.4"],"只返回第一个春的位置":["69.4"],"获取位置处字符":["69.5"],"html5":["69.5","81.3"],"ie8":["69.5"],"支持和charat":["69.5"],"等效":["69.5"],"更常用":["69.6"],"substr":["69.6","93.18"],"star":["69.6","85.6","85.12","86.10"],"从start位置开始":["69.6"],"索引号":["69.6"],"length取的个数":["69.6"],"重点记住":["69.6"],"slice":["69.6"],"start":["69.6","91.6"],"andyandy":["69.7"],"str3":["69.8"],"找出以上字符串中出现次数最多的字符和出现的次数":["69.9"],"遍历字符串":["69.9"],"并将遍历出的字符两头添加符号":["69.9"],"创建字符串":["69.9"],"字符串长度":["69.9"],"charat":["69.9"],"引用类型":["70.1"],"简单数据类型":["70.1","70.3"],"基本数据类型":["70.1"],"由操作自动分配释放存放函数的参数值":["70.2"],"局部变量的值等":["70.2"],"其操作方式类似于数据结构中的栈":["70.2"],"复杂数据类型":["70.4"],"通过new关键字创建的对象":["70.4"],"当我们把一个值类型变量作为参数传给函数的形参时":["70.5"],"当我们把引用类型变量传给形参时":["70.6"],"提供了有关开放网络技术":["71.1"],"查阅该方法的功能":["71.2"],"简称":["72.1"],"文档":["72.2"],"一个页面就是一个文档":["72.2"],"可以获取带有id的元素对象":["73.1"],"知否知否":["73.2"],"应是等你好久22":["73.2"],"getelementsbyclassname":["73.3"],"类名":["73.3"],"②document":["73.3"],"queryselector":["73.3"],"使我们有能力创建动态页面":["74.1"],"而事件是可以被":["74.1"],"事件源":["74.2"],"获取事件源":["74.3"],"onclick":["74.4","78.10","78.13","78.23"],"鼠标点击左键触发":["74.4","78.23"],"结构和样式":["75.0"],"但它去除html标签":["75.1"],"同时空格和换行也会被去掉":["75.1"],"行内样式操作":["75.2"],"20220418221454770":["75.3"],"多个按钮选中一个":["75.4"],"元素本身自带的属性":["75.6"],"element":["75.7","78.6","88.1","120.3","122.4","122.8"],"removeattribute":["75.8"],"保存并保存数据":["75.9"],"data":["75.10","75.11"],"开头作为属性名并赋值":["75.10"],"index":["75.11"],"h5新增的":["75.11"],"利用dom提供的方法获取元素":["76.0"],"getelementbyid":["76.0","77.5"],"节点使用":["76.1"],"node":["76.1","76.11","76.12","108.1","109.5"],"来表示":["76.1"],"常见的是父子兄层级关系":["76.2"],"注意是":["76.3"],"最近的一个父结点":["76.3"],"如果指定的节点没有父结点则返回null":["76.3"],"body":["76.3","85.5"],"节点的优点":["76.3"],"返回包含指定节点的子节点的集合":["76.4"],"该集合为即时更新的集合":["76.4"],"parentnode":["76.5"],"返回最后一个子节点":["76.6"],"找不到则返回null":["76.6","76.14"],"同样":["76.6"],"操作不方便":["76.9"],"而":["76.9"],"firstelementchild":["76.9"],"lastelementchild":["76.9"],"又有兼容性问题":["76.9"],"返回当前元素上一个兄弟元素节点":["76.14"],"有兼容性问题":["76.14"],"ie9才支持":["76.14"],"示例":["76.14"],"createelement":["76.15","76.19"],"child":["76.16","124.7"],"方法将一个节点添加到指定父节点的子节点列表":["76.16"],"方法从":["76.17"],"中删除一个子节点":["76.17"],"返回删除的节点":["76.17"],"留言板案例":["76.17"],"head":["76.17","100.4","103.1"],"clonenode":["76.18"],"是直接将内容写入页面的内容流":["76.19"],"表单的值等":["77.4"],"修改元素属性":["77.4"],"dom提供的api方法":["77.5"],"getelementsbytagname":["77.5"],"能够说出删除事件的两种方式":["78.1"],"传统注册方式":["78.3"],"方法监听注册方式":["78.3"],"利用":["78.3"],"on":["78.3"],"开头的事件":["78.3"],"目标对象":["78.4","88.3"],"上":["78.4"],"当该对象触发指定的事件时":["78.4"],"就会执行事件处理函数":["78.4"],"一般不用":["78.5"],"eventtarget":["78.5","78.9"],"attachevent":["78.5","78.13"],"方法将指定的监听器注册到":["78.5"],"addeventlistener":["78.6","78.13","78.16"],"eventname":["78.6","78.11"],"listener":["78.8"],"usecapture":["78.8"],"detachevent":["78.9"],"null":["78.10"],"判断当前浏览器是否支持":["78.11"],"这个":["78.12"],"传播过程":["78.12"],"即":["78.12"],"只能得到冒泡阶段":["78.13"],"就是事件对象":["78.16"],"我们还喜欢的写成":["78.16"],"或者":["78.16","90.9"],"evt":["78.16"],"click":["78.16","122.7"],"只需要定义形参":["78.17"],"就可以获取到":["78.17"],"srcelement":["78.18"],"非标准":["78.18"],"ie6":["78.18"],"8使用":["78.18"],"最顶层节点":["78.20"],"事件冒泡本身的特性":["78.20"],"会带来的坏处":["78.20"],"也会带来的好处":["78.20"],"if":["78.21"],"jquery":["78.22","114.0"],"里面称为事件委派":["78.22"],"事件委托的原理":["78.22"],"不是每个子节点单独设置事件监听器":["78.22"],"而是事件监听器设置在其父节点上":["78.22"],"主要控制应该何时显示上下文菜单":["78.24"],"主要用于程序员取消默认的上下文菜单":["78.24"],"keyboardevent":["78.25"],"clientx":["78.25"],"某个键盘按键被松开时触发":["78.26"],"onkeydown":["78.26"],"某个键盘按键被按下时触发":["78.26"],"onkeypress":["78.26"],"keycode":["78.27"],"返回该":["78.27"],"键":["78.27"],"20220419231745024":["78.28"],"它提供了独立于内容而与浏览器窗口进行交互的对象":["79.1"],"其核心对象是":["79.1"],"window":["79.1","79.2","80.5"],"由一系列相关的对象构成":["79.1"],"对象是浏览器的顶级对象":["79.2"],"它具有双重角色":["79.2"],"它是":["79.2"],"访问浏览器窗口的一个接口":["79.2"],"它是一个全局对象":["79.2"],"包括图像":["80.1"],"脚本文件":["80.1"],"css文件等":["80.1"],"就调用的处理函数":["80.1"],"等页面内容全部加载完毕":["80.2"],"包括页面dom元素":["80.2"],"当触发时就调用的处理函数":["80.3"],"对象给我们提供了两个定时器":["80.4"],"方法取消了先前通过调用":["80.6"],"settimeout":["80.6","81.2","81.5","109.1"],"建立的定时器":["80.6"],"方法重复调用一个函数":["80.7"],"每隔这个时间":["80.7"],"就去调用一次回调函数":["80.7"],"只有函数执行的时候才能确定this到底指向谁现阶段":["80.8"],"我们先了解一下几个this指向":["80.8"],"也就是说":["81.1"],"同一个时间只能做一件事":["81.1"],"这是因为":["81.1"],"cpu":["81.3"],"的计算能力":["81.3"],"形成一个执行栈":["81.4"],"定时器":["81.5"],"setinterval":["81.5"],"异步任务相关回调函数添加到任务队列中":["81.5"],"20230415022149872":["81.5"],"先执行执行栈中的同步任务":["81.5"],"回调函数":["81.5"],"对象给我们提供了一个":["82.0"],"它包含的信息指出文件的位置以及浏览器应该怎么处理它":["82.1"],"的一般语法格式为":["82.1"],"protocol":["82.1"],"host":["82.1","82.2"],"port":["82.1"],"返回主机":["82.2"],"域名":["82.2"],"www":["82.2"],"assign":["82.3","92.2"],"跟href一样":["82.3"],"可以跳转页面":["82.3"],"也称为重定向页面":["82.3"],"user":["83.0"],"agent":["83.0"],"头部的值":["83.0"],"下面前端代码可以判断用户是用哪个终端打开页面的":["83.0"],"如果是用":["83.0"],"pc":["83.0"],"打开的":["83.0"],"与浏览器历史记录进行交互":["84.0"],"该对象包含用户":["84.0"],"在浏览器窗口中":["84.0"],"访问过的":["84.0"],"oriented":["85.1"],"programming":["85.2"],"面向对象是把事物分解成为一个个对象":["85.2"],"然后由对象之间分工和合作":["85.2"],"在javascript种":["85.3"],"对象是一组无序的相关属性和方法的集合":["85.3"],"在es6中新增加了类的概念":["85.4"],"uname":["85.6","87.2"],"father":["85.8","87.2"],"sum":["85.9","85.12"],"baba":["85.10"],"son":["85.10"],"erzi":["85.10"],"this":["85.11"],"加this":["85.12"],"button":["85.12"],"点击":["85.12"],"script":["85.12"],"都存在类的概念":["86.1"],"类就是对象的模板":["86.1"],"只能通过实例化的对象来访问":["86.3"],"比如对象的属性或者在对象上面直接赋值":["86.4"],"构造函数有原型对象prototype":["86.6"],"使用构造函数进行存储对象的时候":["86.7"],"注意这个prototype就是一个对象":["86.8"],"这个对象的所有属性和方法":["86.8"],"都会被构造函数所拥有":["86.8"],"我们可以把那些不变的方法":["86.8"],"直接定义在prototype对象上":["86.8"],"对象原型和原型对象prototype是等价的":["86.9"],"20220427225452260":["86.9"],"20220428153413890":["86.9"],"20220428153756325":["86.9"],"很多情况下":["86.10"],"我们需要手动的利用constructor这个属性指回原来的构造函数":["86.10"],"20220428160253187":["86.10"],"如果创建的原型是对象":["86.10"],"那么需要constructor重新指回原型":["86.10"],"20220428161715813":["86.10"],"原型对象三者之间的关系":["86.11"],"proto":["86.12"],"包括方法":["86.13"],"首先查找这个":["86.13"],"在构造函数中":["86.14"],"不能这么用":["86.15"],"会覆盖原来的方法":["86.15"],"传递其他参数":["87.1"],"woxianghe":["87.1"],"父构造函数":["87.2"],"money":["87.3"],"类的本质其实还是一个函数":["87.4"],"我们可以简单的认为类就是构造函数的另一种写法":["87.4"],"数组当前项的索引":["88.1"],"数组对象本身":["88.1"],"newarray":["88.1"],"callback":["88.1"],"thisarg":["88.1","89.5"],"prop":["88.3"],"descriptor":["88.3"],"必需":["88.3"],"命名函数":["89.1"],"函数表达式":["89.1"],"匿名函数":["89.1"],"对象的方法":["89.2"],"调用方式的不同决定了":["89.3"],"的指向不同":["89.3"],"一般我们指向我们的调用者":["89.3"],"常用的有":["89.4"],"但是它可以改变函数的this指向":["89.5"],"但是它可以改变函数的":["89.6"],"this指向":["89.6"],"方法不会调用函数":["89.7"],"但是能改变函数内部this指向":["89.7"],"都可以改变函数内部的this指向":["89.8"],"区别点":["89.8"],"call和apply会调用函数":["89.8"],"strict":["90.1"],"mode":["90.1"],"es5的严格模式是采用具有限制性javascript变体的一种方式":["90.1"],"即在严格的条件下运行js代码":["90.1"],"整个脚本":["90.2"],"或":["90.2"],"为整个脚本文件开启严格模式":["90.3"],"需要在所有语句之前":["90.3"],"放一个特定的语句":["90.3"],"为函数开启严格模式":["90.4"],"如果一个变量没有声明就赋值":["90.6"],"默认是全局变量":["90.6"],"严格模式下全局作用域中函数中的this是undefined":["90.7"],"函数必须声明在顶层":["90.8"],"接受函数作为参数":["90.9"],"将函数作为返回值输出":["90.9"],"全局变量和局部变量":["91.1"],"closure":["91.2"],"键启动":["91.3"],"chrome":["91.3"],"调试工具":["91.3"],"设置断点":["91.3"],"ul":["91.5"],"20230415025533580":["91.6"],"打车案例":["91.6"],"car":["91.6"],"起步价":["91.6"],"total":["91.6"],"总价":["91.6"],"return":["91.6","92.0","105.0","109.9"],"正常价格":["91.6"],"2fn":["92.0"],"每一级别的数据都会拷贝":["92.2"],"sources":["92.2"],"o":["92.3"],"封装函数":["92.3"],"deepclone":["92.3"],"expression":["93.2"],"是用于匹配字符串中字符组合":["93.2"],"在javascript中":["93.2"],"可以迅速地用极简单的方式达到字符串的复杂控制":["93.3"],"可以通过两种方式创建一个正则表达式":["93.5"],"正则对象方法":["93.6"],"用于检测字符串是否符合该规则":["93.6"],"也可以是简单和特殊字符的组合":["93.7"],"ab":["93.7"],"以谁开始":["93.8"],"表示匹配行尾的文本":["93.8"],"以谁结束":["93.8"],"如果":["93.8"],"在一起":["93.8"],"表示必须是精确匹配":["93.8"],"只要匹配其中一个就可以了":["93.9"],"z":["93.11"],"test":["93.11","124.1"],"方括号内部加上":["93.11"],"表示":["93.11"],"重复零次或更多次":["93.12"],"如果用户名输入不合法":["93.14"],"用户名不符合规范":["93.14"],"分析":["93.14","112.3"],"中括号":["93.15"],"字符集合":["93.15"],"匹配方括号中的任意字符":["93.15"],"表示优先级":["93.15"],"9之间的任一数字":["93.16"],"相当于":["93.16"],"匹配所有0":["93.16"],"9以外的字符":["93.16"],"stringobject":["93.18"],"regexp":["93.18"],"表达式":["93.19"],"什么是ecma":["94.1"],"ecma":["94.1","94.3"],"什么是ecmascript":["94.2"],"国际制定了许多标准":["94.3"],"org":["94.4"],"publications":["94.4"],"standards":["94.4"],"arch":["94.4"],"htm":["94.4"],"版本":["94.4","114.0"],"时间":["94.4"],"概述":["94.4"],"第1版":["94.4"],"1997年":["94.4"],"tc39":["94.5"],"technical":["94.5"],"为什么要学习es6":["94.6"],"es6兼容性":["94.7"],"使用let声明的变量有几个特点":["95.1"],"let":["95.2","95.3"],"单个声明":["95.2"],"块儿级作用域":["95.4"],"var存在":["95.6"],"代码实现":["95.6"],"不存在变量提升":["95.6"],"什么是作用域链":["95.7"],"meta":["95.8","103.1"],"charset":["95.8"],"utf":["95.8"],"viewport":["95.8"],"content":["95.8"],"声明必须赋初始值":["96.1"],"标识符一般为大写":["96.1"],"习惯":["96.1"],"对变量进行赋值":["97.1"],"这被称为解构赋值":["97.1"],"doctype":["97.1","101.1","102.1","104.2"],"是增强版的字符串":["98.1"],"用反引号":["98.1"],"标识":["98.1"],"返回布尔值":["98.3"],"endswith":["98.3"],"表示参数字符串是否在原字符串的尾部":["98.3"],"作为对象的属性和方法":["99.1"],"这样书写更加简洁":["99.1"],"定义函数":["100.1"],"如果形参只有一个":["100.2"],"则小括号可以省略":["100.2"],"不能作为构造实例化对象":["100.3"],"用来代替arguments":["102.1"],"spread":["103.0"],"也是三个点":["103.0"],"它好比rest参数的逆运算":["103.0"],"arraylike":["103.3"],"ary":["103.4"],"如果包含则返回":["103.6"],"否则返回":["103.6"],"表示独一无二的值":["104.1"],"它是javascript语言的第七种数据类型":["104.1"],"ownkeys来获取对象所有键名":["104.2"],"symbol":["104.2"],"key":["104.2"],"使用给定的key搜索现有的symbol":["104.2"],"如果找到则返回该symbol":["104.2"],"否则将使用给定的key在全局symbol注册表中创建一个新的symbol":["104.2"],"isconcatspreadable":["104.4"],"对象的":["104.4"],"属性等于的是一个布尔值":["104.4"],"表示该对象用于":["104.4"],"concat":["104.4"],"是否可以展开":["104.4"],"species":["104.4"],"创建衍生对象时":["104.4"],"会使用该属性":["104.4"],"gen":["105.0"],"yield":["105.0"],"一只没有耳朵":["105.0"],"一只没有尾巴":["105.0"],"真奇怪":["105.0"],"为各种不同的数据结构提供统一的访问机制":["106.1"],"任何数据结构只要部署iterator接口":["106.1"],"就可以完成遍历操作":["106.1"],"es6创造了一种新的遍历命令for":["106.1"],"是":["107.0","110.1"],"es6":["107.0","108.5","109.2"],"引入的异步编程的新解决方案":["107.0"],"js中如何实现模块化":["108.1"],"模块化规范诞生之前":["108.2"],"社区已经尝试并提出了":["108.2"],"amd":["108.2"],"模块化规范":["108.3","108.4"],"模块化规范是浏览器端与服务器端通用的模块化开发规范":["108.3"],"中默认仅支持":["108.4"],"commonjs":["108.4"],"模块化的基本语法":["108.5"],"default":["108.6"],"默认导出的成员":["108.6"],"exclamation":["108.8","108.9","108.12"],"export":["108.10"],"s1":["108.11"],"from":["108.11","109.8"],"模块标识符":["108.11"],"并不需要得到模块中向外共享的成员":["108.13"],"示例代码如下":["109.1"],"第1层回调函数":["109.1"],"promise":["109.3","109.6","109.12","110.2"],"实例对象":["109.3","109.12"],"代表一个":["109.3"],"层层嵌套":["109.4"],"由于":["109.5"],"官方提供的":["109.5"],"可以异步地读取文件的内容":["109.6"],"它的返回值是":["109.6"],"的实例对象":["109.6"],"因此可以调用":["109.6"],"方法为每个":["109.6"],"如果上一个":["109.7"],"thenfs":["109.8"],"then":["109.8","109.9","109.10","109.11","109.12"],"fs":["109.8","109.9"],"readfile":["109.9"],"files":["109.9"],"txt":["109.9"],"utf8":["109.9"],"r1":["109.9"],"异步操作":["109.10","109.11"],"等所有的异步操作全部结束后":["109.10"],"才会执行下一步的":["109.10"],"操作":["109.10","109.11"],"只要任何一个异步操作完成":["109.11"],"就立即执行下一步的":["109.11"],"表示要读取的文件的路径":["109.12"],"方法的返回值为":["109.12"],"通过":["109.12"],"await":["110.2"],"简化":["110.2"],"异步操作的示例代码如下":["110.2"],"修饰":["110.3"],"方法中":["110.3"],"第一个":["110.3"],"之前的代码会同步执行":["110.3"],"之后的代码会异步执行":["110.3"],"是一门单线程执行的编程语言":["111.1"],"导致":["111.2"],"程序假死":["111.2"],"的问题":["111.2"],"javascript把待执行的任务分为了两类":["111.2"],"同步任务由":["111.3"],"主线程从":["111.4"],"正确的输出结果":["111.5"],"adcb":["111.5"],"又做了进一步的划分":["112.1"],"异步任务又分为两类":["112.1"],"分别是":["112.1"],"20220519155055354":["112.2"],"代码较长":["112.4"],"即library":["113.1"],"是一个封装好的特定的集合":["113.1"],"write":["113.2"],"less":["113.2"],"do":["113.2"],"不会影响页面加载速度":["113.3"],"跨浏览器兼容":["113.3"],"此处是页面dom加载完成的入口":["114.1"],"是jquery的别称":["114.2"],"在代码中可以使用jquery代替":["114.2"],"原生js获取过来的对象就是dom对象":["114.3"],"要想使用这些属性和方法需要把jquery对象转换成dom对象才能使用":["114.4"],"里面选择器直接写css选择器":["115.1"],"子代选择器":["115.2"],"遍历内部dom元素":["115.3"],"first":["115.4"],"获取第一个li元素":["115.4"],"查找所有父级":["115.5"],"当前节点所有父节点":["115.5"],"查找父级":["115.5"],"当前节点的直接父节点":["115.5"],"children":["115.5"],"看起来更优雅":["115.6"],"参数时属性名":["116.1"],"属性值":["116.1"],"添加类":["116.2"],"jquery里面类操作只是对指定类进行操作":["116.3"],"三种预定速度之一的字符串":["117.1"],"slow":["117.1"],"normal":["117.1"],"or":["117.1"],"fast":["117.1"],"或表示动画时长的毫秒数值":["117.1"],"hover":["117.2"],"下滑":["117.3"],"淡入":["117.4"],"speed":["117.5"],"easing":["117.5"],"如果多次触发":["117.7"],"方法可以在指定的元素上存取数据":["118.3"],"并不会修改dom结构":["118.3"],"只能获取文字":["119.2"],"val":["119.3"],"xxx":["120.1"],"方法遍历匹配的每一个元素":["120.1"],"主要用dom处理":["120.1"],"each是每一个的意思":["120.1"],"里面的回调函数有2个参数":["120.1"],"index是每一个元素的索引号":["120.1"],"append":["120.3"],"内容":["120.3"],"remove":["120.4"],"取得匹配元素宽度和高度值":["121.1"],"只算width":["121.1"],"设置或获取元素偏移":["121.2"],"相对于文档的位置距离":["121.2"],"方法设置或返回被选元素相对于":["121.2"],"事件":["122.2"],"方法在匹配元素上绑定一个或多个事件的事件处理函数":["122.4"],"事件绑定在ul上":["122.5"],"触发在li上":["122.5"],"动态创建元素":["122.5"],"不能弹出":["122.5"],"方法可以移除通过on":["122.6"],"方法添加的事件处理程序":["122.6"],"event":["122.9"],"selector":["122.9"],"extend":["123.1"],"deep":["123.1"],"随着jquery的流行":["123.2"],"其他js库也会用这":["123.2"],"收集最全最新最好的jquery插件":["123.3"],"他能帮助减轻服务器负载":["123.4"],"plugin":["123.5"],"by":["123.5"],"alvaro":["123.5"],"元素组或单个元素进行操作":["124.0"],"选择id值为test的元素":["124.1"],"元素下元素名是":["124.2"],"的子元素":["124.2"],"one":["124.2"],"元素中最后一个":["124.3"],"选取所有":["124.4"],"中含有":["124.4"],"元素":["124.6"],"选取所有的name属性不等于":["124.6"],"选取class为":["124.7"],"选取id为":["124.8"],"textarea":["124.9"],"select":["124.9"]},{"0":["18.0","55.4","62.4","76.9","93.17","95.8","103.3"],"1":["16.2","18.0","21.2","22.2","27.7","27.10","36.0","56.8","58.5","67.1","68.7","87.1","90.1","91.1","95.8","103.3","103.4","109.8","111.2","112.1"],"2":["11.3","18.0","26.2","26.3","26.5","32.4","32.12","42.2","43.3","53.2","55.11","56.8","58.5","61.4","62.15","65.9","66.2","66.3","67.4","68.7","69.5","70.2","71.2","74.2","74.3","77.5","78.17","86.13","89.8","90.6","100.2","106.1","108.12","109.3","109.9","111.3","114.3","121.2"],"3":["7.0","26.2","29.2","51.2","56.12","61.7","65.9","66.3","69.4","69.5","81.2","81.5","89.1","89.2","91.3","91.6","96.1","120.1","121.2"],"4":["51.2","68.3","88.1","96.1"],"5":["18.0","25.5","62.14","66.1","68.3","91.6","103.5"],"6":["21.1","29.2","62.11","93.14","112.3"],"7":["21.1","55.4","93.17"],"8":["30.4","76.17","93.17","103.1","104.2"],"9":["69.9","93.17"],"10":["56.2","58.5","63.7","66.3","67.1","92.0"],"12":["103.5"],"18":["65.3"],"20":["56.2","66.1"],"21":["62.11"],"22":["61.7"],"30":["56.2"],"39":["94.5"],"61":["88.1"],"100":["19.0","32.11"],"900":["19.0"],"1000":["81.2","117.1"],"1200":["68.4"],"1500":["68.4"],"2000":["68.4"],"2019":["67.1"],"增加了一些新的标签":["1.0"],"新的表单和新的表单属性等":["1.0"],"内容标签":["2.0"],"section":["2.0"],"定义文档某个区域":["2.0"],"视频":["3.0"],"autoplay":["3.1"],"出现该属性意味着视频在就绪后将自动播放":["3.1"],"用法":["3.1"],"出现该属性意味着向用户显示控件":["3.1"],"source":["3.2"],"happy":["3.2"],"type":["3.2","5.2","29.2","49.0","50.4","78.4","78.18"],"谷歌浏览器把音频和视频自动播放禁止了":["3.3"],"我们可以给视频标签添加muted属性来静音播放视频":["3.3"],"限制用户输入必须为url类型":["4.0"],"date":["4.0","67.5"],"限制用户输入必须为日期类型":["4.0"],"提示文本":["4.1"],"表单的提示信息":["4.1"],"存在默认值将不显示":["4.1"],"autofocus":["4.1"],"val":["5.1","61.6"],"n":["5.2","91.6"],"匹配父元素中的第n个子元素e":["5.2"],"of":["5.2"],"指定类型e的第一个":["5.2"],"但是属于行内元素":["5.3"],"新创建的这个元素在文档树中是找不到的":["5.3"],"所以我们称为伪元素":["5.3"],"语法":["5.3","25.8","26.4","27.12","32.12","37.0","56.10"],"css":["5.3","8.5","12.3","17.8","17.11","23.2","25.3","25.8","25.10","26.1","26.4","27.12","31.3","33.0","35.3","43.1","76.16","115.6"],"element":["5.3","75.6"],"表单元素禁用状态":["5.4"],"selection":["5.4"],"文本选中状态样式":["5.4"],"html":["5.4","21.1","52.3","97.1","99.1","102.1","104.2"],"head":["5.4","101.1","104.2"],"not":["5.5","124.3"],"div":["5.6","26.0","26.6","73.1","75.10","76.3","76.14","114.4","122.6","124.1"],"汉译为搜索引擎优化":["6.1"],"是一种利用搜索引擎的规则提高网站在有关搜索引擎内自然排名的方式":["6.1"],"建议":["6.2"],"网站名":["6.2"],"产品名":["6.2"],"网站的介绍":["6.2"],"我们提供":["6.3"],"网作为":["6.3"],"电话":["6.3"],"010":["6.3"],"之类语句":["6.3"],"关键词之间用英文逗号隔开":["6.4"],"采用":["6.4"],"关键词1":["6.4"],"关键词2":["6.4"],"的形式":["6.4"],"例如":["6.4"],"h1里面再放一个链接":["7.0"],"可以返回首页的":["7.0"],"把logo的背景图片给链接即可":["7.0"],"为了搜索引擎收录我们":["7.0"],"radius":["8.1"],"一值设定高斯函数的标准差":["8.1"],"的话":["8.2"],"图像会全黑":["8.2"],"则完全转为灰度图像":["8.3","8.6"],"值为0":["8.3","8.6"],"angle":["8.4"],"参数如下":["8.5"],"offset":["8.5"],"x":["8.5","11.4","68.7"],"y":["8.5","11.2","11.4","11.5","11.7","14.1","66.1"],"必须":["8.5"],"这是设置阴影偏移量的两个":["8.5"],"length":["8.5","66.3","69.1","69.5"],"值":["8.5","14.3","25.13","27.2","65.6"],"设定水平方向距离":["8.5"],"负值会使阴影出现在元素左边":["8.5"],"width":["9.0","32.5","32.11","32.18","33.3","48.0"],"更动感十足":["10.0"],"虽然低版本浏览器不支持":["10.0"],"ie9以下版本":["10.0"],"但是不会影响页面布局":["10.0"],"我们现在经常和":["10.0"],"hover一起搭配使用":["10.0"],"可以实现元素的位移":["11.0"],"旋转":["11.0","11.1"],"缩放":["11.1"],"或者分开写":["11.2"],"度数":["11.3"],"不可以是负数":["11.5"],"transform":["11.6"],"translate":["11.6"],"最大的优势是不影响其他盒子":["11.7"],"里面参数用":["11.7"],"是相对于自身宽度和高度来计算的可以分开写比如translatex":["11.7"],"是css3中具有顛覆性的特征之一":["12.0"],"可通过设置多个节点来精确控制一个或一组动画":["12.0"],"动画是使元素从一种祥式逐渐变化为另":["12.1"],"种样式的效果":["12.1"],"您可以改变任意多的样式任意多的次数":["12.1"],"请用百分比来规定变化发生的时间":["12.1"],"或用关键词":["12.1"],"必须的":["12.2"],"duration":["12.2"],"规定动画完成个周期所花费的秒或毫秒":["12.2"],"默认是0":["12.2"],"动画起始或者结束的状态":["12.3"],"name":["12.3","50.3","54.8","65.8","76.17","85.6","86.8","86.9","103.4"],"动画从头到尾的速度是相同的":["12.4"],"匀速":["12.4"],"ease":["12.4"],"默认":["12.4"],"image属性实现渐变背景效果":["13.0"],"缩放等效果":["14.0"],"z":["14.1","68.7"],"属性":["14.2","16.1","31.6","44.1","65.1","65.4","65.6","75.7"],"添加给父级":["14.2"],"rotatex":["14.3"],"思考":["14.4","30.2"],"使用perspective透视属性能否呈现立体图形":["14.4"],"scalex":["14.5"],"倍数":["14.5"],"sheets":["15.1"],"百度百科":["15.1"],"属性值":["15.2","31.4","31.7","35.1","44.1"],"选择符":["16.1"],"层次选择器":["16.2"],"伪类选择器":["16.2"],"属性选择器":["16.2"],"伪对象":["16.2"],"伪元素":["16.2"],"选择器":["16.2","26.1","26.4"],"类型选择器":["16.2"],"类型选择器1":["16.3"],"news":["17.1","124.6"],"下载":["17.1"],"download":["17.1"],"子导航":["17.1","17.5"],"subnav":["17.1","17.5"],"菜单":["17.1"],"menu":["17.1"],"搜索":["17.1"],"search":["17.1"],"页脚":["17.1"],"内容区":["17.2"],"内容":["17.4"],"content":["17.4","26.8"],"页面主体":["17.4"],"顶导航":["17.5"],"功能区":["17.6"],"shop":["17.6"],"标题":["17.6"],"title":["17.6","77.4","95.8"],"加入":["17.6"],"joinus":["17.6"],"状态":["17.6"],"status":["17.6"],"如":["17.8","17.10","17.11","117.1"],"作为名称":["17.9"],"base":["17.12"],"主题":["17.12"],"themes":["17.12"],"查找与替换":["18.0"],"并定位在":["18.0"],"标签上":["18.0"],"定位":["18.0"],"使选中的文字倾斜":["18.0"],"取消倾斜":["18.0"],"l":["18.0"],"给光标所在行的文本加上":["18.0"],"项目符号":["18.0"],"同时增加首行和悬挂缩进":["18.0"],"同时减少首行和悬挂缩进":["18.0"],"新建一个空文档":["18.0"],"f12":["18.0"],"使光标所在行的文本右对齐":["18.0"],"为新文档打开":["18.0"],"另保存为":["18.0"],"或对当前文档进行保存":["18.0"],"增加首行缩进":["18.0"],"减少首行缩进":["18.0"],"给选中的文字加上下划线":["18.0"],"去年下划线":["18.0"],"将剪贴板中的文本或图片粘贴到光标处":["18.0"],"若剪贴板中有多个内容":["18.0"],"则将":["18.0"],"最后一条内容粘贴到光标处":["18.0"],"将选中的文字剪切到剪贴板中":["18.0"],"撤销刚才进行的操作":["18.0"],"可以多次使用":["18.0"],"将选中的文本每段前增加12磅的间距":["18.0"],"若选中的文本行距不是":["18.0"],"单倍行距":["18.0"],"则将其快速设置为":["18.0"],"将选中的文本行距设置为":["18.0"],"两倍行距":["18.0"],"5倍行距":["18.0"],"f2":["18.0"],"快速执行":["18.0"],"打印预览":["18.0"],"功能":["18.0"],"f4":["18.0"],"关闭当前文档":["18.0"],"使窗口还原到最大化之前的状态":["18.0"],"normal":["19.0"],"bold":["19.0"],"bolder":["19.0"],"29d794":["20.0"],"f":["20.0"],"üj":["20.0"],"rgbftis":["20.0"],"text":["20.0","38.2","50.4","124.9"],"align":["20.0"],"two":["21.1"],"tab键就可以了":["21.1"],"如果生成的div类名是有顺序的":["21.1"],"可以用自增符号":["21.1"],"如果想要在生成的标签内部写内容可以用":["21.1"],"表示":["21.1"],"也可以设置当我们保存页面的时候自动格式化代码":["21.2"],"元素显示模式就是":["22.1"],"元素":["22.1","72.2","76.1","124.9"],"其中":["22.2","22.3","55.6","111.5"],"标签是最典型的块元素":["22.2"],"块级元素的特点":["22.2"],"ins":["22.3"],"u":["22.3"],"span":["22.3","76.3","76.14","124.7"],"等":["22.3"],"a":["22.4","69.9","111.5"],"的触发范围":["22.4"],"transparent":["23.1"],"no":["23.3"],"另一个冲突的样式":["24.1"],"层叠性主要解决样式冲突的问题":["24.1"],"简单的理解就是":["24.2"],"子承父业":["24.2"],"如果子元素没有设置行高":["24.3"],"则会继承父元素的行高为1":["24.3"],"以此类推":["24.4"],"等级判断从左向右":["24.4"],"如果某一位数值相同":["24.4"],"先准备好相关的网页元素":["25.0"],"网页元素基本都是盒子box":["25.0"],"border":["25.1","48.0"],"盒子边框":["25.1"],"medium":["25.4"],"默认宽度":["25.4"],"隐藏边框":["25.5"],"ie不支持":["25.5"],"dotted":["25.5"],"在mac平台上ie4":["25.5"],"与windows和unix平台上ie5":["25.5"],"right":["25.9"],"右内边距":["25.9"],"top":["25.9","25.11"],"上内边距":["25.9"],"盒子左右的外边距都设置为auto":["25.10"],"header":["25.10"],"960px":["25.10"],"则他们之间的垂直间距不是margin":["25.11"],"bottom与margin":["25.11"],"top之和":["25.11"],"image":["25.12","42.1","50.3","86.11","90.9","109.12","110.3"],"blur":["25.13","25.14"],"spread":["25.13"],"color":["25.13","25.14"],"inset":["25.13"],"描述":["25.13","35.1"],"v":["25.14"],"这样我们":["25.15"],"计算盒子大小的方式就发生了改变":["25.15"],"常用元素":["26.0"],"hr":["26.0"],"p":["26.0","44.2"],"float":["26.1"],"浮动的元素会一行内显示井且元素顶部对齐":["26.2"],"之后内部子元素采取浮动排列左右位置":["26.3"],"就不会影响下面的标准流了":["26.4"],"是w3c推荐的做法":["26.5"],"style":["26.6","39.4"],"clear":["26.6"],"auto":["26.7"],"或scroll":["26.7"],"display":["26.8","31.3"],"after":["26.9"],"清除浮动的方式":["26.10"],"优点":["26.10"],"缺点":["26.10"],"额外标签法":["26.10"],"隔墙法":["26.10"],"将盒子定在某一个位置":["27.0"],"语义":["27.2"],"顶端偏移量":["27.3"],"定义元素相对于其父元素上边线的距离":["27.3"],"bottom":["27.3"],"无定位的意思":["27.5"],"自恋型":["27.6"],"相对定位的特点":["27.6"],"务必记住":["27.6","27.8"],"拼爹型":["27.7"],"如果":["27.7"],"固定定位的特点":["27.8"],"走到浏览器可视区":["27.9"],"也可以看做版心":["27.9"],"以浏览器的可视窗口为参照点移动元索":["27.10"],"index来控制盒子的前后次序":["27.12"],"z轴":["27.12"],"行内元素添加绝对或者固定定位":["27.14"],"固定定位":["27.15"],"浮动元素不同":["27.16"],"但是我们重新刷新页面":["28.0"],"其不为被隐藏的对象保留其物理空间":["28.1"],"inline":["28.1"],"内联对象的默认值":["28.1"],"用该值将从对象中删除行":["28.1"],"compact":["28.1"],"css2":["28.1"],"分配对象为块对象或基于内容之上的内联对象":["28.1"],"marker":["28.1"],"指定内容在容器对象之前或之后":["28.1"],"要使用此参数":["28.1"],"collapse":["28.2"],"hidden":["28.2"],"参数":["28.2","28.3","62.7","117.5"],"scroll":["28.3"],"不剪切内容也不添加滚动条":["28.3"],"有一种技术的出现很好的解决了以上问题":["29.1"],"就是字体图标iconfont":["29.1"],"字体图标是一些网页常见的小图标":["29.1"],"我们直接网上下载即呵":["29.1"],"因此使用可以分为":["29.1"],"字体图标的下载":["29.1"],"chrome6":["29.2"],"opera11":["29.2"],"embedded":["29.2"],"eot":["29.2"],"格式eot字体是ie专用字体":["29.2"],"支持这种字体的浏览器有ie4":["29.2"],"是生产屏幕时就固定的":["30.1"],"它是不可被改变的":["30.1"],"网页宽度为100":["30.2"],"网页的宽度和逻辑分辨率尺寸相同":["30.2"],"默认情况下":["30.2"],"网页的宽度和逻辑分辨率相同吗":["30.2"],"不同":["30.2"],"为了高分辨率下图片不会模糊失真":["30.3"],"也叫流式布局":["30.5"],"浮动":["31.1"],"设置盒子间的间距使用什么属性":["31.1"],"灵活":["31.2"],"flex":["31.3","31.4"],"space":["31.4","38.1"],"between":["31.4"],"作用":["31.4","31.7","84.0"],"self":["31.5","46.0"],"控制某个弹性盒子在侧轴的对齐方式":["31.5"],"添加到弹性盒子":["31.5"],"row":["31.7"],"wrap":["31.8"],"规定灵活的项目在必要的时候拆行或拆列":["31.8"],"reverse":["31.8","68.2"],"vw":["32.0"],"px单位或百分比布局可以实现吗":["32.2"],"px单位是绝对单位":["32.2"],"百分比布局宽度自适应":["32.2"],"样式":["32.3"],"当某个条件成立":["32.3"],"执行对应的css样式":["32.3"],"写法":["32.3"],"根据视口宽度":["32.4"],"设置不同的html标签字号":["32.4"],"书写代码":["32.4"],"尺寸是rem单位":["32.4"],"320px":["32.5"],"max":["32.5"],"480px":["32.5"],"平板之类的宽度":["32.5"],"1024以下设备":["32.5"],"网页元素尺寸等比缩放效果":["32.6","32.17"],"扩充了css语言":["32.7"],"在px单位转换到rem单位过程中":["32.8"],"哪项工作是最麻烦的":["32.8"],"less":["32.9"],"快捷键":["32.10"],"ctrl":["32.10","78.26"],"box":["32.11"],"存储数据":["32.13"],"方便使用和修改":["32.13"],"文件路径":["32.14"],"搜索easyless":["32.15"],"在setting":["32.15"],"json中编辑":["32.15"],"false":["32.16","55.6","78.13","103.6"],"viewport":["32.18"],"确定设计稿对应的vw的尺寸":["32.19"],"例子":["33.0"],"视口宽度小于等于768px":["33.0"],"网页背景色是粉色":["33.0"],"20220410194220892":["33.1"],"电脑":["33.2"],"平板都属于屏幕设备":["33.2"],"类型名称":["33.2"],"视口的宽和高":["33.3"],"height":["33.3","48.0"],"数值":["33.3"],"line":["34.0"],"就是更改一些用户操作样式":["35.0"],"pointer":["35.1"],"或者outline":["35.2"],"主要解决方法有两种":["36.0"],"用于设置一个元素的":["37.0"],"垂直对齐方式":["37.0"],"但是它只针对于行内元素或者行内块元素有效":["37.0"],"行内显示文本":["38.1"],"white":["38.1"],"ellipsis":["38.2"],"弹性伸缩盒子模型显示":["38.2"],"solid":["39.1","39.4"],"red":["39.1"],"margin":["39.1"],"也称为css":["40.0"],"reset":["40.0"],"每个网页都必须首先进行css初始化":["40.0"],"默认值":["41.0"],"调整替换后的内容大小":["41.0"],"以填充元素的内容框":["41.0"],"20230414193816227":["42.1"],"因此":["42.1"],"就是把多个小背景图片整合到一张大图片中":["42.2"],"这个大图片也称为sprites精灵图或者雪碧图":["42.2"],"制定了结构":["43.1"],"xhtml":["43.1"],"xml":["43.1","52.3"],"和表现":["43.1"],"的标准":["43.1"],"非赢利性的":["43.1"],"ecma":["43.1"],"european":["43.1","94.1"],"computer":["43.1","94.1"],"manufactures":["43.1"],"association":["43.1"],"作用就是告诉浏览器使用":["43.2"],"哪种html版本":["43.2"],"来显示网页":["43.2"],"扩展":["43.2"],"zh":["43.3"],"cn定义语言为中文":["43.3"],"编码":["43.4"],"尽量统一写成标准的":["43.4"],"不要写成":["43.4"],"utf8":["43.4","109.8"],"或":["43.4","75.11","90.3"],"常见开发工具":["43.4"],"visual":["43.4"],"studio":["43.4"],"code":["43.4"],"editing":["43.4"],"标记":["44.1"],"标题h5":["44.2"],"h6":["44.2","44.3"],"标题h6":["44.2"],"段落":["44.2"],"段落文本内容":["44.2"],"自动换行":["44.3"],"h1":["44.3"],"copy":["44.4"],"版权信息":["44.4"],"src":["45.0","77.4"],"blank或者":["46.0"],"高度":["48.0"],"宽度":["48.0"],"边框":["48.0"],"bordercolor":["48.0"],"get":["50.1"],"不推荐":["50.1","77.5"],"不安全":["50.1"],"数据传输量小":["50.1"],"不超过2kb":["50.1"],"post":["50.1"],"比较推荐":["50.1"],"相对安全":["50.1"],"action":["50.2"],"url地址":["50.2"],"id":["50.3","50.4","61.7","73.1","92.2","103.4","124.0"],"input":["50.4"],"br":["50.4"],"password":["50.4"],"密码":["50.4"],"另一个是发明一种全新的语言livescript":["51.1"],"javascript":["51.1","54.5","55.8","56.5","57.6","58.5","58.6","61.0","62.9","63.5","65.6","75.1","75.6","75.10","76.1","78.20","78.22","79.1","80.6","80.7","81.5","83.0","85.5","86.8","86.9","88.1","89.1","90.4","92.2","93.15","98.3","100.3","103.0","103.6","108.6","108.11","109.6","109.10","109.11","109.12","110.3","120.1"],"ecmascript":["51.1","52.0","94.7","109.2"],"1995年sun公司将oak语言改名为java":["51.1"],"正式向市场推出":["51.1"],"sun公司大肆宣传":["51.1"],"许诺这种语言可以":["51.1"],"实现桌面端应用":["51.2"],"electron":["51.2"],"文档对象模型":["52.0"],"类型":["52.1"],"async":["52.2"],"wait":["52.2"],"sharedarraybuffer及atomics":["52.2"],"api":["52.2"],"以及object":["52.2"],"values":["52.2"],"object":["52.2","65.5"],"entries":["52.2"],"用于在":["52.3"],"中使":["52.3"],"用扩展的":["52.3"],"browser":["52.4"],"button":["53.1","78.3","124.9"],"value":["53.1","57.8","61.6"],"唐伯虎":["53.1"],"onclick":["53.1","78.3","85.12"],"浏览器弹出警示框":["53.3"],"浏览器":["53.3"],"我们通过":["54.2"],"变量名":["54.2"],"var":["54.3","54.6","54.8","55.7","55.8","57.7","58.5","58.10","58.11","62.4","62.11","65.8","67.5","68.4","69.3","85.10","89.1","92.2","93.5","93.8","93.15"],"age":["54.3","61.6","61.7","65.3","65.8","65.9","85.6","86.9","86.10"],"声明一个名称为age的变量":["54.3"],"是一个js关键字":["54.3"],"变量值将以最后一次赋的值为准":["54.5"],"log":["54.7","55.7","62.8","63.7","67.1","67.4","68.3","81.5","85.8","85.11","98.5","105.0","109.1","110.3"],"只声明":["54.7"],"不赋值":["54.7"],"usrage":["54.8"],"num01":["54.8"],"严格区分大小写":["54.8"],"app":["54.8"],"类型会被自动确定":["55.1"],"在代码运行时":["55.1"],"变量的数据类型是由":["55.1"],"js引擎":["55.1"],"boolean":["55.3","70.3"],"布尔值类型":["55.3"],"如true":["55.3"],"八进制数字序列范围":["55.4"],"num1":["55.4","62.9"],"07":["55.4"],"对应十进制的7":["55.4"],"num2":["55.4","62.8"],"019":["55.4"],"常见错误":["55.5"],"strmsg3":["55.5"],"我爱大肘子":["55.5"],"报错":["55.5"],"没使用引号":["55.5"],"会被认为是js代码":["55.5"],"但js没有这些语法":["55.5"],"variable":["55.7"],"console":["55.7","58.5","62.8","63.7","67.1","68.3","81.5","85.8","85.11","86.10","93.8","98.5","105.0","109.1","110.3"],"我们继续研究null":["55.8"],"不同类型的返回值":["55.10"],"和字符串拼接的结果都是字符串":["55.11"],"我是字符串":["55.11"],"转换为数字型":["55.11"],"parseint":["55.11"],"函数":["55.11"],"continue":["55.12"],"default":["55.12","57.8"],"delete":["55.12"],"do":["55.12"],"else":["55.12","91.6"],"finally":["55.12"],"for":["55.12","58.3","58.5","62.4","65.9","69.5","69.9","92.3"],"function":["55.12","62.3","62.9","63.5","63.7","65.6","68.2","80.1","80.3","86.8","86.9","86.15","109.12","110.2","122.9"],"if":["55.12","60.10","68.2","69.9","78.6","78.11","83.0","91.6"],"in":["55.12","65.9","92.3"],"instanceof":["55.12"],"new":["55.12","67.5","85.10","89.1"],"也被称为操作符":["56.1"],"减":["56.2"],"位小数":["56.3"],"运算符":["56.4"],"在":["56.5","78.17","89.5","89.6"],"中":["56.5"],"类似于":["56.6","56.7","76.16"],"说明":["56.8","56.9","56.11","62.7"],"案例":["56.8","56.9"],"结果":["56.8"],"小于号":["56.8"],"逻辑与":["56.10"],"表达式1":["56.10"],"表达式2":["56.10"],"如果第一个表达式的值为真":["56.10"],"一元运算符":["56.12"],"算数运算符":["56.12"],"的执行顺序来实现我们要完成的功能":["57.1"],"简单理解":["57.1"],"它没有特定的语法结构":["57.2"],"程序会按照代码的":["57.2"],"执行不同的路径代码":["57.3"],"条件成立执行代码":["57.4"],"否则什么也不做":["57.4"],"条件成立":["57.5"],"执行":["57.5"],"适合于检查多重条件":["57.6"],"条件表达式1":["57.6"],"num":["57.7","65.9","92.0"],"prompt":["57.7"],"result":["57.7"],"不等于任何一个":["57.8"],"case语句通常处理case为比较确定值的情况":["57.9"],"而":["57.9","94.3"],"规律性的重复操作":["58.2"],"循环":["58.3"],"初始化变量":["58.4"],"条件表达式":["58.4","58.7"],"操作表达式":["58.4"],"但是代码调试这个东西":["58.5"],"自己不去练":["58.5"],"永远都学不会":["58.5"],"重复执行相同代码":["58.5"],"基本写法":["58.5"],"i":["58.5","58.11","69.5"],"循环语句我们称之为双重for循环":["58.6"],"循环体代码":["58.7"],"然后对条件表达式进行判断":["58.8"],"如果条件为真":["58.8"],"就会重复执行循环体":["58.8"],"否则退出循环":["58.8"],"100之间":["58.10"],"除了能被7整除之外的整数和":["58.10"],"sum":["58.10","62.4","62.9","85.11","86.15"],"变量的名称一般用名词":["59.1"],"在数组中可以存放任意类型的元素":["60.1"],"创建空的数组":["60.3"],"利用数组字面量创建数组":["60.3"],"数组名":["60.6"],"的形式来获取数组中中元素":["60.6"],"这里的访问就是获取的意思":["60.6"],"如果超出访问的个数":["60.6"],"坦言":["60.7"],"往前":["60.7"],"趣味无穷":["60.7"],"可以通过修改length长度来实现数组扩容的目的":["60.9"],"对象是用于构造数组的全局对象":["61.1"],"数组是类似于列表的高阶对象":["61.1"],"defineproperty":["61.2"],"obj":["61.2","65.8","92.2"],"prop":["61.2","118.1"],"descriptor":["61.2"],"要定义属性的对象":["61.2"],"要定义或修改的属性的名称":["61.2"],"要定义或修改的值":["61.2"],"输出后如下":["61.3"],"构造函数创建数组":["61.4"],"this":["61.6","65.6","65.7","85.6","86.9","86.10","87.1","87.2","115.6","116.1"],"res1":["61.7"],"通过此代码块可以实现大量代码的重复使用":["62.1"],"函数的封装是把一个或者多个功能通过函数的方式封装起来":["62.5"],"实参":["62.7"],"形式上的参数":["62.7"],"结果为nan":["62.9"],"注意":["62.11","68.1","80.5"],"后的代码不执行":["62.11"],"alert":["62.11","122.5"],"我不会被执行":["62.11"],"因为前面有":["62.11"],"resnum":["62.11"],"结束当前的循环体":["62.12"],"对象":["62.13"],"对象中存储了传递的所有实参":["62.13"],"arguments展示形式是一个伪数组":["62.13"],"因此可以进行遍历":["62.13"],"伪数组具有以下特点":["62.13"],"对数组进行冒泡排序":["62.14"],"getarr":["62.14"],"j":["62.14"],"函数表达式":["62.15"],"而限定这个名字的":["63.1"],"整个script标签或者是一个单独的js文件":["63.2"],"函数作用域":["63.3"],"fun":["63.5"],"在局部作用域下的变量":["63.6"],"全局变量":["63.7","65.9"],"fn":["63.7","122.4"],"es6新增":["63.8"],"写在函数内部叫做局部作用域":["63.9"],"如果函数中还有函数":["63.9"],"预解析和代码执行":["64.1"],"函数提升":["64.2","65.9"],"不提升赋值操作":["64.3"],"局部变量提升":["64.4"],"作用域链原则":["64.4"],"执行该变量":["64.4"],"执行结果":["64.4"],"undefined":["64.4"],"案例二":["64.4"],"函数等":["65.1"],"对象由属性和方法组成的":["65.1"],"uname":["65.3"],"张三丰":["65.3"],"sex":["65.3"],"男":["65.3"],"sayhi":["65.3"],"变量":["65.4"],"单独声明并赋值":["65.4"],"使用的时候直接写变量名":["65.4"],"创建一个空对象":["65.5"],"声明构造函数":["65.6"],"构造函数名":["65.6"],"方法":["65.6","78.6","78.11","98.5"],"让":["65.7"],"pink":["65.8","69.8"],"遍历下面对象":["65.9"],"dog":["65.9","95.3"],"dname":["65.9"],"coco":["65.9"],"阿拉斯加犬":["65.9"],"5岁":["65.9"],"棕红色":["65.9"],"遍历对象":["65.9"],"k":["65.9","92.3"],"请描述下面代码的输出结果以及运行原因":["65.9"],"demo":["65.9"],"demoson":["65.9"],"变量提升":["65.9"],"局部变量":["65.9"],"作用域链":["65.9"],"变量定义":["65.9"],"所以我们不需要new来调用":["66.0"],"random":["66.1"],"返回一个浮点数":["66.1"],"伪随机数在范围从":["66.1"],"0到":["66.1"],"小于1":["66.1"],"从0":["66.1"],"包括0":["66.1"],"往上":["66.1"],"但是不包括1":["66.1"],"排除1":["66.1"],"round":["66.1"],"返回一个数字四舍五入后最接近的整数":["66.1"],"ceil":["66.2"],"程序随机生成一个":["66.3"],"之间的数字":["66.3"],"并让用户输入一个数字":["66.3"],"如果大于该数字":["66.3"],"就提示":["66.3"],"数字大了":["66.3"],"继续猜":["66.3"],"如果小于该数字":["66.3"],"就提示数字小了":["66.3"],"如果等于该数字":["66.3"],"date1":["67.1"],"世界标准时间":["67.3"],"起的毫秒数":["67.3"],"countdown":["67.5"],"time":["67.5"],"nowtime":["67.5"],"返回当前时间":["67.5"],"inputtime":["67.5"],"返回用户输入时间总毫秒数":["67.5"],"times":["67.5"],"在后面添加元素":["68.3"],"调用":["68.3"],"调用并返回值":["68.3"],"unshift在数组开头添加元素":["68.3"],"arr1":["68.3","68.7"],"反转数组":["68.4"],"arr":["68.4"],"景德":["68.5"],"高卷林":["68.5"],"刘益凡":["68.5"],"赵娜":["68.5"],"陈章鸣":["68.5"],"张荣召":["68.5"],"赵凯旋":["68.5"],"程倩倩":["68.5"],"脱朝平":["68.5"],"刘吉利":["68.5"],"郭苗苗":["68.5"],"马建峰":["68.5"],"潘瑞":["68.5"],"闫翔":["68.5"],"马晨":["68.5"],"李轩轩":["68.5"],"黄红梅":["68.5"],"刘书彬":["68.5"],"罗强":["68.5"],"刘东":["68.5"],"王可可":["68.5"],"陈泽文":["68.5"],"李嘉琪":["68.5"],"段佳琦":["68.5"],"黄燕":["68.5"],"邱淑鸿":["68.5"],"宋翔宇":["68.5"],"王波":["68.5"],"tostring":["68.6"],"b":["68.7","69.7","95.2"],"arr3":["68.7"],"输出4":["69.1"],"基本包装类型":["69.1"],"string":["69.2","70.1"],"占用大量内存":["69.3"],"str":["69.3","98.3","98.4","104.4"],"从索引号从3的位置开始查找":["69.4"],"查找字符串":["69.4"],"abcoefoxyozzopp":["69.4","69.7"],"中所有o出现的位置及次数":["69.4"],"遍历所有的字符":["69.5"],"end":["69.6"],"从star位置开始":["69.6"],"截取到end位置":["69.6"],"end取不到":["69.6"],"都是索引号":["69.6"],"substring":["69.6"],"只能替换第一个字符":["69.7"],"有一个字符串":["69.7"],"替换所有":["69.7"],"o":["69.7","87.1"],"str1":["69.7"],"ki":["69.8"],"在存储时变量中存储的是值本身":["70.1"],"因此叫做值类型":["70.1"],"number":["70.1","70.3"],"简单数据类型存放在栈里面":["70.2"],"堆":["70.2"],"系统对象":["70.4"],"自定义对象":["70.4"],"其实是把变量在栈空间里的值复制了一份给形参":["70.5"],"其实是把变量在栈空间里保存的堆地址复制给了形参":["70.6"],"web":["71.1","81.3"],"的信息":["71.1"],"包括":["71.1"],"dom":["72.1","76.19"],"是":["72.1"],"w3c":["72.1","78.3"],"dom中使用document表示":["72.2"],"应是等你好久":["73.2"],"根据指定选择器返回第一个元素对象":["73.3"],"body":["73.5","75.8","76.6","76.14","78.10","78.22","91.4"],"documentelement":["73.6"],"侦测到的行为":["74.1"],"onmouseover":["74.4","78.23"],"鼠标经过触发":["74.4","78.23"],"onmouseout":["74.4","78.23"],"我们可以利用dom操作元素来改变元素里面的内容":["75.0"],"非标准":["75.1"],"classname":["75.2"],"类名样式操作":["75.2"],"给一个颜色":["75.4"],"有些数据可以保存到页面中而不用保存到数据库中":["75.9"],"dataset":["75.11"],"getelementsbytagname":["76.0"],"树中的所有节点均可通过":["76.1"],"进行访问":["76.1"],"所有":["76.1"],"节点":["76.1","76.19"],"我是div":["76.3","76.14"],"我是span":["76.3"],"返回值包含了所有的子结点":["76.4"],"包括元素节点":["76.4"],"文本节点等":["76.4"],"如果只想要获得里面的元素节点":["76.4"],"firstchild":["76.5"],"也是包含所有的节点":["76.6"],"ol":["76.6","122.5"],"parentnode":["76.7","76.8","76.9"],"firstelementchild":["76.7"],"lastelementchild":["76.8"],"那么我们如何获取第一个子元素节点或最后一个子元素节点呢":["76.9"],"如果想要第一个子元素节点":["76.9"],"可以使用":["76.9","98.1"],"chilren":["76.9"],"nextsibling":["76.11"],"previoussibling":["76.12"],"node":["76.13"],"nextelementsibling":["76.13"],"tagname":["76.15"],"末尾":["76.16"],"meta":["76.17","100.4","101.1","104.2"],"charset":["76.17","100.4","103.1","104.2"],"utf":["76.17","100.4","103.1","104.2"],"方法返回调用该方法的节点的一个副本":["76.18"],"也称为克隆节点":["76.18"],"但是文档流执行完毕":["76.19"],"则它会导致页面全部重绘":["76.19"],"是将内容写入某个":["76.19"],"document":["77.1","85.12"],"appendchild":["77.2"],"removechild":["77.3"],"href":["77.4"],"古老用法":["77.5"],"setattribute":["77.6"],"设置dom的属性值":["77.6"],"能够说出dom事件流的三个阶段":["78.1"],"标准推荐方式":["78.3"],"listener":["78.4","78.13"],"usecapture":["78.4","78.13"],"该方法接收三个参数":["78.4"],"目标对象":["78.5"],"上":["78.5"],"当该对象触发指定的事件时":["78.5"],"判断当前浏览器是否支持":["78.6"],"事件类型字符串":["78.8"],"比如click":["78.8"],"eventnamewithon":["78.9"],"callback":["78.9"],"事件删除示例":["78.10"],"20220419205212557":["78.12"],"事件冒泡":["78.12"],"ie":["78.12"],"最早提出":["78.12"],"事件开始时由最具体的元素接收":["78.12"],"第三个参数如果是":["78.13"],"true":["78.13"],"表示在事件捕":["78.13"],"获阶段调用事件处理程序":["78.13"],"如果是":["78.13"],"不写默认就是false":["78.13"],"class":["78.14"],"ie6":["78.17"],"返回事件的类型":["78.18"],"比如":["78.18","78.26","93.3"],"click":["78.18","122.6","122.8"],"mouseover":["78.18","122.2"],"不带on":["78.18"],"http":["78.19","82.1"],"www":["78.19","82.1"],"baidu":["78.19","82.2"],"com":["78.19","82.2","123.3"],"需要我们灵活掌握":["78.20"],"标准写法":["78.20"],"e":["78.20"],"stoppropagation":["78.20","78.21"],"然后利用冒泡原理影响设置每个子节点":["78.22"],"ul":["78.22","115.2","115.5"],"selectstart":["78.24"],"返回鼠标相对于浏览器窗口":["78.25"],"可视区":["78.25"],"的x坐标":["78.25"],"clienty":["78.25"],"但是它不识别功能键":["78.26"],"值的ascii值":["78.27"],"onkeydown":["78.27"],"和":["78.27","111.5"],"onkeyup":["78.27"],"并且每个对象都提供了很多方法与属性":["79.1"],"缺乏标准":["79.1"],"语法的标准化组织是":["79.1"],"定义在全局作用域中的变量":["79.2"],"函数都会变成":["79.2"],"对象的属性和方法":["79.2"],"在调用的时候可以省略":["79.2"],"前面学习的对话框都属于":["79.2"],"或者":["80.1","80.3"],"addeventlistener":["80.1"],"load":["80.1"],"图片":["80.2"],"flash":["80.2"],"settimeout":["80.4"],"延迟的毫秒数":["80.5"],"window可以省略":["80.5"],"这个调用函数":["80.5"],"可以直接写函数":["80.5"],"window":["80.6","80.7","89.3"],"全局作用域或者普通函数中this指向全局对象window":["80.8"],"注意定时器里面的this指向window":["80.8"],"这门脚本语言诞生的使命所致":["81.1"],"是为处理页面中用户的交互":["81.1"],"以及操作":["81.1"],"提出":["81.3"],"worker":["81.3"],"放入任务队列中":["81.5"],"一旦执行栈中的所有同步任务执行完毕":["81.5"],"系统就会按次序读取任务队列中的异步任务":["81.5"],"于是被读取的异步任务结束等待状态":["81.5"],"进入执行栈":["81.5"],"开始执行":["81.5"],"20230415022138496":["81.5"],"此时再来看我们刚才的问题":["81.5"],"location":["82.0"],"属性用于获取或者设置窗体的url":["82.0"],"path":["82.1"],"query":["82.1"],"fragment":["82.1"],"itcast":["82.1"],"cn":["82.1"],"index":["82.1"],"port":["82.2"],"返回端口号":["82.2"],"如果未写返回空字符串":["82.2"],"replace":["82.3","104.4"],"替换当前页面":["82.3"],"我们就跳转到":["83.0"],"端的页面":["83.0"],"如果是用手机打开的":["83.0"],"就跳转到手机端页面":["83.0"],"history对象方法":["84.0"],"back":["84.0"],"可以后退功能":["84.0"],"forward":["84.0"],"programming":["85.1"],"面向对象的特性":["85.2"],"封装性":["85.2"],"把普通的对象进行封装":["85.2"],"所有事物都是对象":["85.3"],"对象由属性和方法组成":["85.3"],"可以使用class关键字声明一个类":["85.4"],"money":["85.8"],"son":["85.9","87.3"],"extends":["85.9"],"btn":["85.12"],"queryselector":["85.12"],"sing":["85.12","86.10"],"不用加":["85.12"],"对象就是类的实例":["86.1"],"es6":["86.1"],"不能通过构造函数来访问实例成员":["86.3"],"构造函数原型对象prototype里面有constructor指向构造函数本身":["86.6"],"每创建一个新对象":["86.7"],"就会开辟一个内存空间存放同一个方法":["86.7"],"这样所有对象的实例就可以共享这些方法":["86.8"],"对象可以调用原型方法":["86.8"],"star":["86.8","86.9"],"原型":["86.12"],"指向原型对象":["86.12"],"对象自身":["86.13"],"有没有属性":["86.13"],"里面this指向的是对象实例":["86.14"],"array":["86.15"],"prototype":["86.15"],"构造函数":["87.0","89.2"],"指向window":["87.1"],"调用函数本身":["87.1"],"this指向父构造函数的对象实例":["87.2"],"score":["87.3"],"this指向子构造函数的对象实例":["87.3"],"call":["87.3"],"类的特点":["87.4"],"类有原型对象prototype":["87.4"],"有两种方法可以实现同样的功能":["87.5"],"方法创建一个新数组":["88.1"],"新数组中的元素是通过检查指定数组中符合条件的所有元素":["88.1"],"主要用于筛选数组":["88.1"],"注意它直接返回一个新数组":["88.1"],"方法并不影响原字符串本身":["88.2"],"需要定义或修改的属性的名字":["88.3"],"目标属性所拥有的特性":["88.3"],"调用方式":["89.3"],"this指向":["89.3"],"普通函数调用":["89.3"],"bind":["89.4"],"arg1":["89.5","89.7"],"arg2":["89.5","89.7"],"thisarg":["89.6","89.7"],"argsarray":["89.6"],"并且改变函数内部this指向":["89.8"],"call和apply传递的参数不一样":["89.8"],"严格模式在ie10以上版本的浏览器中才会被支持":["90.1"],"旧版本浏览器中会被忽略":["90.1"],"严格模式对正常的javascript语义做了一些更改":["90.1"],"个别函数":["90.2"],"use":["90.3"],"strict":["90.3"],"严格模式禁止这种用法":["90.6"],"变量都必须先用var命令声明":["90.6"],"以前构造函数时不加new也可以调用":["90.7"],"当普通函数":["90.7"],"this指向全局对象":["90.7"],"新版本的javascript会引入":["90.8"],"块级作用域":["90.8"],"es6中已引入":["90.8"],"20230415025333994":["90.9"],"函数内部可以使用全局变量":["91.1"],"指有权访问另一个函数作用域中变量的函数":["91.2"],"javascript高级程序设计":["91.2"],"找到":["91.3"],"scope":["91.3"],"选项":["91.3"],"li":["91.5","115.2"],"榴莲":["91.5"],"price":["91.6"],"正常价":["91.6"],"tofixed":["91.6"],"total":["92.0"],"fn1":["92.0"],"es6新增方法可以浅拷贝":["92.2"],"newobj":["92.3"],"oldobj":["92.3"],"判断属性值属于那种类型":["92.3"],"获取属性值":["92.3"],"正则表达式也是对象":["93.2"],"正则表通常被用来检索":["93.2"],"替换那些符合某个模式":["93.2"],"对于刚接触的人来说":["93.3"],"比较晦涩难懂":["93.3"],"w":["93.3","93.16"],"通过调用regexp对象的构造函数创建":["93.5"],"该对象会返回true或false":["93.6"],"c":["93.7","95.2"],"其中特殊字符也被称为":["93.7"],"元字符":["93.7"],"rg":["93.8"],"abc":["93.8"],"正则表达式里面不需要加引号":["93.8"],"不管是数字型还是字符串型":["93.8"],"只要包含有abc这个字符串返回的都是true":["93.8"],"所有可供选择的字符都放在方括号内":["93.9"],"test":["93.10"],"范围":["93.11"],"这里表示":["93.11"],"重复一次或更多次":["93.12"],"重复零次或一次":["93.12"],"用户名只能为英文字母":["93.14"],"数字":["93.14"],"下划线或者短横线组成":["93.14"],"并且用户名长度为":["93.14"],"16位":["93.14"],"reg":["93.15"],"匹配任意的字母":["93.16"],"数字和下划线":["93.16"],"replacement":["93.18"],"第一个参数是被替换的字符串":["93.18"],"第二个参数的替换成的字符串":["93.18"],"返回替换完毕的字符串":["93.18"],"按照什么样的模式来匹配":["93.19"],"ecmascript是由ecma国际通过ecma":["94.2"],"制定了语言的基本语法":["94.4"],"第2版":["94.4"],"1998年":["94.4"],"较小改动":["94.4"],"第3版":["94.4"],"1999年":["94.4"],"引入正则":["94.4"],"异常处理":["94.4"],"格式化输出等":["94.4"],"ie开始支持":["94.4"],"第4版":["94.4"],"committee":["94.5"],"是推进":["94.5"],"es6的版本变动内容最多":["94.6"],"具有里程碑意义":["94.6"],"查看网址":["94.7"],"不允许重复声明":["95.1","96.1"],"狗":["95.3"],"let":["95.4","105.0","108.6"],"cat":["95.4"],"很简单":["95.7"],"就是代码块内有代码块":["95.7"],"跟常规编程语言一样":["95.7"],"device":["95.8"],"initial":["95.8"],"scale":["95.8"],"值不允许修改":["96.1"],"对数组元素的修改和对对象内部的修改是可以的":["96.1"],"特点":["98.1"],"字符串中可以出现换行符":["98.1"],"xxx":["98.1"],"const":["98.3","103.6","110.2"],"hello":["98.3"],"xy":["98.4"],"转为数组":["98.5"],"size":["98.5"],"doctype":["99.1","100.3"],"箭头函数提供了一种更加简介的函数书写方式":["100.1"],"函数体如果只有一条语句":["100.2"],"不能使用arguments变量":["100.3"],"将一个数组转换为用逗号隔开的参数序列":["103.0"],"对数组进行解包":["103.0"],"zha":["103.4"],"ary":["103.5"],"是一种类似于字符串的数据类型":["104.1"],"详解symbol":["104.1"],"lang":["104.2"],"en":["104.2"],"match":["104.4"],"当执行":["104.4"],"myobject":["104.4"],"如果该属性存在":["104.4"],"会调用它":["104.4"],"返回该方法的返回值":["104.4"],"当该对象被":["104.4"],"方法调用时":["104.4"],"iterator":["105.0"],"of循环":["106.1"],"iterator接口主要供for":["106.1"],"of消费":["106.1"],"语法上":["107.0"],"是一个构造函数":["107.0"],"js":["108.1"],"遵循了":["108.1"],"commonjs":["108.1","108.2"],"cmd":["108.2"],"等模块化规范":["108.2"],"但是":["108.2"],"它的出现极大的降低了前端开发者的模块化学":["108.3"],"习成本":["108.3"],"开发者不需再额外学习":["108.3"],"amd":["108.3"],"若想基于":["108.4"],"体验与学习":["108.4"],"的模块化主要包含如下":["108.5"],"n1":["108.6"],"m1":["108.7"],"from":["108.7","109.6","109.11","110.2","110.3"],"每个模块中":["108.8"],"默认导入时的接收名称可以任意名称":["108.9"],"按需导出的成员":["108.10"],"每个模块中可以使用多次按需导出":["108.12"],"按需导入的成员名称必须和按需导出的名称保持一致":["108.12"],"此时":["108.13"],"延时1秒后输出":["109.1"],"异步操作":["109.3","110.1"],"prototype上包含一个":["109.3"],"形成回调地狱":["109.4"],"模块仅支持以回调函数的方式读取文件":["109.5"],"不支持":["109.5"],"promise":["109.5","109.7","110.1"],"异步操作指定成功和失败之后的回调函数":["109.6"],"示例代码如下":["109.6","109.12"],"import":["109.6","109.10","109.11","109.12","110.3"],"thenfs":["109.6","109.10","109.11","110.2","110.3"],"方法中返回了一个新的":["109.7"],"readfile":["109.8"],"files":["109.8"],"txt":["109.8"],"r2":["109.9"],"等待机制":["109.10"],"该方法可以等待所有的异步操作执行完毕后":["109.10"],"再去执行":["109.10"],"then方法":["109.10"],"赛跑机制":["109.11"],"指定的成功和失败的回调函数":["109.12"],"可以在":["109.12"],"的形参中进行接收":["109.12"],"20220519003658574":["109.12"],"引入的新语法":["110.1"],"用来简化":["110.1"],"then":["110.2","110.3"],"fs":["110.2","110.3"],"getallfile":["110.2"],"20220519005834390":["110.3"],"也就是说":["111.1"],"同一时间只能做一件事情":["111.1"],"同步任务":["111.2"],"synchronous":["111.2"],"又叫做":["111.2"],"主线程次序执行":["111.3"],"异步任务委托给宿主环境执行":["111.3"],"任务队列":["111.4"],"宏任务":["112.1"],"macrotask":["112.1"],"异步ajax请求":["112.1"],"每一个宏任务执行完之后":["112.2"],"先执行所有的同步任务":["112.3"],"执行第":["112.3"],"截取成了左中右":["112.4"],"方法和函数":["113.1"],"从封装一大堆函数的角度理解库":["113.1"],"就是在这个库中":["113.1"],"封装了很多预先定义好的函数在里面":["113.1"],"more":["113.2"],"即倡导写更少的代码":["113.2"],"做更多的事情":["113.2"],"基本兼容现在主流的浏览器":["113.3"],"链式编程":["113.3"],"隐式迭代":["113.3"],"1x":["114.0"],"兼容ie678等低版本浏览器":["114.0"],"ready":["114.1"],"但一般为了方便":["114.2"],"jquery方法获取的对象就是jquery对象":["114.3"],"dom对象转换为jquery对象":["114.4"],"但要加引号":["115.1"],"使用":["115.2"],"伪数组形式存储":["115.3"],"last":["115.4"],"获取最后一个li元素":["115.4"],"selector":["115.5","122.4"],"相当于":["115.5"],"最近一级":["115.5"],"亲儿子":["115.5"],"逗号分隔":["116.1"],"是设置一组样式":["116.1"],"属性必须加引号":["116.1"],"值如果是数字可以不用跟单位和引号":["116.1"],"addclass":["116.2"],"current":["116.2"],"不影响原先的类名":["116.3"],"optional":["117.1"],"用来指定切换效果":["117.1"],"默认是":["117.1"],"swing":["117.1"],"可用参数":["117.1"],"over":["117.2"],"slideup":["117.3"],"fadeout":["117.4"],"想要修改的样式属性":["117.5"],"就造成多个动画或者效果排队执行":["117.7"],"方法用于停止动画或效果":["117.8"],"获取属性语法":["118.1"],"一旦页面刷新":["118.3"],"之前存放的数据都将被移除":["118.3"],"获取元素内容":["119.1"],"没有标签":["119.2"],"获取内容":["119.3"],"domele是":["120.1"],"每一个dom元素对象":["120.1"],"不是jquery对象":["120.1"],"所以要想使用jquery方法":["120.1"],"需要给这个dom元素转换为jquery对象":["120.1"],"第一个参数index可以自己指定字符":["120.1"],"放在匹配元素的最后面":["120.3"],"类似于appendchild":["120.3"],"删除匹配的元素本身":["120.4"],"innerwidth":["121.1"],"innerheight":["121.1"],"取得匹配元素的宽度和高度值":["121.1"],"包含padding":["121.1"],"文档":["121.2"],"的偏移坐标":["121.2"],"跟父级没有关系":["121.2"],"不受定位影响":["121.2"],"其他事件和原生基本一致":["122.2"],"event":["122.4"],"第一种自动调用函数":["122.7"],"第二种自动触发":["122.8"],"target":["123.1"],"object1":["123.1"],"objectn":["123.1"],"如果设置为true为深拷贝":["123.1"],"这样一起使用会引起冲突":["123.2"],"需要一个解决方案":["123.2"],"jq22":["123.3"],"当我们页面滑动到可视区域":["123.4"],"trigo":["123.5"],"create":["123.5"],"full":["123.5"],"screen":["123.5"],"选择器基于元素的":["124.0"],"类":["124.0"],"id值是唯一的所以返回单个元素":["124.1"],"选取id为one的元素的下一个":["124.2"],"同辈元素":["124.2"],"等同于":["124.2"],"next":["124.2"],"myclass":["124.3"],"选取class不是myclass的":["124.3"],"even":["124.3"],"选取索引是偶数的":["124.3"],"文本的元素":["124.4"],"empty":["124.4"],"选取所有不可见的":["124.5"],"选取所有的name属性以":["124.6"],"开头的":["124.6"],"父元素下的第2个子元素":["124.7"],"first":["124.7"],"的表单内所有可用元素":["124.8"],"form2":["124.8"],"disabled":["124.8"],"选取所有的单行文本框":["124.9"]},{"0":["25.10","26.8","29.2","57.7","58.10","61.7","65.9","66.1","69.4","86.15","88.1"],"1":["10.0","27.6","27.8","32.18","46.0","56.6","56.7","58.11","60.3","62.8","66.1","67.2","69.1","69.6","78.10","85.9","107.0","109.6","110.2","114.1","122.4"],"2":["22.2","25.0","27.10","32.19","44.1","50.3","55.4","61.6","68.1","77.2","77.4","77.6","81.2","85.9","86.14","87.1","90.1","91.1","91.6","93.17","95.1","103.3","103.4","114.2","114.4","116.2"],"3":["42.2","55.12","61.4","61.6","68.7","86.6","88.1","90.6","108.5","108.12","109.9","111.3","112.4","114.3"],"4":["29.2","56.12","68.7","78.13","89.2","90.7","91.3"],"5":["24.3","43.1","51.2","68.7","78.13","92.0","96.1","103.6"],"6":["68.3","94.7"],"8":["78.17","78.20","92.0","100.4","103.5"],"9":["93.14"],"10":["57.7","91.6","108.6"],"11":["122.5"],"12":["55.11","103.6","112.3"],"13":["92.0"],"18":["64.4","65.8","82.1","85.12","92.2"],"20":["88.1"],"21":["55.11","66.1"],"22":["69.9"],"27":["62.11"],"44":["103.5"],"51":["66.1"],"78":["55.11"],"100":["58.11","62.4","85.8"],"130":["103.5"],"400":["19.0"],"700":["19.0"],"1000":["67.5","81.5"],"1800":["68.4"],"2015":["86.1","109.2"],"2019":["73.1"],"2100":["68.4"],"这些新特性都有兼容性问题":["1.0"],"aside":["2.0"],"侧边栏标签":["2.0"],"footer":["2.0","17.1","17.4"],"video":["3.0"],"如播放按钮等":["3.1"],"height":["3.1","26.8"],"设置高度":["3.1"],"mpeg":["3.2"],"音频不可以":["3.3"],"time":["4.0","73.1"],"限制用户输入必须为时间类型":["4.0"],"month":["4.0","67.2"],"自动聚焦属性":["4.1"],"页面加载完成自动聚焦到指定表单":["4.1"],"autocomplete":["4.1"],"属性且属性值等于val的e元素":["5.1"],"指定类型e的最后一个":["5.2"],"before和after必须有content属性":["5.3"],"before在父元素内容的前面创建元素":["5.3"],"after在父元素内容的后面插入元素":["5.3"],"伪元素选择器和标签选择器一样":["5.3"],"权重为1":["5.3"],"body":["5.4","90.9"],"form":["5.4","78.19"],"action":["5.4"],"type":["5.4","50.1"],"f":["5.5","55.4"],"target":["5.6"],"seo的目的是对网站进行深度的优化":["6.1"],"从而帮助网站获取免费的流量":["6.1"],"尽量不要超过30个汉字":["6.2"],"例如":["6.2","6.3","93.11"],"京东":["6.2"],"html":["6.3","6.4","71.1","72.1","82.1","100.3","103.0"],"meta":["6.3","6.4","30.2","97.1","99.1","102.1"],"name":["6.3","6.4","30.2","65.5","65.6","82.1","92.2","104.2"],"content":["6.4","25.1","25.15","26.9","30.2","76.17","104.2"],"我们链接里面要放文字":["7.0"],"网站名称":["7.0"],"但是文字不要显示出来":["7.0"],"方法1":["7.0"],"或者是屏幕上以多少像素融在一起":["8.1"],"值是100":["8.2"],"图像无变化":["8.3","8.6"],"一值设定图像会被调整的色环角度值":["8.4"],"值为0deg":["8.4"],"设定垂直距离":["8.5"],"负值会使阴影出现在元素上方":["8.5"],"查看":["8.5"],"可能的单位":["8.5"],"如果两个值都是0":["8.5"],"则阴影出现在元素正后面":["8.5"],"如果设置了":["8.5"],"radius":["8.5"],"and":["8.5","56.9","123.5"],"or":["8.5"],"要过渡的属性":["10.0"],"花费时间":["10.0"],"运动曲线":["10.0"],"何时开始":["10.0"],"缩放等效果":["11.0"],"2d转换":["11.1"],"translatex":["11.2","14.1"],"n":["11.2","55.5","93.12"],"重点":["11.3"],"rotate里面跟度数":["11.3"],"可以写方位名词":["11.4"],"y表示倍数":["11.5"],"rotate":["11.6"],"scale":["11.6","76.17","104.2"],"和translatey":["11.7"],"2d旋转rotate":["11.7"],"常用来实现复杂的动画效果":["12.0"],"from":["12.1","109.10","109.12"],"和":["12.1","54.8"],"to":["12.1"],"等同于0":["12.1"],"和100":["12.1"],"timing":["12.2","12.3"],"function":["12.2","12.3","65.3","81.5"],"规定动画的速度曲线":["12.2"],"默认是":["12.2"],"ease":["12.2"],"delay":["12.2","12.3"],"duration":["12.3"],"动画以低速开始":["12.4"],"然后加快":["12.4"],"在结束前变慢":["12.4"],"渐变是多个颜色逐渐变化的视觉效果":["13.0"],"空间":["14.0"],"是从坐标轴角度定义的x":["14.0"],"值":["14.1","25.14","31.6","33.2","75.7","89.5","89.6"],"perspective":["14.2"],"正值往屏幕里面旋转":["14.3"],"要加透视":["14.3"],"答":["14.4","32.8","76.14"],"不能":["14.4"],"perspective只增加近大远小":["14.4"],"scaley":["14.5"],"层叠样式表":["15.1"],"web标准中的表现标准语言":["15.1"],"属性值":["16.1","16.2","26.1","26.4","31.5"],"以文档对象html中的标签作为选择符":["16.2"],"想改变某个元素的默认样式时或同意文档某个元素的显示效果时使用":["16.2"],"css":["16.2","17.9","17.10","30.2","31.1","37.0","71.1"],"标签":["16.2","22.1","44.1"],"属性":["16.2","26.1","75.6","85.3","118.1","118.3","124.0"],"div":["16.2","35.3","75.8","78.10","90.9"],"width":["16.2","76.17","104.2"],"通配符选择器0":["16.3"],"20230414174923306":["16.8"],"滚动":["17.1","17.6"],"scroll":["17.1","17.6","23.5"],"版权":["17.1"],"copyright":["17.1"],"友情链接":["17.1"],"friendlink":["17.1"],"子菜单":["17.1"],"submenu":["17.1"],"end":["17.2"],"main":["17.4"],"页尾":["17.4"],"topnav":["17.5"],"边导航":["17.5"],"sidebar":["17.5"],"按钮":["17.6"],"btn":["17.6"],"标签页":["17.6"],"tab":["17.6"],"文章列表":["17.6"],"red":["17.8","116.1"],"color":["17.8","115.6","116.1"],"如":["17.9","79.2","93.7"],"left":["17.10","20.0"],"barnews":["17.11"],"barproduct":["17.11"],"专栏":["17.12"],"columns":["17.12"],"书签":["18.0"],"f8":["18.0"],"激活列选择功能":["18.0"],"即通常所说的选择竖块文本":["18.0"],"再按一次或按esc键":["18.0"],"取消该功能":["18.0"],"f9":["18.0"],"在光标处插入一域记号":["18.0"],"注意":["18.0","32.15","58.7","79.2","80.1","80.6","117.8"],"直接输入的一对大括号不能作为域记号":["18.0"],"就会使窗口再次最大化":["18.0"],"deltet":["18.0"],"删除光标后面的一个英文单词或一个中文词语":["18.0"],"可反复使用":["18.0"],"退格键":["18.0"],"删除光标前面的一个英文单词或一个中文词语":["18.0"],"enter":["18.0"],"将光标后面的内容快速移到下一页":["18.0"],"快速将光标移到文末":["18.0"],"page":["18.0"],"up":["18.0"],"快速将光标移到文首":["18.0"],"insert":["18.0"],"即按两下insert键":["18.0"],"快速打开或更改":["18.0"],"任务窗格":["18.0"],"到":["18.0"],"剪贴板":["18.0"],"状态":["18.0"],"打开中文输入法的":["18.0"],"在线造词":["18.0"],"快速切换到下标输入状态":["18.0"],"再按一次恢复到正常状态":["18.0"],"快速切换到上标输入状态":["18.0"],"按英文单词或中文词语的间隔向后移动光标":["18.0"],"按英文单词或中文词语的间隔向前移动光标":["18.0"],"文本两端对齐":["18.0"],"文本左对齐":["18.0"],"段落重置":["18.0"],"重复上一操作":["18.0"],"部分操作不适用":["18.0"],"winkey":["18.0"],"这是高手最常用的第一快捷组合键":["18.0"],"这个快捷键组合可以将桌面上的所有窗口瞬间最小化":["18.0"],"无论是聊天的窗口还是游戏的窗口":["18.0"],"hellip":["18.0"],"只要再次按下这个组合键":["18.0"],"刚才的所有窗口都回来了":["18.0"],"而且激活的也正是你最小化之前在使用的窗口":["18.0"],"这个就是winkey":["18.0"],"不用再去移动鼠标点":["18.0"],"开始":["18.0"],"搜索":["18.0"],"文件和文件夹":["18.0"],"了":["18.0"],"在任何状态下":["18.0"],"只要一按winkey":["18.0"],"f就会弹出搜索窗口":["18.0"],"在我们的文章中":["18.0"],"你经常会看到这样的操作提示":["18.0"],"点击":["18.0"],"运行":["18.0"],"其实":["18.0"],"还有一个更简单的办法":["18.0"],"就是按winkey":["18.0"],"如果打开的窗口太多":["18.0"],"这个组合键就非常有用了":["18.0"],"它可以在一个窗口中显示当前打开的所有窗口的名称和图标":["18.0"],"选中自己希望要打开的窗口":["18.0"],"松开这个组合键就可以了":["18.0"],"而alt":["18.0"],"shift键则可以反向显示当前打开的窗口":["18.0"],"对齐文本":["20.0"],"center":["20.0"],"水平居中":["20.0"],"right":["20.0","48.0"],"ul":["21.1","26.0","76.3","122.6"],"li":["21.1","76.3","76.6","78.22"],"文件":["21.2"],"首选项":["21.2"],"以什么方式进行显示":["22.1"],"比如":["22.1","43.2","78.13"],"比较霸道":["22.2"],"自己独占一行":["22.2"],"高度":["22.2"],"宽度":["22.2"],"标签是最典型的行内元素":["22.3"],"有的地方也将行内元素称为内联元素":["22.3"],"行内元素的特点":["22.3"],"转换为块元素":["22.4"],"display":["22.4","26.9","38.2"],"参数":["23.1","23.4","84.0"],"none":["23.2","35.2"],"x":["23.3"],"y":["23.3"],"fixed":["23.5"],"层叠性原则":["24.1"],"恰当地使用继承可以简化代码":["24.2"],"降低css样式的复杂性":["24.2"],"则判断下一位数值":["24.4"],"可以简单记忆法":["24.4"],"通配符和继承权重为0":["24.4"],"thin":["25.4"],"小于默认宽度":["25.4"],"为点线":["25.5"],"否则为实线":["25.5"],"dashed":["25.5"],"bottom":["25.9"],"下内边距":["25.9"],"值的个数":["25.9"],"表达意思":["25.9"],"margin":["25.10"],"auto":["25.10"],"常见的写法":["25.10"],"以下三种都可以":["25.10"],"取两个值中的较大者这种现象被称为相邻块元索垂直外边距的合并":["25.11"],"解决方案":["25.11"],"尽量只给一个盒子添加margin值":["25.11"],"image":["25.11","32.3","32.9","32.12","32.14","32.16","55.10","61.3","109.4","111.1","115.1"],"20230414184932771":["25.11"],"20230414185035850":["25.12"],"必需":["25.13"],"水平阴影的位置":["25.13"],"允许负值":["25.13"],"描述":["25.14","33.2"],"盒子大小不包括margin和padding":["25.15"],"即内外边距会使盒子变大":["25.15"],"h1":["26.0"],"h6":["26.0"],"ol":["26.0"],"浮动的元素会具有行内块元素的特性":["26.2"],"设置了浮动":["26.2"],"一个元素浮动了":["26.3"],"clear":["26.4"],"父级添加overflow属性":["26.5"],"both":["26.6"],"注意是给父元素添加代码":["26.7"],"block":["26.8"],"通俗易懂":["26.10"],"书写方便":["26.10"],"添加许多无意义的标签":["26.10"],"结构化较差":["26.10"],"所以定位也是在摆放盒子":["27.0"],"按照定位的方式移动盒子":["27.0"],"static":["27.2"],"静态定位":["27.2"],"底部偏移量":["27.3"],"静态定位按照标准流特性摆放位置":["27.5"],"它是相对于自己原来的位置来移动的":["27.6"],"没有祖先元素":["27.7"],"或者":["27.7"],"以浏览器的可视窗口为参照点移动元素":["27.8"],"的一半位置":["27.9"],"固定定位特点":["27.10"],"选择器":["27.12","73.3"],"可以直接设置高度和宽度":["27.14"],"元素的都不会触发外边距合并的问题":["27.15"],"只会压住它下面标准流的盒子":["27.16"],"会重新出现":["28.0"],"对象必须和":["28.1"],"after及":["28.1"],"before":["28.1"],"伪元素一起使用":["28.1"],"table":["28.1"],"将表格显示为无前后换行的内联对象或内联容器":["28.1"],"list":["28.1"],"item":["28.1","92.3"],"继承上一个父对象的可见性":["28.2"],"假如显式声明此默认值":["28.3"],"对象将被剪切为包含对象的window或frame的大小":["28.3"],"并且clip属性设置将失效":["28.3"],"字体图标的引入":["29.1"],"引入到我们html页面中":["29.1"],"字体图标的追加":["29.1"],"以后添加新的小图标":["29.1"],"svg":["29.2"],"格式":["29.2"],"svg字体是基于svg字体渲染的一":["29.2"],"种格式":["29.2"],"支持这种字体的浏览器有chrome4":["29.2"],"逻辑分辨率":["30.1"],"是由软件":["30.1"],"驱动":["30.1"],"默认网页宽度是980px":["30.2"],"viewport":["30.2","76.17","104.2"],"二倍图一般指750像素宽度的图片":["30.3"],"设备宽度375px产出设计稿":["30.4"],"效果":["30.5"],"避免浮动脱标的问题":["31.2"],"视觉效果":["31.3"],"子级一行排列":["31.3"],"水平排列":["31.3"],"start":["31.4","31.5"],"默认值":["31.4","31.7"],"起点开始依次排列":["31.4"],"作用":["31.5"],"flex":["31.5"],"行":["31.7","112.3"],"水平":["31.7"],"column":["31.7"],"但是以相反的顺序":["31.8"],"initial":["31.8","76.17","104.2"],"vh":["32.0"],"高度固定":["32.2"],"适配方案":["32.2"],"20230415002109528":["32.3"],"使用媒体查询":["32.3"],"确定设计稿对应的设备的html标签字号":["32.4"],"查看设计稿宽度":["32.4"],"确定参考设备宽度":["32.4"],"only":["32.5"],"核心原理就是根据不同的视口宽度给网页中html根节点设置不同的font":["32.6"],"使css具备一定的逻辑性":["32.7"],"块注释":["32.10"],"50px":["32.11"],"20220409171230186":["32.12"],"语法":["32.13"],"定义变量":["32.13"],"添加代码":["32.15"],"必须是双引号":["32.15"],"1vw":["32.18"],"media":["33.0"],"768px":["33.0"],"关键词":["33.1"],"屏幕":["33.2"],"视口最大宽或高":["33.3"],"max":["33.3","65.9"],"font":["34.0"],"以便提高更好的用户体验":["35.0"],"default":["35.1"],"小白":["35.1"],"样式之后":["35.2"],"给图片添加vertical":["36.0"],"align":["36.0","48.0"],"baseline":["37.0"],"nowrap":["38.1"],"默认normal自动换行":["38.1"],"webkit":["38.2"],"box":["38.2","73.3"],"鼠标选定后":["39.1"],"边框显示":["39.1"],"22px":["39.4"],"8px":["39.4"],"这里我们以京东css初始化代码为例":["40.0"],"unicode编码字体":["40.0"],"把中文字体的名称用相应的unicode编码来代替":["40.0"],"如有必要":["41.0"],"将拉伸或者挤压物体以适应该对象":["41.0"],"contain":["41.0"],"为了有效地减少服务器接收和发送请求的次数":["42.1"],"提高页面的加载速度":["42.1"],"移动背景图片位置":["42.2"],"此时可以使用background":["42.2"],"欧洲电脑场商联合会":["43.1"],"ecma制定了行为":["43.1"],"文档对象模型":["43.1"],"whatwg网页超文本应用技术工作小组是":["43.1"],"一个以推动网络html":["43.1"],"标准为目的而成立的组织":["43.1"],"在2004年":["43.1"],"html版本有许多":["43.2"],"html5":["43.2"],"html4":["43.2"],"xhtml":["43.2"],"简单来说":["43.3"],"定义":["43.3"],"en就是英文网页":["43.3"],"redefined":["43.4"],"hbuilderx":["43.4"],"高效极客技巧":["43.4"],"dcloud":["43.4"],"io":["43.4"],"webstorm":["43.4"],"the":["43.4"],"smartest":["43.4"],"javascript":["43.4","58.8","60.6","61.2","69.6","75.2","76.9","78.5","78.24","88.2","90.9","93.18","98.1","116.1"],"ide":["43.4"],"by":["43.4"],"jetbrains":["43.4"],"intellij":["43.4"],"idea":["43.4"],"领先的":["43.4"],"java":["43.4"],"标记的结构":["44.1"],"内容载体":["44.1"],"加粗":["44.2"],"b":["44.2","86.10","93.15","110.3"],"加粗的内容":["44.2"],"strong":["44.2"],"p":["44.3"],"同行显示":["44.3"],"reg":["44.4"],"图片路径":["45.0"],"外部链接":["46.0"],"span":["47.0"],"边框颜色":["48.0"],"bgcolor":["48.0"],"背景颜色":["48.0"],"水平对齐left":["48.0"],"circle空心圆":["49.0"],"数据传输量大":["50.1"],"input":["50.1"],"submit":["50.1"],"input类型":["50.1"],"text":["50.1","119.2"],"文本框":["50.1"],"接受并处理表单数据的服务器":["50.2"],"method":["50.2"],"20230413201359153":["50.3"],"20230413201504050":["50.3"],"select":["50.3"],"上传":["50.4"],"一次编写":["51.1"],"到处运行":["51.1"],"write":["51.1","77.1"],"once":["51.1"],"run":["51.1"],"anywhere":["51.1"],"实现可视化图表":["51.2"],"echarts":["51.2"],"地理定位等功能":["51.2"],"dom":["52.0","78.12","79.1","81.1"],"语句":["52.1"],"getownpropertydescriptors":["52.2"],"和字符串填充方法":["52.2"],"另外明确支持对象字面量最后的逗号":["52.2"],"es9":["52.2"],"异步迭代":["52.2"],"剩余和":["52.2"],"扩展属性":["52.2"],"将整个页面抽象为一组分层节点html":["52.3"],"或":["52.3","108.3"],"页面的每个组成部分都是一种":["52.3"],"节点":["52.3"],"object":["52.4"],"model":["52.4"],"alert":["53.1","78.3","79.2"],"秋香":["53.1"],"在html中我们推荐使用":["53.1"],"双引号":["53.1"],"多行注释":["53.2"],"console":["53.3","55.8","61.6","62.9","65.3","68.4","68.7","69.8","86.9","88.1","91.6","95.4","95.6","109.8"],"log":["53.3","55.8","58.5","61.6","62.9","65.3","68.4","68.7","69.8","86.9","86.10","88.1","91.6","93.8","95.4","95.6","109.8"],"获取数据":["54.2"],"用来声明变量":["54.3"],"variable":["54.3"],"变量的意思":["54.3"],"使用该关键字声明变量后":["54.3"],"var":["54.5","55.12","60.6","62.15","63.5","68.2","69.6","85.9","85.12","86.15","93.18","122.5"],"多个变量名之间使用英文逗号隔开":["54.6"],"undefined":["54.7","65.9","70.1","70.3"],"是两个变量":["54.8"],"不能以数字开头":["54.8"],"18age":["54.8"],"根据":["55.1"],"右边变量值的数据类型来判断":["55.1"],"的":["55.1","124.4"],"false":["55.3"],"等价于1和0":["55.3"],"string":["55.3"],"字符串类型":["55.3"],"对应十进制的19":["55.4"],"num3":["55.4"],"08":["55.4"],"对应十进制的8":["55.4"],"十六进制数字序列范围":["55.4"],"9以及a":["55.4"],"字符串转义符":["55.5"],"符号":["55.5"],"含义":["55.5"],"换行符":["55.5"],"是":["55.5"],"表示真":["55.6"],"对":["55.6"],"而":["55.6"],"vari":["55.8"],"将string类型转成整数数值型":["55.11"],"parsefloat":["55.11"],"将string类型转成浮点数数值型":["55.11"],"number":["55.11","69.2"],"强制转换函数":["55.11"],"将string类型转换成数值型":["55.11"],"return":["55.12","61.2","88.1","109.8","109.12"],"switch":["55.12"],"this":["55.12","86.8","89.5","89.6"],"throw":["55.12"],"try":["55.12"],"typeof":["55.12"],"void":["55.12"],"while":["55.12","58.3","69.4","69.7"],"with":["55.12"],"等":["55.12","76.0","77.4","79.2","93.7"],"是用于实现赋值":["56.1"],"但在进行算术计算时其精确度远远不如整数":["56.3"],"变量等以能求得数值的有意义排列方法所得的组合":["56.4"],"和递减":["56.5"],"既可以放在变量前面":["56.5"],"ture":["56.8"],"大于号":["56.8"],"与":["56.9"],"则返回表达式2":["56.10"],"如果第一个表达式的值为假":["56.10"],"则返回表达式1":["56.10"],"多个表达式":["56.10"],"直接赋值":["56.11"],"先":["56.12"],"后":["56.12"],"流程控制就是来控制我们的代码按照什么结构顺序来执行":["57.1"],"流程控制主要有三种结构":["57.1"],"先后顺序":["57.2"],"执行代码多选一的过程":["57.3"],"if":["57.4","92.3"],"里面代码":["57.5"],"否则执行else":["57.5"],"里面的代码":["57.5"],"语句1":["57.6"],"开关转换":["57.8"],"小例子":["57.8"],"选项":["57.8"],"关键字":["57.8"],"后面":["57.8"],"括号内":["57.8"],"语句更加灵活":["57.9"],"常用于范围判断":["57.9"],"大于":["57.9"],"等于某个范围":["57.9"],"因此在程序中要完成这类操作就需要":["58.2"],"循环体":["58.4"],"通常被用于初始化一个计数器":["58.4"],"该表达式可以使用":["58.4"],"媳妇我错了":["58.5"],"用户输入次数":["58.5"],"num":["58.5","69.4"],"prompt":["58.5","79.2"],"请输入次数":["58.5"],"外循环的初始":["58.6"],"外循环的条件":["58.6"],"要加计数器":["58.7"],"如果不加计数器就会死循环":["58.7"],"循环体代码":["58.8"],"条件表达式为":["58.8"],"for":["58.10","60.7","68.2","69.3"],"i":["58.10","62.4","65.9","68.2","69.4"],"函数的名称一般用动词":["59.1"],"数组是一种将":["60.1"],"使用数组字面量方式创建空的数组":["60.3"],"则显示undefined":["60.6"],"arr1":["60.6","60.10"],"length属性是可读写的":["60.9"],"mdn":["61.0"],"在javascript里面":["61.1"],"所有的方法":["61.1"],"定义某一个对象属性的简单使用":["61.2"],"key":["61.2"],"enumerable":["61.2"],"20220516020042821":["61.3"],"const":["61.6","109.10","109.11","110.3"],"item1":["61.6"],"new":["61.6","85.9","85.12","93.5","109.12"],"res2":["61.7"],"函数名":["62.3","65.9","80.5"],"函数体代码":["62.3"],"对外只提供一个简单的函数接口":["62.5"],"函数定义的时候":["62.7"],"传递参数":["62.7"],"当前并不知道是什么":["62.7"],"实际上的参数":["62.7"],"函数调用的时候传递参数":["62.7"],"调用函数":["62.8"],"num2":["62.9"],"传入两个实参":["62.11"],"并通过":["62.11"],"接收函数返回值":["62.11"],"只能返回一个值":["62.11"],"如果用逗号隔开多个值":["62.11"],"以最后一个为准":["62.11"],"跳出本次循环":["62.12"],"具有length属性":["62.13"],"按索引方式储存数据":["62.13"],"不具有数组的":["62.13"],"push":["62.13"],"pop":["62.13"],"等方法":["62.13"],"temp":["62.14"],"匿名函数":["62.15"],"可用性的代码范围":["63.1"],"在函数内部就是局部作用域":["63.3"],"num1":["63.5"],"只能在函数内部使用":["63.6"],"全局变量在函数内部可以使用":["63.7"],"fun":["63.7"],"aru":["63.7"],"形参属于函数内部的局部变量":["63.7"],"块级作用域":["63.8","95.1","96.1"],"那么在这个作用域里面会新增一个作用域":["63.9"],"输出undefined":["64.4"],"作用域链就近原则":["64.4"],"输出20":["64.4"],"案例三":["64.4"],"a":["64.4","86.10","93.14","93.15","93.16","110.3"],"f1":["64.4"],"事物的特征":["65.1","85.3"],"在对象中用属性来表示":["65.1"],"常用名词":["65.1"],"方法":["65.1","109.3"],"hi":["65.3","78.3"],"里面的属性或者方法我们采取键值对的形式":["65.3"],"键":["65.3"],"单独存在":["65.4"],"在对象里面的称为属性":["65.4"],"不需要声明":["65.4"],"q":["65.5"],"age":["65.5","65.6","82.1","86.8","92.2"],"star":["65.6","85.5"],"sex":["65.6","65.8"],"指向这个新的对象":["65.7"],"男":["65.8"],"输出结果":["65.9"],"请使用arguments完成函数getresult":["65.9"],"实现得到输入的所有的数值中的最小值":["65.9"],"最大值":["65.9"],"平均数":["65.9"],"总和等功能":["65.9"],"作业描述":["65.9"],"getresult":["65.9"],"函数调用方式":["65.9"],"数值1":["65.9"],"数值2":["65.9"],"数值3":["65.9"],"数值4":["65.9"],"函数功能":["65.9"],"返回值是一个对象":["65.9"],"这个对象有sum":["65.9"],"min":["65.9"],"averages等属性":["65.9"],"分别表示实参的总和":["65.9"],"最小值":["65.9"],"平均数等":["65.9"],"sum":["65.9"],"arguments":["65.9","106.1"],"计算sum":["65.9"],"length":["65.9","103.3"],"遍历数组":["65.9"],"存入数值":["65.9"],"计算max":["65.9"],"而是直接使用里面的属性和方法":["66.0"],"sign":["66.1"],"返回一个数字的符号":["66.1"],"指示数字是正数":["66.1"],"负数还是零":["66.1"],"此函数共有5种返回值":["66.1"],"分别是":["66.1"],"nan":["66.1"],"代表的各是":["66.1"],"正数":["66.1"],"负数":["66.1"],"正零":["66.1"],"四舍五入":["66.2"],"5结果为":["66.2"],"其他数字都是四舍五入":["66.2"],"就提示猜对了":["66.3"],"结束程序":["66.3"],"猜数字":["66.3"],"numa":["66.3"],"获取当前时间必须实例化":["67.1"],"now":["67.1"],"2022年4月15日星期五":["67.2"],"year":["67.2"],"dates":["67.2"],"arr":["67.2","69.4"],"星期日":["67.2"],"1970年1月1日为什么作为计算机元年的开始":["67.3"],"gettime":["67.4"],"times是剩余时间总的秒数":["67.5"],"天数":["67.5"],"表示数组长度为2":["68.1"],"true":["68.2","93.10"],"判断是否为数组":["68.2"],"newarr":["68.2","88.1"],"在数组后面删除元素":["68.3"],"返回删除值":["68.3"],"数组翻转":["68.4"],"樊琳":["68.5"],"王兆国":["68.5"],"许成":["68.5"],"李兴":["68.5"],"currentarr":["68.5"],"把数组转换成字符串":["68.6"],"逗号分隔每一项":["68.6"],"合并多个数组":["68.7"],"arr2":["68.7"],"把简单数据类型包装成为了复杂数据类型":["69.1"],"把简单数据类型包装成复杂数据类型":["69.1"],"o":["69.4"],"返回相应索引号的字符ascii值":["69.5"],"判断用户按下了哪个键":["69.5"],"判断一个字符串":["69.5"],"abcoefoxyozzopp":["69.5"],"中出现次数最多的字符":["69.5"],"基本和slice相同":["69.6"],"但是不接受负值":["69.6"],"str":["69.6"],"索引给定元素的第一个索引号":["69.7"],"如果存在则返回索引号":["69.7"],"如果不存在则返回":["69.7"],"indexof":["69.7"],"replace":["69.9"],"g":["69.9"],"boolean":["70.1"],"null":["70.1","70.3"],"存储复杂类型":["70.2"],"对象":["70.2"],"如object":["70.4"],"array":["70.4","92.3","106.1"],"那么在方法内部对形参做任何修改":["70.5"],"形参和实参其实保存的是同一个堆地址":["70.6"],"和万维网及":["71.1"],"查看里面参数的意义和类型":["71.2"],"组织推荐的处理可扩展标记语言":["72.1"],"页面中的所有标签都是元素":["72.2"],"dom中使用element表示":["72.2"],"切记里面的选择器需要加符号":["73.3"],"类选择器":["73.3"],"简单理解":["74.1","91.2"],"触发":["74.1"],"事件类型":["74.2"],"注册事件":["74.3"],"鼠标离开触发":["74.4","78.23"],"onfocus":["74.4","78.23"],"属性等":["75.0"],"element":["75.1"],"innertext":["75.1"],"更改div颜色":["75.2"],"其他颜色复原":["75.4"],"主要设置自定义的属性":["75.7"],"id":["75.8"],"有些自定义属性容易引起歧义":["75.9"],"index":["75.10","115.4"],"ie11才开始支持":["75.11"],"queryselector":["76.0","77.5"],"逻辑性不强":["76.0"],"均可被修改":["76.1"],"也可以创建或删除":["76.1"],"一般的":["76.1"],"节点至少拥有nodetype":["76.1"],"节点类型":["76.1"],"nodename":["76.1"],"我是li":["76.3"],"则需要专门处理":["76.4"],"所以我们一般不提倡使用":["76.4"],"我是li1":["76.6"],"如果想要最后一个子元素节点":["76.9"],"数组元素个数减1":["76.9"],"就是最后一个元素的索引号":["76.9"],"我是span":["76.14"],"如何解决兼容性问题":["76.14"],"方法创建由":["76.15"],"里面的":["76.16"],"after":["76.16"],"伪元素":["76.16"],"device":["76.17","104.2"],"拷贝节点":["76.18"],"如果括号参数为空或者为":["76.18"],"不会导致页面全部重绘":["76.19"],"创建多个元素效率更高":["76.19"],"不要拼接字符串":["76.19"],"采取数组形式拼接":["76.19"],"修改普通元素内容":["77.4"],"h5提供的新方法":["77.5"],"queryselectorall":["77.5"],"能够利用事件对象完成跟随鼠标案例":["78.1"],"addeventlistener":["78.3","80.3"],"事件类型字符串":["78.4","78.9"],"比如click":["78.4"],"mouseover":["78.4","78.8"],"注意这里不要带on":["78.4","78.8"],"事件处理函数":["78.4"],"指定的回调函数就会被执行":["78.5"],"该方法接收两个参数":["78.9"],"然后逐级向上传播到到":["78.12"],"最顶层节点的过程":["78.12"],"事件捕获":["78.12"],"表示在事件冒泡阶段调用事件处理":["78.13"],"程序":["78.13"],"实际开发中我们很少使用事件捕获":["78.13"],"我们更关注事件冒泡":["78.13"],"有些事件是没有冒泡的":["78.13"],"son盒子":["78.14"],"官方解释":["78.16"],"对象代表事件的状态":["78.16"],"比如键盘按键的状态":["78.16"],"鼠标的位置":["78.16"],"鼠标按钮的状态":["78.16"],"中":["78.17","90.2"],"浏览器不会给方法传递参数":["78.17"],"cancelbubble":["78.18"],"该属性阻止冒泡":["78.18"],"returnvalue":["78.18"],"百度":["78.19"],"非标准写法":["78.20"],"ie6":["78.20"],"利用对象事件":["78.20"],"知否知否":["78.22"],"点我应有弹框在手":["78.22"],"禁止鼠标选中":["78.24"],"的y坐标":["78.25"],"pagex":["78.25"],"shift":["78.26"],"箭头等":["78.26"],"如果使用addeventlistener":["78.26"],"不需要加":["78.26"],"不区分字母大小写":["78.27"],"onkeypress":["78.27"],"区分字母大小写":["78.27"],"ecma":["79.1"],"的标准化组织是":["79.1"],"w3c":["79.1"],"bom最初是netscape":["79.1"],"对象方法":["79.2"],"window下的一个特殊属性":["79.2"],"有了window":["80.1"],"onload就可以把js代码写到页面元素的上方":["80.1"],"因为onload是等页面内容全部加载完毕":["80.1"],"再去执行处理函数":["80.1"],"css等":["80.2"],"domcontentloaded":["80.2"],"resize":["80.3"],"setinterval":["80.4","112.1"],"或者写函数名":["80.5"],"或者采取字符串":["80.5"],"不推荐":["80.5"],"timeoutid":["80.6"],"回调函数":["80.7","117.1"],"间隔的毫秒数":["80.7"],"方法调用中谁调用this指向谁":["80.8"],"构造函数中this指向构造函数实例":["80.8"],"而诞生的":["81.1"],"比如我们对某个":["81.1"],"标准":["81.3","108.2"],"允许":["81.3"],"执行的结果和顺序为":["81.5"],"并且可以解析url":["82.0"],"andy":["82.1","92.2","93.10"],"link":["82.1","95.8"],"组成":["82.1"],"pathname":["82.2"],"返回路径":["82.2"],"search":["82.2","104.4"],"因为不记录历史":["82.3"],"所以不能后退页面":["82.3"],"reload":["82.3"],"match":["83.0"],"phone":["83.0"],"pad":["83.0"],"pod":["83.0"],"iphone":["83.0"],"前进功能":["84.0"],"go":["84.0"],"前进后退功能":["84.0"],"面向过程就是分析出解决问题所需要的步骤":["85.1"],"对象的属性设为私有的":["85.2"],"对外提供get和set方法":["85.2"],"其他类只能通过get和set对对象属性值进行操作":["85.2"],"之后以这个类来实例化对象":["85.4"],"创建类的对象":["85.5"],"son":["85.11","87.2"],"extends":["85.11"],"liu":["85.12"],"this指向问题":["85.12"],"constructor里面this指向实例对象":["85.12"],"全称ecmascript":["86.1"],"比如对象的属性值":["86.3"],"构造函数可以通过原型对象添加方法":["86.6"],"函数":["86.7"],"prototype":["86.9"],"sing":["86.9"],"movie":["86.10"],"覆盖掉原来的constructor的属性":["86.10"],"20220428162056152":["86.11"],"starprototype对象里面的":["86.12"],"如果没有就查找它的原型":["86.13"],"也就是":["86.13"],"proto":["86.13"],"原型对象":["87.0"],"修改this指向":["87.1"],"继承方法":["87.3"],"这样直接赋值会有问题":["87.3"],"如果修改了子原型对象":["87.3"],"父原型对象也会跟着变化":["87.3"],"给son的原型创建为father的实例对象":["87.3"],"类的prototype里面有constructor指向类本身":["87.4"],"类可以通过原型对象添加方法":["87.4"],"但是一种写法更加清晰":["87.5"],"value":["88.1","88.3","98.5"],"它返回的是一个新的字符串":["88.2"],"第三个参数descriptor说明":["88.3"],"以对象形式":["88.3"],"书写":["88.3"],"fn":["89.1"],"参数1":["89.1"],"绑定事件函数":["89.2"],"构造函数调用":["89.3"],"实例对象":["89.3","109.7"],"原型对象里面的方法也指向实例对象":["89.3"],"call":["89.4"],"函数运行时指定的":["89.5","89.6"],"在fn函数运行时指定的this的值":["89.7"],"传递的其他参数":["89.7"],"call传递参数aru1":["89.8"],"aru2":["89.8"],"形式":["89.8"],"apply必须数组形式":["89.8"],"消除了javascript语法的一些不合理":["90.1"],"不严谨之处":["90.1"],"减少了一些怪异行为":["90.1"],"因此在使用时":["90.2"],"script":["90.4"],"然后再使用":["90.6"],"严格模式下":["90.7"],"如果构造函数不加new调用":["90.7"],"为了与新版本接轨":["90.8"],"不允许在非函数的代码块内声明函数":["90.8"],"作用域的意思":["91.3"],"当我们重新刷新页面":["91.3"],"会进入断点调试":["91.3"],"臭豆腐":["91.5"],"拥堵后费用":["91.6"],"yd":["91.6"],"flag":["91.6"],"pie":["91.6"],"利用递归函数求斐波拉契数列":["92.0"],"兔子序列":["92.0"],"用户输入一个数字n就可以求出":["92.0"],"这个数字对应的兔子序列值":["92.0"],"我们只需要知道用户输入的n的前面两项":["92.0"],"就可以计算出n":["92.0"],"对应的序列值":["92.0"],"fb":["92.0"],"msg":["92.2"],"判断值是否是数组":["92.3"],"instanceof":["92.3"],"规则":["93.2"],"的文本":["93.2"],"例如验证表单":["93.2"],"变量名":["93.5"],"其参数是测试字符串":["93.6"],"regexobj":["93.6"],"在正则表达式中是具有特殊意义的专用符号":["93.7"],"特殊字符非常多":["93.7"],"test":["93.8"],"26个英文字母都可以":["93.11"],"重复n次":["93.12"],"首先准备好这种正则表达式模式":["93.14"],"za":["93.14","93.16"],"z0":["93.14","93.16"],"abc":["93.15"],"c":["93.15"],"除所有字母":["93.16"],"qq":["93.17"],"替换":["93.18"],"有三种":["93.19"],"manufacturers":["94.1"],"association":["94.1"],"262标准化的脚本程序设计语言":["94.2"],"只是其中的一个":["94.3"],"所有标准列表查看":["94.3"],"2007年":["94.4"],"过于激进":["94.4"],"未发布":["94.4"],"第5版":["94.4"],"2009年":["94.4"],"引入严格模式":["94.4"],"json":["94.4"],"扩展对象":["94.4"],"数组":["94.4"],"原型":["94.4"],"字符串":["94.4"],"日期方法":["94.4"],"ecmascript":["94.5"],"发展的委员会":["94.5"],"其会员都是公司":["94.5"],"es6加入许多新的语法特性":["94.6"],"d":["95.2","111.5"],"批量声明":["95.2"],"猫":["95.4"],"people1":["95.6"],"可输出默认值":["95.6"],"上级代码块中的局部变量下级可用":["95.7"],"let":["95.7","98.3","98.4"],"crossorigin":["95.8"],"anonymous":["95.8"],"href":["95.8"],"https":["95.8"],"cdn":["95.8"],"bootcss":["95.8"],"com":["95.8"],"twitter":["95.8"],"数组和对象存的是引用地址":["96.1"],"局部变量":["96.1"],"head":["97.1","99.1","100.3","102.1"],"charset":["97.1","101.1","102.1"],"形式引用变量":["98.1"],"doctype":["98.1","103.0"],"world":["98.3"],"strtest1":["98.3"],"strrepeat":["98.4"],"add":["98.5"],"添加某一个值":["98.5"],"返回set结构本身":["98.5"],"delete":["98.5"],"删除某一个值":["98.5"],"返回一个布尔值":["98.5"],"表示删除成功":["98.5"],"has":["98.5"],"箭头函数多用于匿名函数的定义":["100.1"],"则花括号可以省略":["100.2"],"函数的返回值为该条语句的执行结果":["100.2"],"title":["100.4","103.1"],"utf":["101.1"],"扩展运算符应用":["103.1"],"ary":["103.6"],"自定义值":["104.1"],"会返回该方法的返回值":["104.4"],"split":["104.4"],"next":["105.0"],"原生具备iterator接口的数据":["106.1"],"可用for":["106.1"],"of遍历":["106.1"],"用来封装异步操作并可以获取其成功或失败的结果":["107.0"],"的模块化规范":["108.1"],"其中":["108.1"],"导入其它模块使用":["108.1"],"这些由社区提出的模块化标准":["108.2"],"还是存在一定的差异性与局限性":["108.2"],"并不是浏览器与服务器通用的模块化":["108.2"],"cmd":["108.3"],"commonjs":["108.3"],"es6":["108.4"],"的模块化语法":["108.4"],"可以按照":["108.4"],"如下两个步骤进行配置":["108.4"],"种用法":["108.5"],"01默认导出":["108.7"],"只允许使用唯一的一次":["108.8"],"只要是合法的成员名称即可":["108.9"],"s2":["108.11"],"say":["108.11"],"按需导入时":["108.12"],"可以直接导入并执行模块代码":["108.13"],"第2层回调函数":["109.1"],"再延时2秒后输出":["109.1"],"then":["109.3"],"每一次创建的构造函数得到的实例对象":["109.3"],"都可以通过原型链的方式访问到":["109.3"],"的调用方式":["109.5"],"因此":["109.5"],"需":["109.5"],"要先运行如下的命令":["109.5"],"files":["109.6","109.11","110.2"],"txt":["109.6","110.2"],"utf8":["109.6"],"则可以通过下一个":["109.7"],"r1":["109.8","110.2","110.3"],"r3":["109.9"],"err":["109.9"],"message":["109.9"],"fs":["109.10","109.11","109.12"],"promisearr":["109.10","109.11"],"readfile":["109.11","110.2"],"在":["110.1"],"出":["110.1"],"getallfile":["110.3"],"非耗时任务":["111.2"],"指的是主线程上排队执行的那些任务":["111.2"],"只有前一个任务执行完毕":["111.2"],"已完成的异步任务对应的回调函数":["111.3"],"会被":["111.3"],"中读取异步任务的回调函数":["111.4"],"属于":["111.5"],"settimeout":["112.1"],"文件操作":["112.1"],"都会检查是否存在待执行的微任务":["112.2"],"第":["112.3"],"比如动画animate":["113.1"],"hide":["113.1","117.1"],"show":["113.1"],"j就是javascript":["113.2"],"query查询":["113.2"],"意思就是查询js":["113.2"],"对事件":["113.3"],"样式":["113.3"],"官网不再更新":["114.0"],"等着dom结构渲染完毕即可执行内部代码":["114.1"],"不必等到所有外部资源加载完成":["114.1"],"通常都直接使用":["114.2"],"jquery对象转换为dom对象":["114.4"],"号":["115.2"],"获取亲儿子层级的元素":["115.2"],"的过程就叫做隐式迭代":["115.3"],"eq":["115.4"],"find":["115.5"],"后代选择器":["115.5"],"移除类":["116.2"],"linear":["117.1"],"在动画完成时执行的函数":["117.1"],"每个元素执行一次":["117.1"],"out":["117.2"],"上滑":["117.3"],"淡出":["117.4"],"以对象形式传递":["117.5"],"必须写":["117.5"],"属性名可以不用带引号":["117.5"],"第二个参数是dom元素对象":["120.1"],"需要转换成jquery对象":["120.1"],"prepend":["120.3"],"放在匹配元素的最前面":["120.3"],"outerwidth":["121.1"],"outerheight":["121.1"],"该方法有2个属性left":["121.2"],"top":["121.2"],"top用于获取距离文档顶部的距离":["121.2"],"left用于获取距离文档左侧的距离":["121.2"],"mouseout":["122.2"],"blur":["122.2"],"events":["122.4"],"一个或多个用空格分隔事件类型":["122.4"],"qeqw":["122.5"],"解除所有事件":["122.6"],"input有光标":["122.8"],"会触发默认行为":["122.8"],"回调函数里面的event就是事件对象":["122.9"],"阻止默认行为":["122.9"],"默认为false浅拷贝":["123.1"],"要拷贝的对象":["123.1"],"让jquery和其他的js库不存在冲突":["123.2"],"可以同时存在":["123.2"],"jquery之家":["123.3"],"再显示图片":["123.4"],"pages":["123.5"],"fast":["123.5"],"类型":["124.0"],"属性值等":["124.0"],"选择所有的div标签元素":["124.1"],"返回div元素数组":["124.1"],"选取id为one的元素的元素后面的所有":["124.2"],"nextall":["124.2"],"索引从0开始":["124.3"],"odd":["124.3"],"选取索引是基数的":["124.3"],"选取不包含子元素":["124.4"],"包括文本元素":["124.4"],"元素":["124.5"],"结尾的":["124.6"],"选取每个":["124.7"],"中的第1个":["124.7"],"的表单内所有不可用元素":["124.8"],"password":["124.9"],"选取所有的密码框":["124.9"],"radio":["124.9"],"选取所有单的选框":["124.9"]},{"0":["55.11","56.10","60.7","68.2","69.3","76.17","81.5","104.2"],"1":["5.4","17.11","22.3","25.15","27.12","30.2","39.1","58.10","68.4","75.10","76.9","76.17","84.0","105.0","108.4","108.5","109.10","109.11","117.1"],"2":["11.2","11.6","16.2","17.11","21.2","22.3","25.11","26.0","27.6","27.8","27.9","27.14","38.1","46.0","53.1","57.7","60.3","60.9","65.3","67.1","68.4","69.6","76.0","77.1","86.9","105.0","109.6","109.8","111.2","112.1","112.3","114.1","115.4","118.1","122.4","124.3"],"3":["22.2","26.5","44.1","46.0","55.11","56.8","58.5","62.8","65.3","65.7","66.1","67.4","71.2","74.2","74.3","77.4","77.5","86.13","86.14","89.8","90.1","93.14","95.1","95.8","100.2","109.3"],"4":["42.2","62.8","86.6","93.3","93.14","111.3","121.2"],"5":["32.11","56.12","66.2","89.2","90.7"],"6":["51.2","62.8","62.14","68.7","78.13"],"7":["51.2","95.8"],"8":["97.1","99.1","101.1","102.1","103.6"],"9":["64.4","73.1"],"10":["60.6","63.5","79.2","121.2"],"15":["108.4"],"16":["93.14"],"18":["54.5","65.5"],"20":["60.6","63.7","108.6"],"30":["121.2"],"44":["62.14","103.6"],"51":["66.3"],"100":["9.0","58.5","58.10","62.9","95.2"],"123":["64.4"],"130":["103.6"],"200":["56.2","62.9"],"210":["68.4"],"231":["62.14"],"321":["62.14"],"523":["62.14"],"21312":["86.9"],"141592653":["66.1"],"基本是ie9":["1.0"],"尾部标签":["2.0"],"image":["2.0","32.15","39.1","43.1","56.3","86.7","108.9","112.4"],"20230414195003392":["2.0"],"使用它们可以很方便的在页面中嵌入音频和视频":["3.0"],"width":["3.1","25.3","30.2","32.3"],"设置宽度":["3.1"],"loop":["3.1"],"自动重播":["3.1"],"您的浏览器暂不支持":["3.2"],"标签":["3.2","72.2"],"属性":["3.2","5.3","10.0","65.3"],"可以通过javascript解决":["3.3"],"限制用户输入必须为月类型":["4.0"],"week":["4.0"],"限制用户输入必须为周类型":["4.0"],"off":["4.1"],"on":["4.1","78.26"],"当用户在字段开始键入时":["4.1"],"浏览器基于之前键入过的值":["4.1"],"应该显示出在字段中填写的选项":["4.1"],"匹配具有att属性且值以val开头的e元素":["5.1"],"匹配具有att":["5.1"],"指定类型e的第n个":["5.2"],"选择某个父元素的一个或多个特定的子元素":["5.2"],"div":["5.3","22.1","39.4","75.2","75.11","103.1","117.1"],"content":["5.3","6.3"],"必须写content":["5.3"],"说明":["5.3","82.1"],"checkbox":["5.4","124.9"],"label":["5.4"],"for":["5.4","62.13","66.1","86.15","92.2","104.4"],"同级别下除了自己都选择":["5.5"],"进而在搜索引擎上提升网站的排名":["6.1"],"提高网站的知名度":["6.1"],"jd":["6.2"],"com":["6.2","6.3","43.4","123.5"],"综合网购首选":["6.2"],"正品低价":["6.2"],"京东jd":["6.3"],"网上购物":["6.4"],"网上商城":["6.4"],"手机":["6.4"],"笔记本":["6.4"],"电脑":["6.4"],"text":["7.0","24.2","43.1","88.2"],"indent移到盒子外面":["7.0"],"indent":["7.0"],"9999px":["7.0"],"所以值越大越模糊":["8.1"],"如果没有设定值":["8.1"],"图像不变":["8.2"],"值可以超过100":["8.2"],"值在0":["8.3","8.6"],"到100":["8.3","8.6"],"则图像无变化":["8.4"],"若值未设置":["8.4"],"会有模糊效果":["8.5"],"可选":["8.5"],"这是第三个code":["8.5"],"值越大":["8.5"],"越模糊":["8.5"],"则阴影会变得更大更淡":["8.5"],"不允许负值":["8.5"],"若未设定":["8.5"],"想要变化的css属性":["10.0"],"宽度高度背景颜色内外边距都可以":["10.0"],"如果想要所有的属性都":["10.0"],"变化过渡":["10.0"],"写一个all就可以":["10.0"],"你可以简单理解为变形":["11.0"],"移动":["11.0"],"transform相对于盒子自身尺寸":["11.1"],"translate":["11.1"],"translatey":["11.2","14.1"],"重点":["11.2","78.25"],"单位是deg比如rotate":["11.3"],"45deg":["11.3"],"left":["11.4","25.10","26.4","27.3","121.2"],"等":["11.6"],"度数":["11.7"],"可以实现旋转元素度数的单位是deg":["11.7"],"2d缩放sacle":["11.7"],"相比较过渡":["12.0"],"css":["12.1","29.2","35.2","95.8"],"move":["12.1"],"transform":["12.1"],"规定动画何时开始":["12.2"],"iteration":["12.2","12.3"],"count":["12.2","12.3"],"规定动画被播放的次数":["12.2"],"默认是1":["12.2"],"direction":["12.3"],"fill":["12.3"],"in":["12.4","28.1"],"一般用于设置盒子的背景":["13.0"],"y和z三条坐标轴构成了一个立体空间":["14.0"],"z轴位置与视线方向相同":["14.0"],"值":["14.2","32.13","57.8","65.3"],"取值":["14.2"],"拓展":["14.3"],"rotate3d":["14.3"],"x":["14.3","76.17"],"近实远虚的视觉效果":["14.4"],"实现方法":["14.4"],"添加transform":["14.4"],"scalez":["14.5"],"表现标准语言在网页中主要对网页信息的显示进行控制简单说就是":["15.1"],"如何修饰网页信息的显示样式":["15.1"],"css样式表":["15.2"],"内部样式表":["15.2"],"200px":["16.2"],"class选择器":["16.2"],"想要区分某个标签时":["16.2"],"比如想要区分2个div":["16.2"],"html":["16.2","39.4","43.1","43.2","96.1","98.1"],"class":["16.2","21.1","39.4","55.12"],"标签页":["17.1"],"tab":["17.1","55.5"],"文章列表":["17.1"],"list":["17.1","17.6"],"注册":["17.1"],"regsiter":["17.1"],"提示信息":["17.1","17.6"],"导航":["17.4"],"nav":["17.4","73.3"],"侧栏":["17.4"],"左导航":["17.5"],"leftsidebar":["17.5"],"右导航":["17.5"],"rightsidebar":["17.5"],"msg":["17.6"],"当前的":["17.6"],"current":["17.6"],"小技巧":["17.6"],"tips":["17.6"],"图标":["17.6"],"f60":["17.8"],"font12px":["17.9"],"size":["17.9","32.6","34.0"],"float":["17.10","26.2"],"一律小写":["17.11"],"打印":["17.12"],"print":["17.12","33.2"],"文字":["17.12"],"当你需要打开资源管理器找文件的时候":["18.0"],"这个快捷键会让你感觉非常":["18.0"],"爽":["18.0"],"再也不用腾出一只手去摸鼠标了":["18.0"],"小提示":["18.0"],"winkey指的是键盘上刻有windows徽标的键":["18.0"],"winkey主要出现在104键和107键的键盘中":["18.0"],"104键盘又称win95键盘":["18.0"],"这种键盘在原来101键盘的左右两边":["18.0"],"ctrl和alt键之间增加了两个windwos键和一个属性关联键":["18.0"],"107键盘又称为win98键盘":["18.0"],"比104键多了睡眠":["18.0"],"唤醒":["18.0"],"开机等电源管理键":["18.0"],"这3个键大部分位于键盘的右上方":["18.0"],"再补充点":["18.0"],"f1":["18.0"],"显示当前程序或者windows的帮助内容":["18.0"],"当你选中一个文件的话":["18.0"],"这意味着":["18.0"],"重命名":["18.0"],"f3":["18.0"],"当你在桌面上的时候是打开":["18.0"],"所有文件":["18.0"],"f10或alt":["18.0"],"激活当前程序的菜单栏":["18.0"],"windows键或ctrl":["18.0"],"打开开始菜单":["18.0"],"在win9x中打开关闭程序对话框":["18.0"],"删除被选择的选择项目":["18.0"],"如果是文件":["18.0"],"将被放入回收站":["18.0"],"将被直接删除而不是":["18.0"],"放入回收站":["18.0"],"新建一个新的文件":["18.0"],"打开文件":["18.0"],"保存当前操作的文件":["18.0"],"剪切被选择的项目到剪贴板":["18.0"],"或":["18.0","56.9","57.8"],"复制被选择的项目到剪贴板":["18.0"],"粘贴剪贴板中的内容到当前位置":["18.0"],"撤销上一步的操作":["18.0"],"重做上一步被撤销的操作":["18.0"],"windows键":["18.0"],"最小化或恢复windows窗口":["18.0"],"辅助工具管理器":["18.0"],"重新将恢复上一项操作前窗口的大小和位置":["18.0"],"打开资源管理器":["18.0"],"break":["18.0"],"系统属性":["18.0"],"计算机":["18.0"],"f10或鼠标右击":["18.0"],"打开当前活动项目的快捷菜单":["18.0"],"style":["19.0"],"文字样式":["19.0"],"decoration":["20.0"],"装饰文本":["20.0"],"none":["20.0","26.1"],"默认没有":["20.0"],"underline":["20.0"],"下划线":["20.0"],"demo":["21.1","75.8"],"demo1":["21.1"],"设置":["21.2"],"搜索emmet":["21.2"],"自己占一行":["22.1"],"比如一行可以放多个":["22.1"],"外边距以及内边距都可以控制":["22.2"],"宽度默认是容器":["22.2"],"父级宽度":["22.2"],"的100":["22.2"],"相邻行内元素在一行上":["22.3"],"一行可以显示多个":["22.3"],"高":["22.3"],"block":["22.4"],"转换为行内元素":["22.4"],"背景色透明":["23.1"],"url":["23.2","29.2"],"参数":["23.3","23.5"],"背景图像在纵向和横向上平铺":["23.3"],"百分数":["23.4"],"由浮点数字和单位标识符组成的长度值":["23.4"],"请参阅":["23.4"],"长度单位":["23.4"],"样式冲突":["24.1"],"遵循的原则是就近原则":["24.1"],"子元素可以继承父元素的样式":["24.2"],"此时子元素的行高是":["24.3"],"当前子元素的文字大小":["24.3"],"标签选择器为1":["24.4"],"类":["24.4"],"伪类":["24.4"],"利用css设置好盒子样式":["25.0"],"内容":["25.1","119.1","119.3"],"padding":["25.1"],"thick":["25.4"],"大于默认宽度":["25.4"],"为虚线":["25.5"],"solid":["25.5"],"实线边框":["25.5"],"double":["25.5"],"单词是合并的意思":["25.8"],"5px":["25.9"],"1个值":["25.9"],"代表上下左右都有5像素内边距":["25.9"],"10px":["25.9"],"right":["25.10"],"嵌套块元素垂直外边距的塌陷":["25.11"],"对于两个嵌套关系":["25.11"],"父好关系":["25.11"],"的块元素":["25.11"],"垂直阴影的位置":["25.13"],"必需":["25.14"],"水平阴影的位置":["25.14"],"允许负值":["25.14"],"可以分成两种情况":["25.15"],"sizing":["25.15"],"dl":["26.0"],"form":["26.0"],"table":["26.0","26.9","94.7"],"行内元素会按照顺序":["26.0"],"描述":["26.1","26.4","61.2"],"的元素最重要特性":["26.2"],"理论上其余的兄弟元素也要浮动":["26.3"],"一个盒子里面有多个子盒子":["26.3"],"不允许左侧有浮动元素":["26.4"],"清除左侧浮动的影响":["26.4"],"br":["26.6","44.2"],"优点":["26.6","26.7"],"通俗易懂":["26.6"],"clear":["26.8","98.5"],"both":["26.8"],"visibility":["26.8"],"父级overflow":["26.10"],"hidden":["26.10"],"书写简单":["26.10"],"溢出隐藏":["26.10"],"定位模式":["27.0"],"relative":["27.2"],"相对定位":["27.2"],"定义元素相对于其父元素下边线的距离":["27.3"],"它没有边偏移":["27.5"],"移动位置的时候参照点是自己原来的位置":["27.6"],"原来在标准流的位置继续占有":["27.6"],"祖先元素没有定位":["27.7"],"则以浏览器为准定位":["27.7"],"document文档":["27.7"],"和父元素没有任何关系不随滚动条滚动而滚动":["27.8"],"让固定定位的盒子margin":["27.9"],"占有原先的位置":["27.10"],"相对定位特点":["27.10"],"数值可以是正整数":["27.12"],"负整数或0":["27.12"],"块级元素添加绝对或者固定定位":["27.14"],"但是不会压住下面标准流盒子里面的文字":["27.16"],"图片":["27.16"],"本质":["28.0","54.2"],"将块对象指定为列表项目":["28.1"],"并可以添加可选项目标志":["28.1"],"run":["28.1"],"将对象作为块元素级的表格显示":["28.1"],"caption":["28.1"],"对象可视":["28.2"],"对象隐藏":["28.2"],"此为body对象和textarea的默认值":["28.3"],"在需要时剪切内容并添加滚动条":["28.3"],"不显示超过对象尺寸的内容":["28.3"],"推荐下载网站":["29.1"],"icomoon字库":["29.1"],"http":["29.1","76.17","94.3"],"icomoon":["29.1","29.2"],"io":["29.1"],"推荐指数":["29.1"],"icomoon成立于2011年":["29.1"],"引入字体声明":["29.2"],"face":["29.2"],"family":["29.2"],"src":["29.2"],"fonts":["29.2"],"rnza4y":["29.2"],"决定的":["30.1"],"制作网页参考物理分辨率还是逻辑分辨率":["30.1"],"device":["30.2"],"initial":["30.2"],"scale":["30.2"],"二倍图设计稿尺寸":["30.4"],"750px":["30.4"],"宽度自适应":["30.5"],"margin":["31.1"],"默认主轴在水平":["31.3"],"弹性盒子都是沿着主轴排列":["31.3"],"子元素可以自动的挤压或拉伸":["31.3"],"end":["31.4","31.5"],"终点开始依次排列":["31.4","31.5"],"center":["31.4","48.0"],"沿主轴居中排列":["31.4"],"默认值":["31.5"],"起点开始依次排列":["31.5"],"取值分类":["31.6"],"数值":["31.6"],"列":["31.7"],"垂直":["31.7"],"reverse":["31.7"],"设置该属性为它的默认值":["31.8"],"inherit":["31.8"],"从父元素继承该属性":["31.8"],"弹性盒子换行显示":["31.8"],"未来的解决方案":["32.0"],"vw":["32.2"],"vh":["32.2"],"rem单位":["32.2"],"根据不同的视口宽度":["32.3"],"设置不同的根字号":["32.3"],"media":["32.3"],"375px":["32.3"],"视口宽度":["32.4"],"确定基准根字号":["32.4"],"10视口宽度":["32.4"],"321px":["32.5"],"1024px":["32.5"],"pc客户端或大屏幕设备":["32.5"],"1028px至更大":["32.5"],"计算能力":["32.7"],"注意":["32.7","32.12","55.11","115.2"],"除法运算":["32.8"],"20220409161812504":["32.9"],"height":["32.11"],"不生成后代选择器":["32.12"],"变量名":["32.13","62.15"],"20220409175558579":["32.14"],"20220409175737776":["32.15"],"方法二":["32.15"],"20220409180935058":["32.16"],"100视口宽度":["32.18"],"vw单位的尺寸":["32.19"],"px单位数值":["32.19"],"body":["33.0","39.4","75.11","78.24","80.8","89.7","103.1","104.2"],"background":["33.0"],"color":["33.0"],"pink":["33.0"],"and":["33.1"],"screen":["33.2"],"带屏幕的设备":["33.2"],"打印预览":["33.2"],"视口最小宽或高":["33.3"],"min":["33.3","95.8"],"border":["34.0"],"更改用户的鼠标样式":["35.0"],"默认":["35.1"],"小手":["35.1"],"就可以去掉默认的蓝色边框":["35.2"],"resize":["35.3"],"middle":["36.0","37.0","48.0"],"top":["36.0","37.0"],"i":["37.0","44.2","44.3","60.7","66.1","69.3","86.15"],"bottom":["37.0","48.0"],"超出的部分隐藏":["38.1"],"overflow":["38.1"],"限制在一一个块元店显示的文本的行数":["38.2"],"line":["38.2"],"clamp":["38.2"],"20230414193322984":["39.1"],"让每个盒子margin往左侧移动":["39.1"],"head":["39.4","98.1","103.0"],"这样就可以有效的避免浏览器解释css代码时候出现乱码的问题":["40.0"],"比如":["40.0","78.9","78.16"],"黑体":["40.0"],"9ed1":["40.0"],"缩放替换后的内容以保持纵横比":["41.0"],"同时将其放入元素的内容框":["41.0"],"cover":["41.0"],"出现了css精灵技术":["42.1"],"也称css":["42.1"],"sprites":["42.1"],"position":["42.2"],"移动的距离就是这个目标图片的x和y坐标":["42.2"],"由opera":["43.1"],"mozilla基金会和苹果这些浏览器厂商组成":["43.1"],"20230413193002255":["43.1"],"html5的区别":["43.1"],"指的是超文本标记语言":["43.1"],"hyper":["43.1"],"markup":["43.1"],"而这里写":["43.2"],"表示":["43.2"],"使用的是最新的html版本":["43.2"],"定义为":["43.3"],"cn就是中文网页":["43.3"],"和":["43.4","55.11","108.2"],"kotlin":["43.4"],"cn":["43.4"],"vscode插件":["43.4"],"插件":["43.4"],"作用":["43.4"],"auto":["43.4"],"close":["43.4"],"tag":["43.4"],"自动补全标签":["43.4"],"rename":["43.4"],"可以看作一个一个小盒子":["44.1"],"定义盒子功能":["44.1"],"标记嵌套结构":["44.1"],"倾斜":["44.2"],"倾斜的内容":["44.2"],"em":["44.2","44.3"],"强制换行":["44.2"],"不换行":["44.3"],"商标":["44.4"],"gt":["44.4","124.3"],"title":["45.0","97.1","101.1","102.1","104.2","124.6"],"鼠标悬停上去之后的提示信息":["45.0"],"内部链接":["46.0"],"velign":["48.0"],"垂直对齐top":["48.0"],"cellspacing":["48.0"],"square":["49.0"],"password":["50.1"],"密码框":["50.1"],"提交框":["50.1"],"reset":["50.1"],"重置按钮":["50.1"],"button":["50.1","75.1","117.1"],"空按钮":["50.1"],"提交方式get":["50.2"],"post":["50.2"],"option":["50.3","50.4"],"file":["50.4"],"城市":["50.4"],"select":["50.4"],"name":["50.4","79.2","87.1","91.6"],"它看上去很可能成为未来的主宰":["51.1"],"同年网景公司动了心":["51.1"],"决定与sun公司结成联盟":["51.1"],"34岁的系统程序员brendan":["51.1"],"eich登场了":["51.1"],"1995年4月":["51.1"],"网景公司录用了他":["51.1"],"在线学编程":["51.2"],"人工智能":["51.2"],"tensorflow":["51.2"],"浏览器对象模型":["52.0"],"关键字":["52.1"],"保留字":["52.1","54.8"],"一组新的正则表达式特性":["52.2"],"promise":["52.2","94.4"],"finally":["52.2"],"以及模板字面量修订":["52.2"],"es10":["52.2"],"flat":["52.2"],"包含不同的数据":["52.3"],"比如下面的":["52.3"],"页面":["52.3"],"javascript":["52.3","55.1","61.4","66.1","75.11","76.19","79.2","80.8","81.3","89.7","90.8","93.7","96.1"],"是指浏览器对象模型":["52.4"],"它提供了独立于内容的":["52.4"],"js中我们推荐使用":["53.1"],"单引号":["53.1","55.5"],"内嵌式":["53.1"],"浏览器控制台打印输出信息":["53.3"],"测试用":["53.3"],"表示日志":["53.3"],"甚至数据可以修改":["54.2"],"计算机会自动为变量分配内存空间":["54.3"],"不需要程序员管":["54.3"],"age是程序员定义的变量名":["54.3"],"我们要通过变量名来访问内存中分配的空间":["54.3"],"age":["54.5"],"不声明":["54.7"],"直接使用":["54.7"],"是":["54.8"],"错误":["54.8"],"的":["54.8"],"不能是关键字":["54.8"],"例如":["54.8","90.6","108.2"],"运行完毕之后":["55.1"],"变量就确定了数据类型":["55.1"],"拥有动态类型":["55.1"],"如":["55.3"],"张三":["55.3"],"注意js里面":["55.3"],"字符串都带引号":["55.3"],"undefined":["55.3"],"num":["55.4","79.2"],"0xa":["55.4"],"在js中八进制前面加0":["55.4"],"十六进制前面加":["55.4"],"0x":["55.4"],"数字型number的最大值":["55.4"],"alert":["55.4","57.7","66.3"],"number":["55.4"],"max":["55.4"],"value":["55.4","61.2"],"newline":["55.5"],"的意":["55.5"],"双引":["55.5"],"t":["55.5"],"缩进":["55.5"],"b":["55.5","64.4","69.9"],"表示假":["55.6"],"错":["55.6"],"你好":["55.7","55.8"],"你好undefined":["55.7"],"你好null":["55.8"],"20220412121320181":["55.10"],"js隐式转换":["55.11"],"利用算数运算隐式转换成数值型":["55.11"],"单词的大小写":["55.11"],"这2个是重点":["55.11"],"隐式转换是我们在进行算数运算的时候":["55.11"],"js":["55.11","108.7","108.11"],"自动转换了数据类型":["55.11"],"转换为布尔型":["55.11"],"代表空":["55.11"],"实际上就是预留的":["55.12"],"意思是现在虽然还不是关键字":["55.12"],"但是未来可能会成为关键字":["55.12"],"同样不能使用它们当变量名或方法名":["55.12"],"boolean":["55.12","69.2"],"byte":["55.12"],"char":["55.12"],"比较和执行算数运算等功能的符号":["56.1"],"乘":["56.2"],"20220412145107035":["56.3"],"表达式最终都会有一个结果":["56.4"],"也可以放在变量后面":["56.5"],"放在变量前面时":["56.5"],"我们可以称为前置递增":["56.5"],"但是":["56.6","56.7"],"大于等于号":["56.8"],"小于等于号":["56.8"],"true":["56.9","58.8","60.6","61.6","66.3","78.20","88.3","91.6","121.1"],"false":["56.9","61.2","76.18","78.4","88.3"],"如果第一个表达式判断为真":["56.10"],"则返回最后一个表达式":["56.10"],"如果有空字符串或者否定的为假":["56.10"],"其余为真":["56.10"],"加":["56.11"],"减一个数后在赋值":["56.11"],"关系运算符":["56.12"],"相等运算符":["56.12"],"分别是":["57.1"],"顺序结构":["57.1"],"依次执行":["57.2"],"程序中大多数的代码都是这样执行的":["57.2"],"从而得到不同的结果":["57.3"],"条件表达式":["57.4","57.5","58.8"],"条件成立执行的代码语句":["57.4"],"如果":["57.5"],"条件表达式2":["57.6"],"语句2":["57.6"],"执行思路":["57.7","58.8"],"可以是":["57.8"],"通常是一个":["57.8"],"变量":["57.8"],"后跟一个选项的表达式或值":["57.8"],"③":["57.9"],"switch语句进行条件判断后直接执行到程序的条件语句":["57.9"],"效率更高":["57.9"],"而if":["57.9"],"重复执行某些语句":["58.2"],"var":["58.4","62.13","66.1","73.3","79.2","86.9","87.1","93.11","120.1"],"关键字声明新的变量":["58.4"],"这个变量帮我们来记录次数":["58.4"],"重复执行不相同的代码":["58.5"],"外循环的操作表达式":["58.6"],"内循环的初始":["58.6"],"内循环的条件":["58.6"],"使用":["58.7"],"循环时一定要注意":["58.7"],"它必须要有退出条件":["58.7"],"时重复执行循环体代码":["58.8"],"if":["58.10","58.11","65.9","66.1","66.3"],"一组数据存储在单个变量名下":["60.1"],"数组名":["60.3"],"使用数组字面量方式创建带初始值的数组":["60.3"],"小":["60.6"],"console":["60.6","60.10","62.4","65.8","68.1","69.6","79.2","108.11","109.6","110.2"],"log":["60.10","62.4","65.8","68.1","69.6","79.2","109.6","110.2"],"降序":["60.10"],"mozilla":["61.0"],"数据都可以看作是一类方法和类的对象方法":["61.1"],"创建一个新数组即是一种由某类的构造函数生成的数组对象":["61.1"],"configurable":["61.2"],"writable":["61.2","88.3"],"static":["61.2"],"可选定义值":["61.2"],"类型":["61.2"],"数组除了包含本身的数组元素之外":["61.3"],"还有其对象属性":["61.3"],"获取数组的长度":["61.4"],"object":["61.6","91.6"],"res3":["61.7"],"res4":["61.7"],"是声明函数的关键字":["62.3"],"实参是传递给形参的":["62.7"],"参数的作用":["62.7"],"函数内部":["62.7"],"某些值不能固定":["62.7"],"我们可以通过参数在":["62.7"],"形参和实参个数相等":["62.9"],"继续执行下次循环":["62.12"],"return":["62.12","65.9"],"遍历数组":["62.13"],"function":["62.13","66.1","76.14","78.3","95.7","117.1"],"get":["62.13"],"arr1":["62.14"],"输入一个年份":["62.14"],"判断是否是闰年":["62.14"],"闰年":["62.14"],"能被4整除并且不能被100整数":["62.14"],"就是这个名字的作用域":["63.1"],"作用域的使用提高了程序逻辑的局部性":["63.1"],"这个代码的名字只在函数内部起效果和作用":["63.3"],"num2":["63.5","63.7"],"函数的形参也可以看作是局部变量":["63.6"],"num1":["63.7"],"只能在函数内部调用":["63.7"],"外面不能调用":["63.8"],"根据内部函数可以访问外部函数变量的这种机制":["63.9"],"js引擎会把js里面所有的var":["64.1"],"还有function提升到当前作用域的最前面":["64.1"],"作用域链":["64.4"],"输出9":["64.4"],"事物的行为":["65.1"],"在对象中用方法来表示":["65.1"],"常用动词":["65.1"],"保存一个值时":["65.1"],"属性值":["65.3","118.2","118.3"],"多个属性或者方法用逗号隔开":["65.3"],"方法冒号后面跟的是一个匿名函数":["65.3"],"调用对象的属性":["65.3"],"使用的时候必须是":["65.4"],"对象":["65.4"],"sex":["65.5"],"男":["65.5"],"sing":["65.6","85.6"],"执行构造函数里面的代码":["65.7"],"k":["65.8","92.2"],"计算min":["65.9"],"计算avg":["65.9"],"avg":["65.9"],"创建对象":["65.9"],"obj":["65.9","69.5","69.9"],"传入属性值给对象":["65.9"],"arr":["65.9","120.1"],"返回给定的一组数字中的最大值":["66.0"],"如果给定的参数中至少有一个参数无法被转换成数字":["66.0"],"负零":["66.1"],"封装自己的数学对象":["66.1"],"mymath":["66.1"],"arguments":["66.1"],"length":["66.1","68.2","76.9"],"5特殊":["66.2"],"往大了取":["66.2"],"while":["66.3"],"newnum":["66.3"],"prompt":["66.3"],"请输入1":["66.3"],"10之间的数字":["66.3"],"猜大了":["66.3"],"else":["66.3","78.6","78.11","78.21","92.3"],"猜小了":["66.3"],"构造函数的参数":["67.1"],"如果括号里面有时间":["67.1"],"就返回参数里面的时间":["67.1"],"星期一":["67.2"],"星期二":["67.2"],"星期三":["67.2"],"星期四":["67.2"],"星期五":["67.2"],"星期六":["67.2"],"day":["67.2"],"今天是":["67.2"],"年":["67.2"],"月":["67.2"],"日":["67.2"],"知乎":["67.3"],"zhihu":["67.3"],"最常用":["67.4"],"小时":["67.5"],"分钟":["67.5"],"有两个空数组":["68.1"],"调用并返回":["68.3"],"在数组开头删除元素":["68.3"],"返回一个字符串":["68.6"],"join":["68.6"],"newarr":["68.7"],"months":["68.7"],"jan":["68.7"],"march":["68.7"],"april":["68.7"],"temp":["69.1"],"new":["69.1","85.5","86.9","87.3"],"string":["69.1","106.1"],"push":["69.4"],"并统计其次数":["69.5"],"把每一个字符都存储给对象":["69.5"],"如果对象没有该属性":["69.5"],"就为1":["69.5"],"如果存在就":["69.5"],"andy":["69.6","87.1"],"ed":["69.6"],"andyed":["69.6"],"让str1":["69.7"],"替换后的字符串":["69.7"],"再继续循环":["69.7"],"touppercase":["69.8"],"转换为大写":["69.8"],"ss":["69.9"],"slice":["69.9"],"返回空对象":["70.1"],"如果有个变量我们打算存储为对象":["70.1"],"暂时没想好放什么":["70.1"],"这个时候给null":["70.1"],"一般由程序员分配释放":["70.2"],"若程序员不释放":["70.2"],"则由垃圾回收机制回收":["70.2"],"值类型变量的数据直接存放在变量":["70.3"],"栈空间":["70.3"],"date等":["70.4"],"引用类型变量":["70.4"],"都不会影响到的外部变量":["70.5"],"所以操作的是同一个对象":["70.6"],"html5":["71.1","123.3"],"应用的":["71.1"],"api":["71.1"],"或者xml":["72.1"],"的标准编程接口":["72.1"],"节点":["72.2"],"网页中所有内容都是节点":["72.2"],"还可以根据标签名获取某个元素":["73.2"],"父元素":["73.2"],"id选择器":["73.3"],"firstbox":["73.3"],"响应机制":["74.1"],"网页中的每个元素都可以产生某些可以触发":["74.1"],"绑定事件":["74.3"],"获得鼠标焦点触发":["74.4","78.23"],"onblur":["74.4","78.13","78.23"],"失去鼠标焦点触发":["74.4","78.23"],"注意以下都是属性":["75.0"],"显示当前系统时间":["75.1"],"大小":["75.2"],"获取自定义属性":["75.6"],"index":["75.8"],"不容易判断到底内置属性还是自定义的":["75.9"],"或者使用javascript设置":["75.10"],"gettime":["75.11"],"繁琐":["76.0"],"利用节点层级关系获取元素":["76.0"],"节点名称":["76.1"],"和nodevalue":["76.1"],"节点值":["76.1"],"这三个基本属性":["76.1"],"元素节点":["76.1"],"nodetype":["76.1"],"children":["76.4"],"非标准":["76.4"],"返回第一个子节点":["76.5","76.7"],"找不到则返回null":["76.5","76.11","76.12"],"我是li2":["76.6"],"返回最后一个子节点":["76.8"],"返回当前元素的下一个兄弟元素节点":["76.11"],"返回当前元素上一个兄弟元素节点":["76.12"],"返回当前元素下一个兄弟元素节点":["76.13"],"自己封装一个兼容性的函数":["76.14"],"getnextelementsibling":["76.14"],"element":["76.14"],"指定的html":["76.15"],"insertbefore":["76.16","77.2"],"指定元素":["76.16"],"equiv":["76.17"],"ua":["76.17"],"则是浅拷贝":["76.18"],"结构稍微复杂":["76.19"],"创建多个元素效率稍低一点点":["76.19"],"但是结构更清晰":["76.19"],"innerhtml":["77.1","77.4"],"remove":["77.3"],"innertext":["77.4"],"提倡":["77.5"],"利用节点操作获取元素":["77.5"],"getattribute":["77.6"],"能够封装阻止冒泡的兼容性函数":["78.1"],"它是一个方法":["78.3"],"btn":["78.3"],"ie9":["78.3","78.25"],"事件发生时":["78.4","78.8"],"会调用该监听函数":["78.4","78.8"],"可选参数":["78.4"],"是一个布尔值":["78.4"],"默认是":["78.4"],"eventnamewithon":["78.5"],"callback":["78.5"],"该方法接收两个参数":["78.5"],"第三个参数":["78.6","78.11"],"默认是false":["78.6","78.11"],"attachevent":["78.6"],"事件处理函数":["78.8"],"onclick":["78.9"],"onmouseover":["78.9"],"网景最早提出":["78.12"],"由":["78.12"],"最顶层节点开始":["78.12"],"然后逐级向下传播到到最具体的元素接收的过程":["78.12"],"onfocus":["78.13"],"onmouseenter":["78.13"],"onmouseleave":["78.13"],"事件冒泡有时候会带来麻烦":["78.13"],"有时候又会帮助很巧妙的做某些事件":["78.13"],"我们后面讲解":["78.13"],"两个盒子嵌套":["78.13"],"我们点击子盒子":["78.14"],"会弹出":["78.14"],"简单理解":["78.16"],"事件发生后":["78.16"],"跟事件相关的一系列信息数据的集合都放到这个对象里面":["78.16"],"这个对象就是事件对象":["78.16"],"它有很多属性和方法":["78.16"],"谁绑定了这个事件":["78.16"],"如果需要的话":["78.17"],"需要到":["78.17"],"window":["78.17","91.6"],"该属性阻止默认行为":["78.18"],"preventdefault":["78.18","122.9"],"该方法阻止默认行为":["78.18"],"action":["78.19"],"cancelbubble属性":["78.20"],"cancelbubble":["78.20"],"h1":["78.24"],"返回鼠标相对于文档页面的x坐标":["78.25"],"支持":["78.25"],"和前面2个的区别是":["78.26"],"它不识别功能键":["78.26"],"在我们实际开发中":["78.27"],"我们更多的使用keydown和keyup":["78.27"],"它能识别所有的键":["78.27"],"包括功能键":["78.27"],"浏览器标准的一部分":["79.1"],"文档对象模型":["79.1"],"定义在全局作用域中的变量会变成window对象的属性":["79.2"],"传统注册事件方式":["80.1"],"只能写一次":["80.1"],"如果有多个":["80.1"],"会以最后一个window":["80.1"],"onload为准":["80.1"],"如果使用addeventlistener":["80.1"],"是dom加载完毕":["80.2"],"不包含图片":["80.2"],"只要窗口大小发生像素变化":["80.3"],"就会触发这个事件":["80.3"],"我们经常利用这个事件完成响应式布局":["80.3"],"延迟的毫秒数省略默认是0":["80.5"],"如果写":["80.5"],"必须是毫秒":["80.5"],"因为定时器可能有很多":["80.5"],"所以我们经常给定时器赋值一个标识符":["80.5"],"可以省略":["80.6","80.7"],"里面的参数就是定时器的标识符":["80.6"],"这个回调函数":["80.7"],"可以直接写函数":["80.7"],"元素进行添加和删除操作":["81.1"],"不能同时进行":["81.1"],"应该先进行添加":["81.1"],"之后再删除":["81.1"],"那么以下代码执行的结果又是什么":["81.2"],"脚本创建多个线程":["81.3"],"于是":["81.3"],"因为这个属性返回的是一个对象":["82.0"],"通信协议":["82.1"],"常用的http":["82.1"],"ftp":["82.1"],"maito等":["82.1"],"主机":["82.1"],"返回参数":["82.2"],"hash":["82.2"],"返回片段":["82.2"],"后面内容常见于链接":["82.2"],"重新加载页面":["82.3"],"相当于刷新按钮或者":["82.3"],"f5":["82.3"],"如果参数为true":["82.3"],"ipod":["83.0"],"ios":["83.0"],"ipad":["83.0"],"android":["83.0"],"mobile":["83.0"],"blackberry":["83.0"],"iemobile":["83.0"],"参数如果是":["84.0"],"前进1个页面":["84.0"],"如果是":["84.0"],"然后用函数把这些步骤一步一步实现":["85.1"],"继承性":["85.2"],"继承是发生在两个类之间":["85.2"],"一个类继承另一个类是说这个类属于另一个类":["85.2"],"在对象中用属性来表示":["85.3"],"名词":["85.3"],"类抽象了对象的公共部分":["85.4"],"它泛指某一大类":["85.4"],"son":["85.8"],"extends":["85.8","85.10"],"此时会出现子类的构造函数指向son":["85.9"],"而不是父类的this":["85.9"],"正确做法如下":["85.9"],"使用super":["85.9"],"传递参数":["85.9"],"super":["85.11"],"里面一定要跟参数":["85.11"],"btn调用":["85.12"],"this指向btn":["85.12"],"06发版":["86.1"],"但目前浏览器的javascript是es5版本":["86.1"],"构造函数创建的实例对象有":["86.6"],"方法放到原型对象里面":["86.8"],"prototype":["86.8"],"a":["86.9"],"l":["86.9"],"song":["86.9"],"constructor":["86.10","87.3"],"指回构造函数":["86.10"],"指向object":["86.12"],"指向":["86.13"],"prototype原型对象":["86.13"],"如果还没有就查找原型对象的原型":["86.13"],"在原型对象函数里面的this指向对象实例":["86.14"],"模拟实现继承":["87.0"],"指向o":["87.1"],"score":["87.2"],"this指向子构造函数的对象实例":["87.2"],"call":["87.2"],"如果利用对象的形式修改了原型对象":["87.3"],"别忘了利用constructor指回原来的构造函数":["87.3"],"子方法":["87.3"],"类创建的实例对象也有实例对象原型":["87.4"],"proto":["87.4"],"指向类的原型对象":["87.4"],"方便":["87.5"],"方法用于检测数组中的元素是否满足指定条件":["88.1"],"通俗点查找数组中是否满足条件的元素":["88.1"],"注意它的返回值是布尔值":["88.1"],"如果查找到这个元素":["88.1"],"input":["88.2","124.8"],"type":["88.2"],"设置属性的值":["88.3"],"默认为undefined":["88.3"],"值是否可以重写":["88.3"],"参数2":["89.1"],"函数体":["89.1"],"里面参数都必须是字符串格式":["89.1"],"第三种方式执行效率低":["89.1"],"定时器函数":["89.2"],"对象方法调用":["89.3"],"该方法所属对象":["89.3"],"事件绑定方法":["89.3"],"绑定事件对象":["89.3"],"apply":["89.4"],"传递的其他参数":["89.5"],"返回值就是函数的返回值":["89.5","89.6"],"传递的值":["89.6"],"必须包含在数组里面":["89.6"],"返回由指定的this值和初始化参数改造的":["89.7"],"原函数拷贝":["89.7"],"arg":["89.8"],"bind不会调用函数":["89.8"],"可以改变函数内部this指向":["89.8"],"消除代码运行的一些不安全之处":["90.1"],"保证代码运行的安全":["90.1"],"提高编译器效率":["90.1"],"我们可以将严格模式分为":["90.2"],"为脚本开启严格模式":["90.2"],"有的script基本是严格模式":["90.3"],"有的script脚本是正常模式":["90.3"],"这样不利于文件合并":["90.3"],"为某个函数开启严格模式":["90.4"],"严禁删除已声明变量":["90.6"],"this会报错":["90.7"],"new实例化的构造函数指向创建的对象实例":["90.7"],"更多严格模式要求参考":["90.8"],"严格模式":["90.8"],"将函数作为返回值":["90.9"],"函数外部不可以使用局部变量":["91.1"],"一个作用域可以访问另外一个函数内部的局部变量":["91.2"],"里面会有两个参数":["91.3"],"global":["91.3"],"全局作用域":["91.3"],"local":["91.3"],"鲱鱼罐头":["91.5"],"思考题":["91.6"],"没有闭包":["91.6"],"the":["91.6"],"my":["91.6"],"案例":["92.0"],"利用递归遍历数据":["92.0"],"data":["92.0"],"id":["92.0","103.1"],"浅拷贝方法一":["92.2"],"o":["92.2"],"判断值是否是对象":["92.3"],"用户名表单只能输入英文字母":["93.2"],"数字或者下划线":["93.2"],"昵称输入框中可以输入中文":["93.2"],"regexp":["93.5"],"表达式":["93.5"],"str":["93.6","93.18"],"可以参考":["93.7"],"mdn":["93.7"],"正则表达式":["93.7"],"abcd":["93.8"],"aabcd":["93.8"],"reg":["93.8","93.11"],"后面的字符串只要包含":["93.10"],"za":["93.11"],"重复n次或更多次":["93.12"],"当表单失去焦点就开始验证":["93.14"],"如果符合正则规范":["93.14"],"则让后面的span标签添加":["93.14"],"里面表示重复次数":["93.15"],"它只是让c":["93.15"],"数字":["93.16"],"和下划线以外的字符":["93.16"],"andy和red":["93.18"],"newstr":["93.18"],"g":["93.19"],"全局匹配":["93.19"],"中文名称为欧洲计算机制造商协会":["94.1"],"这个组织的目标是评估":["94.1"],"www":["94.3"],"第6版":["94.4"],"2015年":["94.4"],"模块化":["94.4"],"面向对象语法":["94.4"],"箭头函数":["94.4"],"let":["94.4","103.4","103.5"],"const":["94.4"],"数组解构赋值":["94.4"],"等等":["94.4"],"第7版":["94.4"],"2016年":["94.4"],"其中主要是浏":["94.5"],"览器厂商":["94.5"],"有苹果":["94.5"],"编程实现更简单":["94.6"],"compatibility":["94.7"],"局部变量":["95.1"],"e":["95.2"],"单个声明并赋值":["95.2"],"报错":["95.3","95.6"],"uncaught":["95.3","95.6"],"syntaxerror":["95.3"],"people2":["95.6"],"p":["95.7","124.4"],"大哥":["95.7"],"bootstrap":["95.8"],"rel":["95.8"],"stylesheet":["95.8"],"doctype":["96.1"],"utf":["97.1","99.1","100.3","102.1","103.0"],"meta":["98.1","100.3","103.0"],"strtest2":["98.3"],"表示该值是否为set成员":["98.5"],"清除所有成员":["98.5"],"没有返回值":["98.5"],"charset":["99.1","100.3","103.0"],"箭头函数this指向声明时所在作用域下this值":["100.2"],"箭头函数的实践和应用场景":["100.4"],"ary":["103.3"],"lis":["103.4"],"array1":["103.4","103.5"],"内置值":["104.1"],"小小的symbol":["104.1"],"iterator":["104.4"],"对象进行":["104.4"],"of":["104.4"],"循环时":["104.4"],"会调用":["104.4"],"方法":["104.4","108.1"],"返回该对象的默认遍历器":["104.4"],"toprimitive":["104.4"],"该对象被转为原始类型的值时":["104.4"],"代码说明":["105.0"],"的位置没有限制":["105.0"],"生成器函数返回的结果是迭代器对象":["105.0"],"set":["106.1"],"map":["106.1"],"typedarray":["106.1"],"nodelist":["106.1"],"promise构造函数":["107.0"],"excutor":["107.0"],"require":["108.1"],"模块对外共享成员使用":["108.1"],"适用于浏览器端的":["108.2"],"等模块化规范":["108.3"],"模块化规范中定义":["108.3"],"确保安装了":["108.4"],"v14":["108.4"],"默认导出与默认导入":["108.5"],"n2":["108.6"],"export":["108.8"],"03按需导出":["108.11"],"可以使用":["108.12"],"as":["108.12"],"关键字进行重命名":["108.12"],"示例代码如下":["108.13","109.9"],"第3层回调函数":["109.1"],"中新增了":["109.2"],"方法用来预先指定成功和失败的回调函数":["109.3"],"20220518235023267":["109.4"],"安装":["109.5"],"这个第三方包":["109.5"],"r1":["109.6"],"继续进行处理":["109.7"],"如果不希望前面的错误导致后续的":["109.9"],"无法正常执行":["109.9"],"则可以将":["109.9"],"的调用提前":["109.9"],"catch可以将错误捕获":["109.9"],"并且可以让后面的":["109.9"],"then正常执行":["109.9"],"readfile":["109.10","109.12","110.3"],"files":["109.10","110.3"],"txt":["109.10","109.11","110.3"],"utf8":["109.10","109.11","109.12","110.2","110.3"],"resolve":["109.12"],"reject":["109.12"],"现之前":["110.1"],"开发者只能通过链式":["110.1"],"then":["110.1"],"的方式处理":["110.1"],"r2":["110.2","110.3"],"20220519010302643":["111.1"],"单线程执行任务队列的问题":["111.1"],"才能执行后一个任务":["111.2"],"异步任务":["111.2"],"asynchronous":["111.2"],"加入到任务队列中等待执行":["111.3"],"放到执行栈中依次执行":["111.4"],"这个过程是循环不断的":["111.4"],"同步任务":["111.5"],"会根据代码的先后顺序依次被执行":["111.5"],"其他宏任务":["112.1"],"微任务":["112.1"],"microtask":["112.1"],"如果有":["112.2"],"行代码":["112.3"],"再执行微任务":["112.3"],"个部分":["112.4"],"比如获取元素等":["113.1"],"常见的javascript库":["113.1"],"jquery":["113.1"],"把js中的dom操作做了封装":["113.2"],"我们可以快速的查询使用里面的功能":["113.2"],"jquery封装了javascript常用的功能代码":["113.2"],"优化了dom操作":["113.2"],"动画支持":["113.3"],"大大简化了dom操作":["113.3"],"支持插件扩展开发":["113.3"],"2x":["114.0"],"不兼容ie678等低版本浏览器":["114.0"],"jquery帮我们完成了封装":["114.1"],"相当于原生js中的domcontentloaded":["114.1"],"是jquery的顶级对象":["114.2"],"相当于原生js中的window":["114.2"],"jquery对象本质是":["114.3"],"两种方式":["114.4"],"20230415040048039":["115.1"],"并不会获取孙子层级的元素":["115.2"],"后代选择器":["115.2"],"获取到的li元素中":["115.4"],"选择索引号为2的元素":["115.4"],"索引号index从0开始":["115.4"],"siblings":["115.5","124.2"],"first":["115.5"],"查找兄弟节点":["115.5"],"不包括自己本身":["115.5"],"nextall":["115.5"],"expr":["115.5"],"red":["115.6","120.1"],"300px":["116.1"],"removeclass":["116.2"],"toggle":["117.1"],"eq":["117.1","124.3"],"click":["117.1"],"鼠标移动到元素上要触发的函数":["117.2"],"mouseenter":["117.2"],"slidetoggle":["117.3"],"fadetoggle":["117.4"],"淡入淡出切换":["117.4"],"如果是复合属性则需要采用驼峰命名法borderleft":["117.5"],"其余参数可以省略":["117.5"],"设置属性语法":["118.1"],"向被选中元素添加":["118.3"],"获取内容":["119.2"],"更改颜色":["120.1"],"green":["120.1"],"blue":["120.1"],"外部添加":["120.3"],"empty":["120.4"],"删除匹配的元素集合中所有的子节点":["120.4"],"boder":["121.1"],"可以设置元素的偏移":["121.2"],"focus":["122.2"],"change":["122.2"],"如click或keydown":["122.4"],"append":["122.5"],"用on可以":["122.5"],"li":["122.6"],"triggerhandler":["122.8"],"待拷贝到target的对象":["123.1"],"如果target原来有对象":["123.1"],"那么就会直接合并数据":["123.1"],"浅拷贝":["123.1"],"这就叫多库共存":["123.2"],"解决方案":["123.2"],"自由分享jquery":["123.3"],"easylazyload":["123.4"],"simple":["123.5"],"github":["123.5"],"jquery全屏滚动插件fullpage":["123.5"],"查找":["124.0"],"或选择":["124.0"],"myclass":["124.1"],"选择使用myclass类的css的所有元素":["124.1"],"获取id为one的元素的所有":["124.2"],"不管前后":["124.2"],"选取索引等于2的":["124.3"],"空元素":["124.4"],"has":["124.4"],"visible":["124.5"],"选取所有的name属性包含":["124.6"],"元素":["124.7"],"last":["124.7"],"checked":["124.8"],"选取所有被选中的":["124.8"],"选取所有的多选框":["124.9"],"submit":["124.9"],"选取所有的提交按钮":["124.9"]},{"0":["15.1","30.2","56.2","60.6","62.13","67.5","68.5","68.7","69.6","117.1"],"1":["24.3","43.2","61.1","75.8","86.9","91.6","123.2"],"2":["5.4","10.0","27.7","30.2","38.2","39.1","56.10","57.4","60.7","69.1","69.7","75.11","78.10","86.10","93.5","107.0","108.5","109.10","109.11","110.2"],"3":["17.11","18.0","22.3","25.0","27.10","38.1","50.3","53.1","58.11","69.6","77.1","77.6","87.1","91.1","105.0","106.1","114.1","116.2","122.4"],"4":["22.3","26.5","46.0","65.7","86.13","90.1","100.2","124.3"],"5":["32.4","42.2","62.8","67.1","91.3","93.14","98.4"],"6":["56.12","89.2","90.7"],"7":["58.10","90.7"],"8":["51.2","96.1","98.1","100.3","103.0"],"9":["93.11","112.3"],"10":["54.3","54.7","67.5"],"11":["55.7","55.8","62.8","92.0"],"12":["92.0"],"15":["65.9"],"20":["63.5","75.11"],"31":["65.9"],"37":["32.4","56.8"],"42":["65.9"],"56":["65.9"],"100":["62.14","65.9"],"111":["92.0"],"112":["92.0"],"123":["58.5"],"300":["116.1"],"308":["55.4"],"324":["55.4"],"400":["62.9","62.14"],"500":["62.9"],"521":["95.2"],"700":["62.9","117.1"],"1000":["109.1"],"1200":["68.3"],"1500":["68.3"],"1650":["39.4"],"1800":["68.3"],"1994":["94.1"],"2000":["68.3","109.1"],"2004":["62.14"],"2100":["68.3"],"3000":["109.1"],"21312":["86.10"],"以上版本的浏览器才支持":["1.0"],"如果不考虑兼容性问题":["1.0"],"注意":["2.0","8.5","43.2","61.4","73.1"],"这种语义化标准":["2.0"],"主要是针对搜索引擎的":["2.0"],"而不再去使用flash和其他浏览器插件":["3.0"],"preload":["3.1"],"视频在页面加载时进行加载并预备播放":["3.1"],"auto":["3.1"],"当页面加载后载入整个视频":["3.1"],"值":["3.2","37.0"],"描述":["3.2","37.0"],"autoplay":["3.2"],"如果出现该属性":["3.2"],"则音频在就绪后马上播放":["3.2"],"视频标签是重点":["3.3"],"我们经常设置自动播放":["3.3"],"number":["4.0"],"限制用户输入必须为数字类型":["4.0"],"tel":["4.0"],"默认已经打开":["4.1"],"如autocomplete":["4.1"],"关闭autocomplete":["4.1"],"属性且值以val结尾的e元素":["5.1"],"n可以是数字":["5.2"],"关键字和公式":["5.2"],"n如果是数字":["5.2"],"就是选择第n个子元素":["5.2"],"里面数字从1开始":["5.2"],"even":["5.2"],"2n":["5.2"],"e":["5.3"],"selection":["5.3"],"文本选中状态的样式":["5.3"],"只能背景颜色和字体颜色":["5.3"],"first":["5.3"],"letter":["5.3"],"页面必须有三个标签用来符合":["6.1"],"品质保障":["6.2"],"配送及时":["6.2"],"轻松购物":["6.2"],"专业的综合网上购物商城":["6.3"],"销售家电":["6.3"],"数码通讯":["6.3"],"电脑":["6.3"],"家居百货":["6.3"],"mp3":["6.4"],"cd":["6.4"],"vcd":["6.4"],"dv":["6.4"],"相机":["6.4"],"数码":["6.4"],"然后overflow":["7.0"],"hidden":["7.0","26.8","38.1"],"淘宝的做法":["7.0"],"方法2":["7.0"],"则默认是0":["8.1"],"意味着会运用更低的对比":["8.2"],"之间":["8.3","8.6"],"则是效果的线性乘子":["8.3","8.6"],"默认值是0deg":["8.4"],"默认是0":["8.5"],"则阴影的边界很锐利":["8.5"],"这是第四个":["8.5"],"正值会使阴影扩张和变大":["8.5"],"负值会是阴影缩小":["8.5"],"阴影会与元素一样大小":["8.5"],"80px":["9.0"],"单位是秒":["10.0"],"必须写单位":["10.0"],"比如0":["10.0"],"5s":["10.0","12.3"],"translate":["11.0"],"只给一个值":["11.1"],"定义2d转换中的移动":["11.2"],"沿着x和y轴移动元素":["11.2"],"translate最大的优点":["11.2"],"角度为正时":["11.3"],"顺时针":["11.3"],"right":["11.4","18.0","26.4","93.14"],"top":["11.4","23.4"],"a":["11.5","55.3","68.4","84.0","86.8"],"等比例缩放":["11.5"],"其顺序会影转换的效果":["11.6"],"先旋转会改变坐标轴方向":["11.6"],"里面参数是数字不跟单位可以是小数最大的优势不影响其他盒子":["11.7"],"设置转换中心点":["11.7"],"transform":["11.7"],"动画可以实现更多变化":["12.0"],"更多控制":["12.0"],"translatex":["12.1"],"0px":["12.1"],"还有infinite":["12.2"],"direction":["12.2"],"规定动画是否在下一周期逆向播放":["12.2"],"normal":["12.2","117.5"],"alternate逆播放":["12.2"],"mode":["12.3"],"myfirst":["12.3"],"out":["12.4"],"动画以低速结束":["12.4"],"image":["13.0","16.1","30.4","52.0","57.2","57.3","70.2","70.3","108.12","108.13","124.9"],"空间转换也叫3d转换":["14.0"],"translatez":["14.1"],"像素单位数值":["14.2"],"y":["14.3","87.1"],"z":["14.3"],"角度度数":["14.3"],"scale3d":["14.5"],"目前推荐遵循的是w3c发布的css3":["15.1"],"外部样式表":["15.2"],"box":["16.2"],"class可以给多个属性值":["16.2"],"多个属性值之间用空格隔开":["16.2"],"包含选择器":["16.2"],"只要有包含关系都能选中":["16.2"],"祖先":["16.2"],"后代":["16.2"],"msg":["17.1"],"小技巧":["17.1"],"tips":["17.1"],"加入":["17.1"],"joinus":["17.1"],"栏目标题":["17.1"],"title":["17.1","52.3","76.17","99.1","100.3","103.0"],"指南":["17.1","17.6"],"guild":["17.1","17.6"],"服务":["17.1","17.6"],"sidebar":["17.4"],"栏目":["17.4"],"column":["17.4","28.1"],"左右中":["17.4"],"菜单":["17.5"],"menu":["17.5"],"子菜单":["17.5"],"icon":["17.6"],"注释":["17.6"],"note":["17.6"],"service":["17.6"],"12px":["17.9"],"font9pt":["17.9"],"bottom":["17.10"],"尽量用英文":["17.11"],"font":["17.12","24.2","32.3"],"表单":["17.12"],"forms":["17.12"],"在放入cd的时候按下不放":["18.0"],"可以跳过自动播放cd":["18.0"],"在打开wo":["18.0"],"rd的时候按下不放":["18.0"],"可以跳过自启动的宏":["18.0"],"关闭当前应用程序":["18.0"],"spacebar":["18.0"],"打开程序最左上角的菜单":["18.0"],"切换当前程序":["18.0"],"将windows下运行的msdos窗口在窗口和全屏幕状态间切换":["18.0"],"print":["18.0"],"screen":["18.0"],"将当前屏幕以图象方式拷贝到剪贴板":["18.0"],"将当前活动程序窗口以图象方式拷贝到剪贴板":["18.0"],"关闭当前应用程序中的当前文本":["18.0"],"如word中":["18.0"],"f6":["18.0"],"切换到当前应用程序中的下一个文本":["18.0"],"加shift":["18.0"],"可以跳到前":["18.0"],"一个窗口":["18.0"],"在ie中":["18.0"],"arrow":["18.0"],"显示前一页":["18.0"],"前进键":["18.0"],"left":["18.0","26.1","27.9"],"显示后一页":["18.0"],"后退键":["18.0"],"在页面上的各框架中切换":["18.0"],"加shift反向":["18.0"],"刷新":["18.0"],"强行刷新":["18.0"],"键盘上每个键作用":["18.0"],"史上最全的":["18.0"],"f1帮助":["18.0"],"f2改名":["18.0"],"f3搜索":["18.0"],"f4地址":["18.0"],"f5刷新":["18.0"],"f6切换":["18.0"],"f10菜单":["18.0"],"a全选":["18.0"],"c复制":["18.0"],"x剪切":["18.0"],"v粘贴":["18.0"],"z撤消":["18.0"],"o打开":["18.0"],"delete永久删除":["18.0"],"delete删除":["18.0"],"enter属性":["18.0"],"f4关闭":["18.0"],"tab切换":["18.0"],"esc切换":["18.0"],"空格键窗口菜单":["18.0"],"esc开始菜单":["18.0"],"拖动某一项时按ctrl复制所选项目":["18.0"],"拖动某一项时按ctrl":["18.0"],"shift创建快捷方式":["18.0"],"将光盘插入到cd":["18.0"],"rom驱动器时按shift键阻止光盘自动播放":["18.0"],"切换到从左边数起第1":["18.0"],"个标签":["18.0"],"全部选中当前页面内容":["18.0"],"复制当前选中内容":["18.0"],"添加收藏":["18.0"],"面版":["18.0"],"把当前页面添加到收藏夹中":["18.0"],"打开或关闭":["18.0"],"侧边栏":["18.0"],"各种搜索引擎可选":["18.0"],"italic":["19.0"],"斜体":["19.0"],"oblique":["19.0"],"overline":["20.0"],"上划线":["20.0"],"line":["20.0","24.2"],"through":["20.0"],"删除线":["20.0"],"demo2":["21.1"],"demo3":["21.1"],"demo4":["21.1"],"demo5":["21.1"],"include":["21.2"],"editor":["21.2"],"span":["22.1","26.0","39.4"],"html元素一般分为":["22.1"],"是一个容器及盒子":["22.2"],"里面可以放行内或者块级元素":["22.2"],"文字类的元素内不能使用块级元素":["22.2"],"标签主要用于存放文字":["22.2"],"宽直接设置是无效的":["22.3"],"默认宽度就是它本身内容的宽度":["22.3"],"inline":["22.4"],"指定颜色":["23.1"],"请参阅":["23.1"],"参数":["23.2"],"背景图像不平铺":["23.3"],"center":["23.4","31.5"],"背景图像是随对象内容滚动":["23.5"],"哪个样式离结构近":["24.1"],"就执行哪个样式":["24.1"],"选择器为10":["24.4"],"id选择器100":["24.4"],"行内样式表为1000":["24.4"],"然后摆放到相应位置":["25.0"],"盒子边框与内容的距离":["25.1"],"style":["25.3"],"length":["25.4","62.13","68.5","86.15"],"由浮点数字和单位标识符组成的长度值":["25.4"],"双线边框":["25.5"],"两条单线与其间隔的和等于指定的border":["25.5"],"width值":["25.5"],"groove":["25.5"],"根据border":["25.5"],"2个值":["25.9"],"代表上下内边距是5像素左右内边距是10像素":["25.9"],"20px":["25.9"],"父元素有上外边距同时子元素也有上外边距":["25.11"],"此时父元素会塌陷较大的外边距值":["25.11"],"可选":["25.13","82.1"],"模糊距离":["25.13"],"阴影的尺寸":["25.13"],"垂直阴影的位置":["25.14"],"box盒子大小为width":["25.15"],"padding":["25.15"],"从左到右顺序排列":["26.0"],"碰到父元素边缘则自动换行":["26.0"],"元素不浮动":["26.1"],"默认值":["26.1"],"脱离标准普通流的控制":["26.2"],"浮":["26.2"],"移动到指定位置":["26.2"],"如果其中一个盒子浮动了":["26.3"],"那么其他兄弟也应该浮动":["26.3"],"不允许右侧有浮动元素":["26.4"],"清除右侧浮动的影响":["26.4"],"both":["26.4","26.9"],"父级添加after伪元素":["26.5"],"书写方便":["26.6"],"缺点":["26.6","26.7"],"代码简洁":["26.7"],"clear":["26.9"],"父级after伪元素":["26.10"],"结构语义化正确":["26.10"],"由于ie6":["26.10"],"7不支持":["26.10"],"after":["26.10","120.3"],"边偏移":["27.0"],"absolute":["27.2"],"绝对定位":["27.2"],"左侧偏移量":["27.3"],"定义元素相对于其父元素左边线的距离":["27.3"],"静态定位在布局时很少用到":["27.5"],"后面的盒子仍然以标准流的方式对待它":["27.6"],"不脱标":["27.6"],"如果祖先元素有定位":["27.7"],"固定定位不再占有原先的位置":["27.8"],"版心宽度的一半距离":["27.9"],"必须添加top":["27.10"],"默认是auto":["27.12"],"数值越大":["27.12"],"盒子越靠上":["27.12"],"如果属性值相同":["27.12"],"如果不给宽度或者高度":["27.14"],"但是绝对定位":["27.16"],"让一个元素在页面中隐藏或者显示出来":["28.0"],"将对象作为表格标题显示":["28.1"],"cell":["28.1"],"将对象作为表格单元格显示":["28.1"],"将对象作为表格列显示":["28.1"],"主要用来隐藏表格的行或列":["28.2"],"隐藏的行或列能够被其他内容使用":["28.2"],"总是显示滚动条":["28.3"],"默认是visible":["28.3"],"即溢出显示":["28.3"],"推出了第一个自定义图际字体生成器":["29.1"],"它允许用户选择所需要的图标":["29.1"],"使它们成一字型":["29.1"],"该字库内容种类繁多":["29.1"],"非常全面":["29.1"],"唯":["29.1"],"iefix":["29.2"],"opentype":["29.2"],"ttf":["29.2"],"主流设备分辨率":["30.1"],"一般使用iphone6":["30.1"],"高度固定":["30.5"],"需要注意什么问题":["31.1"],"组成部分":["31.3"],"弹性容器":["31.3"],"弹性盒子":["31.3"],"around":["31.4"],"弹性盒子沿主轴均匀排列":["31.4"],"空白间距均分在弹性盒子两侧":["31.4"],"沿侧轴居中排列":["31.5"],"stretch":["31.5"],"整数":["31.6"],"从右向左":["31.7"],"css":["31.8","51.1","80.2","120.1","123.5","124.0"],"flex":["31.8"],"相对":["32.2"],"单位":["32.2"],"rem单位是相对于":["32.2"],"html":["32.3"],"size":["32.3"],"40px":["32.3"],"rem单位的尺寸":["32.4"],"n":["32.4"],"1049px":["32.5"],"浏览器不识别less代码":["32.7"],"css不支持计算写法":["32.8"],"解决方案":["32.8","109.4"],"即可自动生成对应的css样式文件":["32.9"],"shift":["32.10"],"32px":["32.11"],"表示当前选择器":["32.12"],"通常配合伪类或伪元素使用":["32.12"],"使用变量":["32.13"],"css属性":["32.13"],"控制当前less文件导出路径":["32.15"],"less文件":["32.15"],"第一行":["32.15"],"height":["32.18"],"视口宽度大于等于1200px":["33.0"],"网页背景色是天蓝色":["33.0"],"only":["33.1"],"打印预览模式":["33.2"],"阅读器":["33.2"],"speech":["33.2"],"50px":["34.0"],"solid":["34.0"],"transparent":["34.0"],"表单轮廓":["35.0"],"move":["35.1"],"移动":["35.1"],"text":["35.1"],"input":["35.2","78.19"],"none":["35.3"],"bottom等":["36.0"],"提倡使用的":["36.0"],"默认":["37.0"],"设置或检索伸缩盒对象的子元素的排列方式":["38.2"],"1px正好压住相邻盒子边框":["39.1"],"鼠标经过某个盒子的时候":["39.1"],"提高当前盒子的层级即可":["39.1"],"price":["39.4"],"miaosha":["39.4"],"4f53":["40.0"],"宋体":["40.0"],"5b8b":["40.0"],"调整替换内容的带下":["41.0"],"以在填充元素的整个内容框时保持其长宽比":["41.0"],"该对象将被裁剪以适应":["41.0"],"css雪碧":["42.1"],"核心原理":["42.1"],"将网页中的一些小背景图像整合到一张大图中":["42.1"],"注意网页中的坐标有所不同":["42.2"],"因为一般情况下都是往上往左移动":["42.2"],"language":["43.1","43.4"],"www万维网的描述性语言":["43.1"],"xhtml指可扩展超文本标记语言":["43.1"],"标识语言":["43.1"],"extensible":["43.1"],"hypertext":["43.1"],"是一种置标语言":["43.1"],"表现方式与超文本标记语言":["43.1"],"类似":["43.1"],"这个标签必须放在整个页面的第一行":["43.2"],"必须放在开头":["43.2"],"其实对于文档显示来说":["43.3"],"定义成en的文档也可以显示中文":["43.3"],"定义成zh":["43.3"],"自动重命名配对的html":["43.4"],"xml标签":["43.4"],"chinese":["43.4"],"simplified":["43.4"],"简体中文":["43.4"],"pack":["43.4"],"for":["43.4","54.8","68.5"],"vscode汉化包":["43.4"],"eslint":["43.4"],"格式校验":["43.4"],"prettier":["43.4"],"需要设置缩进":["44.1"],"一层":["44.1"],"父子关系":["44.1"],"多层":["44.1"],"后代关系":["44.1"],"水平线":["44.2"],"hr":["44.2"],"上标":["44.2"],"sup":["44.2"],"下标":["44.2"],"sub":["44.2","85.11"],"倾斜":["44.3"],"s":["44.3","93.16"],"删除":["44.3"],"lt":["44.4","124.3"],"alt":["45.0"],"空链接":["46.0"],"单元格与单元格之间间距":["48.0"],"cellpadding":["48.0"],"单元格与内容之间间距":["48.0"],"caption":["48.0"],"表头":["48.0"],"colspan":["48.0"],"合并列":["48.0"],"实心方块":["49.0"],"radio":["50.1"],"单选":["50.1"],"checkbox":["50.1"],"多选":["50.1"],"input属性":["50.1"],"placeholder":["50.1"],"提示信息":["50.1"],"name":["50.2","92.0"],"表单域名称":["50.2"],"value":["50.4","77.4"],"disabled":["50.4"],"selected":["50.4"],"请选择城市":["50.4"],"北京":["50.4"],"他只用10天时间就把javascript设计出来了":["51.1"],"多肽语言":["51.1"],"基本语法":["51.1"],"借鉴c语言和java语言":["51.1"],"数据结构":["51.1"],"借鉴java语言":["51.1"],"服务端开发":["51.2"],"node":["51.2"],"bom":["52.0"],"操作符":["52.1"],"flatmap":["52.2"],"string":["52.2"],"trimstart":["52.2"],"trimend":["52.2"],"fromentries":["52.2"],"方":["52.2"],"head":["52.3","96.1"],"sample":["52.3"],"page":["52.3","95.8"],"可以与浏览器窗口进行互动的对象结构":["52.4"],"通过bom可以操作浏览器窗口":["52.4"],"vscode里面修改多行注释":["53.2"],"快捷键":["53.2"],"prompt":["53.3"],"变量是程序在":["54.2"],"给age这个变量赋值为10":["54.3"],"报错":["54.7","95.4"],"while":["54.8","76.14"],"变量名必须有意义":["54.8"],"mmd":["54.8"],"bbd":["54.8"],"同时也意味着相同的变量可用作不同的类型":["55.1"],"var":["55.1","55.3","65.6","76.14","85.5","85.8","86.8","86.10","87.2","87.3"],"x":["55.1","87.1","90.6"],"声明变量a但没有给值":["55.3"],"此时a":["55.3"],"7976931348623157e":["55.4"],"min":["55.4"],"5e":["55.4"],"数字型三个特殊值":["55.4"],"空格":["55.5"],"blank":["55.5"],"字符串长度":["55.5"],"字符串是由若干字符组成的":["55.5"],"布尔型和数字型相加的时候":["55.6"],"的值为":["55.6"],"否定的值会被转换为":["55.11"],"false":["55.11","62.14","122.9"],"如":["55.11"],"nan":["55.11","56.10"],"null":["55.11","56.10"],"undefined":["55.11","56.10"],"其余值都会被转换为":["55.11"],"true":["55.11","57.7","58.4","62.14","93.8"],"javascript":["55.11","62.7","70.5","70.6","78.13","84.0","90.3","91.2","109.5"],"console":["55.11","61.7","63.5","65.6","85.6","86.8","95.7","98.3","108.7"],"log":["55.11","60.6","61.7","65.6","85.6","86.8","98.3","108.7","108.11"],"boolean":["55.11","61.2"],"const":["55.12"],"debugger":["55.12"],"double":["55.12"],"enum":["55.12"],"export":["55.12"],"extends":["55.12"],"fimal":["55.12"],"float":["55.12"],"goto":["55.12"],"implements":["55.12"],"import":["55.12"],"int":["55.12"],"除":["56.2"],"所以":["56.3"],"返回给我们":["56.4"],"运算符":["56.5"],"放在变量后面时":["56.5"],"写起来更简单":["56.6","56.7"],"使用口诀":["56.6","56.7"],"判等号":["56.8"],"or":["56.9"],"乘":["56.11"],"逻辑运算符":["56.12"],"分支结构":["57.1"],"和":["57.1","82.2","90.2"],"执行流程":["57.4"],"条件成立执行的代码":["57.5"],"else":["57.5","68.2","69.5","69.9"],"否则":["57.5"],"条件表达式3":["57.6"],"语句3":["57.6"],"如果表达式1为":["57.7"],"则返回表达式2的值":["57.7"],"后面跟一个冒号":["57.8"],"表达式的值会与结构中的":["57.8"],"的值做比较":["57.8"],"如果存在匹配":["57.8"],"全等":["57.8"],"则与该":["57.8"],"关联的代码块会被执行":["57.8"],"语句有几种条件":["57.9"],"就得判断多少次":["57.9"],"④":["57.9"],"do":["58.3"],"用于确定每一次循环是否能被执行":["58.4"],"如果结果是":["58.4"],"就继续循环":["58.4"],"请你输入次数":["58.5"],"sdadasdds":["58.5"],"内循环的操作表达式":["58.6"],"需执行的代码":["58.6"],"内层循环可以看做外层循环的语句":["58.6"],"否则会成为死循环":["58.7"],"循环和":["58.7"],"①":["58.8"],"先执行一次循环体代码":["58.8"],"②":["58.8"],"再执行条件表达式":["58.8"],"的优雅方式":["60.1"],"小白":["60.3"],"小黑":["60.3"],"i必须从0开始":["60.7"],"索引号增加数组元素":["60.9"],"org":["61.0","93.7","94.3"],"其值的形式是通过":["61.1"],"默认为":["61.2"],"简单理解为能否遍历":["61.2"],"枚举里面的值":["61.2"],"因此可以称数组为数组对象":["61.3"],"运用此方法判断数组如下":["61.6"],"该方法的局限性在于":["61.6"],"当一个复杂数据类型为数组时":["61.6"],"它也是对象":["61.6"],"如果需要判断某个不可见的数据类型":["61.6"],"那么不能用于判断其是否为对象":["61.6"],"newarr":["61.6","68.5"],"res5":["61.7"],"必须小写":["62.3"],"由于函数一般是为了实现某个功能才定义的":["62.3"],"调用函数时传递":["62.7"],"不同的值进去":["62.7"],"带参数的函数声明":["62.7"],"function":["62.7","65.5","67.2","68.4","79.2","108.6"],"函数名":["62.7","80.7"],"注意点":["62.8"],"实参个数多于形参":["62.9"],"例子":["62.11"],"求任意两个数的加减乘除":["62.11"],"不仅可以退出循环":["62.12"],"i":["62.13","68.5","93.19"],"或者能被400整除":["62.14"],"isrunyear":["62.14"],"year":["62.14"],"flag":["62.14"],"函数可以调用另外一个函数":["62.14"],"fn1":["62.14"],"fun是变量名":["62.15"],"不是函数名":["62.15"],"增强了程序的可靠性":["63.1"],"未声明的变量":["63.7"],"无法调用":["63.7"],"if":["63.8","68.5","69.5","109.12"],"用链式查找决定哪些数据能被内部函数访问":["63.9"],"就称作作用域链":["63.9"],"代码执行":["64.1"],"案例四":["64.4"],"c":["64.4","111.5"],"相当于":["64.4"],"a是局部变量":["64.4"],"可以使用":["65.1"],"变量":["65.1"],"保存多个值":["65.1"],"采取":["65.3"],"对象名":["65.3"],"属性名":["65.3","65.8"],"二":["65.4"],"函数和方法":["65.4"],"函数是单独声明的":["65.4"],"并且调用的":["65.4"],"sayhi":["65.5"],"song":["65.6","85.6"],"ldh":["65.6"],"刘德华":["65.6"],"给这个新对象添加属性和方法":["65.7"],"以下有两个数组":["65.9"],"一个数组arr是班级里所有的学员的名称":["65.9"],"一个数组currentarr是提交了每日反馈的学员名单":["65.9"],"请创建一种算法":["65.9"],"把未提交每日反馈的学员筛选出来":["65.9"],"张瑞淑":["65.9"],"徐海涛":["65.9"],"谢岗岗":["65.9"],"薛鹏":["65.9"],"魏明杨":["65.9"],"党婷":["65.9"],"熊飞":["65.9"],"郑翠翠":["65.9"],"李航卫":["65.9"],"屈涛":["65.9"],"汪孝双":["65.9"],"代攀飞":["65.9"],"武志钰":["65.9"],"王亚龙":["65.9"],"周芙榕":["65.9"],"李涛":["65.9"],"郝颖":["65.9"],"文冲洋":["65.9"],"王旭拯":["65.9"],"胡佳豪":["65.9"],"寇晓丽":["65.9"],"马晓晗":["65.9"],"王思聪":["65.9"],"张绿":["65.9"],"李德":["65.9"],"郑萍":["65.9"],"张凯":["65.9"],"张嘉成":["65.9"],"葛云侠":["65.9"],"杨磊":["65.9"],"任变":["65.9"],"景德":["65.9"],"高卷林":["65.9"],"刘益凡":["65.9"],"赵娜":["65.9"],"陈章鸣":["65.9"],"张荣召":["65.9"],"赵凯旋":["65.9"],"程倩倩":["65.9"],"脱朝平":["65.9"],"刘吉利":["65.9"],"郭苗苗":["65.9"],"马建峰":["65.9"],"潘瑞":["65.9"],"闫翔":["65.9"],"马晨":["65.9"],"李轩轩":["65.9"],"黄红梅":["65.9"],"刘书彬":["65.9"],"罗强":["65.9"],"刘东":["65.9"],"王可可":["65.9"],"陈泽文":["65.9"],"李嘉琪":["65.9"],"段佳琦":["65.9"],"黄燕":["65.9"],"邱淑鸿":["65.9"],"则会返回":["66.0"],"return":["66.1","68.2"],"猜对了":["66.3"],"break":["66.3"],"第二种":["66.3"],"循环一定次数":["66.3"],"例如日期格式字符串为":["67.1"],"可以写成new":["67.1"],"getseconds":["67.2"],"封装时间":["67.2"],"gettime":["67.2"],"com":["67.3","82.1"],"date1":["67.4"],"秒":["67.5"],"arr1":["68.1"],"有一个包含工资的数组":["68.3"],"要求把数组钟工资超过2000的删除":["68.3"],"剩余的放到新数组中":["68.3"],"b":["68.4","111.5"],"分隔符":["68.6","69.7"],"june":["68.7"],"从0开始删除一个数组":["68.7"],"包括0":["68.7"],"把临时变量的值给str":["69.1"],"就是把简单数据类型包装成为复杂数据类型":["69.2"],"10000000000000000":["69.3"],"查找数组":["69.4"],"red":["69.4","88.1"],"的位置和出现次数":["69.4"],"blue":["69.4","88.1"],"green":["69.4","88.1"],"pink":["69.4","88.1"],"chars":["69.5"],"得到每一个字符串":["69.5"],"得到属性值":["69.5"],"如果有就自增":["69.5"],"如果没有就赋值1":["69.5"],"如果有就自增1":["69.5"],"字符串转数组":["69.7"],"splite":["69.7"],"将字符转换为数组":["69.7"],"split":["69.7"],"创建空对象":["69.9"],"把字符串转为对象属性":["69.9"],"检查对象属性是否存在":["69.9"],"如果存在则值自增1":["69.9"],"输出对象":["69.9"],"复杂数据类型":["70.1"],"在存储时变量中存储的仅仅是地址":["70.1"],"引用":["70.1"],"复杂数据类型存放在堆里面":["70.2"],"20220417002726814":["70.2"],"中":["70.3"],"栈空间":["70.4"],"里面存放的是地址":["70.4"],"https":["71.1"],"developer":["71.1"],"查看返回值的意义和类型":["71.2"],"已经定义了一系列的":["72.1"],"接口":["72.1"],"属性":["72.2"],"文本":["72.2"],"内部所有指定标签名的子元素":["73.2"],"获取的时候不包括父元素自己":["73.2"],"element":["73.2"],"getelementsbytagname":["73.2"],"③document":["73.3"],"的事件":["74.1"],"事件处理程序":["74.2"],"添加事件处理程序":["74.3"],"onmousemove":["74.4","78.23"],"鼠标移动触发":["74.4","78.23"],"div":["75.1","76.19","78.13","78.20","95.8","100.4"],"js里面的样式采取驼峰命名法":["75.2"],"比如fontsize":["75.2"],"setattribute":["75.7","75.10"],"class":["75.8","76.3","76.19","78.20","95.8"],"所以h5又了规定":["75.9"],"利用父子兄节点关系获取元素":["76.0"],"逻辑性强":["76.0"],"但兼容性较差":["76.0"],"为1":["76.1"],"属性节点":["76.1"],"为2":["76.1"],"文本节点":["76.1"],"为3":["76.1"],"demo":["76.3"],"是一个只读属性":["76.4"],"返回所有的子元素节点":["76.4"],"它只返回子元素节点":["76.4"],"同样":["76.5","76.11","76.12"],"我是li3":["76.6"],"我是li4":["76.6"],"找不到则返回null":["76.7","76.8","76.13"],"有兼容性问题":["76.7","76.8","76.13"],"body":["76.9","76.19","78.4","78.20","80.6","84.0","91.2","95.8","100.4"],"ol":["76.9"],"li":["76.9"],"我是li1":["76.9"],"el":["76.14"],"元素":["76.15","124.0","124.8"],"因为这些元素原先不存在":["76.15"],"方法将一个节点添加到父节点的指定子节点":["76.16"],"compatible":["76.17"],"ie":["76.17","78.3"],"edge":["76.17"],"document":["76.17","80.1","81.5"],"即只克隆复制节点本身":["76.18"],"不克隆里面的子节点":["76.18"],"如果括号参数为":["76.18"],"innner":["76.19"],"修改表单元素":["77.4"],"type":["77.4","78.19"],"父":["77.5"],"parentnode":["77.5"],"子":["77.5"],"得到dom的属性值":["77.6"],"能够说出事件委托的原理":["78.1"],"之前的":["78.3"],"不支持此方法":["78.3"],"可使用":["78.3"],"attachevent":["78.3"],"学完":["78.4"],"dom":["78.4"],"事件流后":["78.4"],"我们再进一步学习":["78.4"],"事件类型字符串":["78.5"],"比如":["78.5"],"onclick":["78.5","81.5"],"onmouseover":["78.5"],"on":["78.6","78.9","78.11"],"可选参数":["78.8"],"是一个布尔值":["78.8"],"默认是":["78.8"],"这里要带":["78.9"],"detachevent":["78.11"],"加深理解":["78.12"],"我们向水里面扔一块石头":["78.12"],"首先它会有一个下降的过程":["78.12"],"这个过程就可以理解为从最顶层向事件发生的最具体元素":["78.12"],"目标点":["78.12"],"一个父盒子一个子盒子":["78.13"],"我们的需求是当点击父盒子时弹出":["78.13"],"当点击子盒子时弹出":["78.13"],"在这里插入图片描述":["78.14"],"这是因为冒泡阶段开始时由最具体的元素接收":["78.14"],"然后逐级向上传播到到":["78.14"],"鼠标触发事件的话":["78.16"],"会得到鼠标的相关信息":["78.16"],"如鼠标位置":["78.16"],"键盘触发事件的话":["78.16"],"会得到键盘的相关信息":["78.16"],"如按了哪个键":["78.16"],"event":["78.17","78.21"],"中获取查找":["78.17"],"解决":["78.17"],"比如不让链接跳转":["78.18"],"阻止冒泡":["78.18"],"submit":["78.19"],"window":["78.21"],"我是一段不愿意分享的文字":["78.24"],"pagey":["78.25"],"返回鼠标相对于文档页面的y坐标":["78.25"],"比如左右箭头":["78.26"],"等":["78.26"],"三个事件的执行顺序是":["78.26"],"keypress":["78.27"],"不识别功能键":["78.27"],"但是":["78.27"],"dom就是把文档当作一个对象看待":["79.1"],"把":["79.1","123.2"],"浏览器当作一个对象来看待":["79.1"],"dom的顶级对象是document":["79.1"],"定义在全局作用域中的函数会变成window对象的方法":["79.2"],"fn":["79.2","90.9","95.7"],"则没有限制":["80.1"],"domcontentloaded":["80.1"],"innerwidth":["80.3"],"当前屏幕的宽度":["80.3"],"这个调用函数我们也称为":["80.5"],"回调函数":["80.5"],"callback":["80.5"],"或者写函数名":["80.7"],"或者采取字符":["80.7"],"button":["80.8","88.2","89.7"],"点击":["80.8","89.7"],"单线程就意味着":["81.1"],"所有任务需要排队":["81.1"],"前一个任务结束":["81.1"],"才会执行后一个任务":["81.1"],"js":["81.3","108.3","123.4"],"中出现了同步和异步":["81.3"],"同步":["81.3"],"第三个问题":["81.5"],"所以我们将这个属性也称为":["82.0"],"域名":["82.1"],"itheima":["82.1"],"端口号":["82.1"],"锚点":["82.2"],"重点记住":["82.2"],"需求":["82.2"],"强制刷新":["82.3"],"ctrl":["82.3"],"mqqbrowser":["83.0"],"juc":["83.0"],"fennec":["83.0"],"wosbrowser":["83.0"],"browserng":["83.0"],"webos":["83.0"],"symbian":["83.0"],"后退1个页面":["84.0"],"href":["84.0"],"使用的时候一个一个的依次调用就可以了":["85.1"],"具有另一个类的所有属性和方法":["85.2"],"同时它还可以有另一个类不具备的方法和属性":["85.2"],"多态性":["85.2"],"方法":["85.3"],"事物的行为":["85.3"],"对象特指某一个":["85.4"],"abc":["85.5"],"constructor里面的this指向实例对象":["85.12"],"方法里面的this指向这个方法的调用者":["85.12"],"非常重要声明全局变量":["85.12"],"that":["85.12"],"大多数高版本的浏览器也也支持es6":["86.1"],"不过实现了es6部分特性和功能":["86.1"],"proto":["86.6"],"20220427223414073":["86.7"],"sing":["86.8"],"调用原型对象的方法":["86.9"],"l":["86.10"],"new":["86.10"],"k":["86.10"],"wqe":["86.10"],"prototype原型":["86.12"],"object的原型对象":["86.13"],"依此类推一直找到object为止":["86.13"],"需要调用才可以确定":["86.14"],"this":["86.15","91.6"],"被称为":["87.0"],"此时指向o对象":["87.1"],"调用参数":["87.1"],"exam":["87.3"],"wqeqwe":["87.3"],"son1":["87.3"],"类和构造函数实现的功能相同":["87.4"],"类就是另一种写法":["87.4"],"那么这个方法就是语法糖":["87.5"],"就返回true":["88.1"],"如果查找不到就返回false":["88.1"],"如果找到第一个满足条件的元素":["88.1"],"则终止循环":["88.1"],"不再继续查找":["88.1"],"filtter":["88.1"],"返回一个新数组":["88.1"],"返回所有满足条件的元素":["88.1"],"返回布尔值":["88.1"],"如果查找到第一个满足的元素就停止":["88.1"],"diani":["88.2"],"默认为false":["88.3"],"enumerable":["88.3"],"目标属性是否可以被枚举":["88.3"],"false默认为false":["88.3"],"是否可遍历":["88.3"],"也不方便书写":["89.1"],"因此较少使用":["89.1"],"所有函数都是":["89.1"],"立即执行函数":["89.2","89.3"],"定时器函数":["89.3"],"因为它就是调用函数":["89.5","89.6"],"因此当我们想改变":["89.5"],"指向":["89.5"],"因此":["89.6"],"主要跟数组有关系":["89.6"],"主要应用场景":["89.8"],"call经常做继承":["89.8"],"增加运行速度":["90.1"],"禁用了在ecmascript的未来版本中可能会定义的一些语法":["90.1"],"为未来新版本的javascript做好铺垫":["90.1"],"所以可以将整个脚本文件放在一个立即执行的匿名函数之中":["90.3"],"这样独立创建一个作用域而不影响其他script脚本文件":["90.3"],"delete":["90.6"],"语法是错误的":["90.6"],"定时器this还是指向window":["90.7"],"mdn":["90.8"],"mozilla":["90.8","93.7"],"此时":["90.9"],"当函数执行完毕":["91.1"],"局部作用域":["91.3"],"当执行到":["91.3"],"fn2":["91.3"],"大猪蹄子":["91.5"],"getnamefunc":["91.6"],"步骤分解":["91.6"],"先立即执行对象的函数":["91.6"],"f":["91.6","95.2","98.5"],"家电":["92.0"],"goods":["92.0"],"gname":["92.0"],"冰箱":["92.0"],"海尔":["92.0"],"美的":["92.0"],"洗衣机":["92.0"],"in":["92.2"],"object":["92.3"],"属于简单数据类型":["92.3"],"匹配":["93.2"],"此外":["93.2"],"正则表达式还常用于过滤掉页面内容中的一些敏感词":["93.2"],"实际开发":["93.3"],"一般都是直接复制写好的正则表达式":["93.3"],"但是要求会使用正则表达式并且根据实际情况修改正则表达式":["93.3"],"比如用户名":["93.3"],"通过字面量创建":["93.5"],"regexobj是写的正则表达式":["93.6"],"中任意一个字符":["93.10"],"z0":["93.11"],"只能输入26个字母和数字":["93.11"],"如果中括号里面有":["93.11"],"m":["93.12"],"重复n到m次":["93.12"],"类":["93.14"],"如果不符合正则规范":["93.14"],"wrong":["93.14"],"重复3次":["93.15"],"abccc":["93.15"],"匹配空格":["93.16"],"包括换行符":["93.16"],"制表符":["93.16"],"空格符等":["93.16"],"t":["93.16"],"腾讯qq号从10000开始":["93.17"],"昵称是中文":["93.17"],"u4e00":["93.17"],"andy":["93.18"],"baby":["93.18"],"忽略大小写":["93.19"],"开发和认可电信和计算机标准":["94.1"],"international":["94.3"],"幂运算符":["94.4"],"数组扩展":["94.4"],"async":["94.4"],"await":["94.4"],"关键字":["94.4"],"第8版":["94.4"],"2017年":["94.4"],"字符串扩展":["94.4"],"第9版":["94.4"],"谷歌":["94.5"],"微软":["94.5"],"因特尔等":["94.5"],"高效":["94.6"],"es6是前端发展趋势":["94.6"],"kangax":["94.7"],"不存在变量提升":["95.1"],"identifier":["95.3"],"uncaught":["95.4"],"referenceerror":["95.6"],"is":["95.6"],"not":["95.6"],"defined":["95.6"],"container":["95.8"],"h2":["95.8"],"header":["95.8"],"meta":["96.1"],"charset":["96.1","98.1"],"utf":["96.1","98.1"],"解构赋值":["97.1"],"重复五次":["98.4"],"r":["98.5"],"简化对象写法":["99.1"],"箭头函数不能作为构造函数实例化":["100.2"],"箭头函数":["100.3"],"id":["100.4"],"函数参数默认值":["101.1"],"rest参数":["102.1"],"d1":["103.1"],"item":["103.3","103.4","103.5"],"let":["103.6"],"array1":["103.6"],"大大的学问":["104.1"],"codingweb的博客":["104.1"],"返回该对象对应的原始类型值":["104.4"],"tostringtag":["104.4"],"在该对象上面调用":["104.4"],"tostring":["104.4"],"方法时":["104.4"],"unscopables":["104.4"],"该对象指定了使用":["104.4"],"with":["104.4"],"关键字时":["104.4"],"哪些属性会被":["104.4"],"with环境排除":["104.4"],"特别的":["104.4"],"symbol内置值的使用":["104.4"],"调用迭代器对象的":["105.0"],"方法可以得到":["105.0"],"语句后的值":["105.0"],"工作原理":["106.1"],"创建一个指针对象":["106.1"],"指向当前数据结构的起始位置":["106.1"],"prototype":["107.0","113.1"],"module":["108.1"],"exports":["108.1"],"对象":["108.1"],"模块化":["108.2"],"适用于服务器端的":["108.2"],"每个":["108.3"],"文件都是一个独立的模块":["108.3"],"导入其它模块成员使用":["108.3"],"或更高版本的":["108.4"],"在":["108.4"],"按需导出与按需导入":["108.5"],"show":["108.6"],"default":["108.8"],"20220518232154869":["108.9"],"20220518233123466":["108.12"],"再延时3秒后输出":["109.1"],"promise":["109.2","112.1"],"成功的回调函数":["109.3"],"失败的回调函数":["109.3"],"从而支持我们基于":["109.5"],"的方式读取文件的内容":["109.5"],"r2":["109.6","109.8"],"通":["109.7"],"过":["109.7"],"err":["109.12"],"datastr":["109.12"],"链式调用的优点":["110.1"],"如果前一个任务非常耗时":["111.1"],"异步任务由javascript":["111.2"],"委托给":["111.2"],"主线程的执行栈被清空后":["111.3"],"会读取任务队列中的回调函数":["111.3"],"次序执行":["111.3"],"所以整个的这种运行机制又称为eventloop":["111.4"],"then":["112.1"],"catch":["112.1"],"则执行完所有微任务之后":["112.2"],"20220519160434426":["112.4"],"yui":["113.1"],"dojo":["113.1"],"ext":["113.1"],"事件处理":["113.2"],"动画设计和ajax交互":["113.2"],"学习jquery的本质":["113.2"],"有着丰富的第三方的插件":["113.3"],"例如":["113.3"],"3x":["114.0"],"不同于原生js中的load事件是等页面文档":["114.1"],"外部js文件":["114.1"],"把元素利用":["114.2"],"利用":["114.3"],"对dom对象包装后产生的对象":["114.3"],"index":["114.4"],"index是索引号":["114.4"],"odd":["115.4"],"fisrt":["115.5"],"查找当前元素之后所有的同辈元素":["115.5"],"prevtall":["115.5"],"last":["115.5"],"prevall":["115.5"],"查找当前元素之前所有的同辈元素":["115.5"],"hasclass":["115.5"],"sibling":["115.6"],"设置多个样式":["116.1"],"切换类":["116.2"],"切换":["117.3"],"fadeto":["117.4"],"三种预定速度之一的字符串":["117.5"],"slow":["117.5"],"写到动画或者效果的前面":["117.8"],"设置元素的内容":["119.1"],"内容":["119.2"],"设置元素内容":["119.3"],"color":["120.1"],"border":["121.1"],"获取元素偏移":["121.2"],"获取带有定位父元素的位置":["121.2"],"keydown":["122.2"],"keyup":["122.2"],"元素的子元素选择器":["122.4"],"接触某个事件":["122.6"],"p":["122.6"],"第三种自动触发":["122.8"],"或者return":["122.9"],"把原来对象里面的":["123.1"],"复杂数据类型的地址":["123.1"],"拷贝给目标对象":["123.1"],"修改目标对象会影响被拷贝对象":["123.1"],"深拷贝":["123.1"],"改为jquery":["123.2"],"css3的插件库":["123.3"],"js演示":["123.5"],"dowebok":["123.5"],"play":["123.5"],"它基于已经存在的":["124.0"],"选取所有元素":["124.1"],"prev":["124.2"],"获取id为one的元素的前面紧邻的同辈":["124.2"],"所以获取元素范围大小顺序依次为":["124.2"],"选取索引大于4的":["124.3"],"选取索引小于4的":["124.3"],"选取所有含有":["124.4"],"元素的":["124.4"],"选取所有可见的":["124.5"],"en":["124.6"],"选取属性title等于":["124.6"],"或以":["124.6"],"为前缀":["124.6"],"该字符串后跟一个连字符":["124.6"],"中的最后一个":["124.7"],"select":["124.8"],"选取所有的图像按钮":["124.9"],"reset":["124.9"],"选取所有的重置按钮":["124.9"]},{"0":["7.0","68.3","81.2"],"1":["5.2","43.4","55.6","62.13","65.6","76.14","85.6","85.10"],"2":["25.15","36.0","43.2","57.5","57.6","61.1","85.10","85.11","86.8","123.2"],"3":["10.0","11.6","16.2","25.11","30.2","68.1","69.1","78.10","107.0","109.6","109.8","109.10","109.11","110.2","110.3","112.3"],"4":["6.2","10.0","44.1","67.4","69.6","71.2","77.4","85.11","95.1","108.12","114.1"],"5":["46.0","56.2","86.13","100.2","111.3"],"6":["42.2","55.1"],"7":["30.1","56.12"],"8":["104.4"],"9":["51.2","93.3"],"10":["67.2","103.6"],"11":["79.2","88.1","109.12"],"15":["103.5"],"18":["65.6","87.2","87.3"],"50":["11.2"],"68":["32.4"],"81":["54.5"],"100":["87.3"],"111":["62.14"],"222":["62.14"],"300":["117.1"],"400":["116.1"],"875":["86.10"],"1200":["14.2"],"3000":["81.5"],"21312":["86.8"],"可以大量使用这些新特性":["1.0"],"这些新标签页面中可以使用多次":["2.0"],"在ie9中":["2.0"],"需要把这些元素转换为块级元素":["2.0"],"meta":["3.1","104.4"],"当页面加载后只载入元数据":["3.1"],"none":["3.1","41.0"],"当页面加载后不载入视频":["3.1"],"注意":["3.1","5.1","26.6","31.6","43.3","70.2","73.2"],"若使用了autoplay":["3.1"],"则向用户显示控件":["3.2"],"比如播放按钮":["3.2"],"loop":["3.2"],"不使用controls控件":["3.3"],"手机号码":["4.0"],"search":["4.0"],"搜索框":["4.0"],"需要放在表单内":["4.1"],"同时加上name属性":["4.1"],"同时成功提交":["4.1"],"属性且值中含有val的e元素":["5.1"],"类选择器":["5.1"],"偶数":["5.2"],"odd":["5.2"],"奇数":["5.2"],"child会把所有的盒子都进行排序":["5.2"],"执行时首先看排序nth":["5.2"],"第一行第一个字的内容":["5.3"],"line":["5.3"],"第一行的内容":["5.3"],"优化":["6.1"],"image":["6.1","23.5","25.8","30.1","32.13","44.4","57.4","70.4","86.12","89.1","91.5","122.4"],"小米商城":["6.2"],"小米5s":["6.2"],"红米note":["6.2"],"服装服饰":["6.3"],"母婴":["6.3"],"图书":["6.3"],"食品等数万个品牌优质商品":["6.3"],"配件":["6.4"],"手表":["6.4"],"存储卡":["6.4"],"京东":["6.4"],"对于我们前端人员来说":["6.4"],"直接给font":["7.0"],"size":["7.0"],"就看不到文字了":["7.0"],"京东的做法":["7.0"],"这个参数可设置css长度值":["8.1"],"但不接受百分比值":["8.1"],"若没有设置值":["8.2"],"默认是1":["8.2"],"若未设置":["8.3","8.6"],"值默认是0":["8.3","8.6"],"该值虽然没有最大值":["8.4"],"超过360deg的值相当于又绕一圈":["8.4"],"webkit":["8.5"],"以及一些其他浏览器":["8.5"],"不支持第四个长度":["8.5"],"如果加了也不会渲染":["8.5"],"该值可能的关键字和标记":["8.5"],"颜色值基于浏览器":["8.5"],"在gecko":["8.5"],"firefox":["8.5"],"presto":["8.5"],"默认是ease":["10.0"],"可以省略":["10.0"],"rotate":["11.0"],"缩放":["11.0"],"表示x轴方向移动距离":["11.1"],"复合写时位移放在前面":["11.1"],"不会影响到其他元素的位置":["11.2"],"translate中的百分比单位是相对于自身元素的translate":["11.2"],"负时":["11.3"],"为逆时针":["11.3"],"bottom":["11.4","23.4"],"同时修改宽高":["11.5"],"不影响其他盒子":["11.5"],"当我们同时有位移和其他属性的时候":["11.6"],"origin":["11.7"],"xy":["11.7"],"参数可以百分比":["11.7"],"像素或者是方位名词":["11.7"],"连续自动播放等效果":["12.0"],"1000px":["12.1"],"调用动画":["12.1"],"animation":["12.1"],"name":["12.1","75.11","78.19","104.4"],"持续时间":["12.1"],"state":["12.2"],"规定动画是否正在运行或暂停":["12.2"],"running":["12.2"],"还有":["12.2","66.3"],"linear":["12.3"],"2s":["12.3"],"infinite":["12.3"],"alternate":["12.3"],"动画以低速开始和结束":["12.4"],"steps":["12.4"],"20230414210322831":["13.0"],"属性":["14.0","52.2"],"transform":["14.0"],"取值正负均可":["14.1"],"像素单位数值":["14.1"],"数值一般在800":["14.2"],"用来设置自定义旋转轴的位置及旋转的角度":["14.3"],"3d":["14.4"],"使子元素处于真正的3d空间":["14.4"],"默认值flat":["14.4"],"x":["14.5","68.5"],"y":["14.5"],"用来表现xhtml或者xml等样式文件的计算机语言":["15.1"],"1998年5月21日由w3c正式推出的css2":["15.1"],"外部导入样式表":["15.2"],"内联样式表":["15.2"],"20230414171747804":["16.1"],"父子选择器":["16.2"],"只能通过父元素选择子元素":["16.2"],"只能往下选择一层":["16.2"],"父元素":["16.2"],"子元素":["16.2"],"service":["17.1"],"状态":["17.1"],"status":["17.1"],"投票":["17.1","17.6"],"vote":["17.1","17.6"],"尾":["17.1"],"合作伙伴":["17.1"],"partner":["17.1"],"left":["17.4","23.4","27.10","34.0"],"right":["17.4","23.4","26.1","27.3","27.10"],"center":["17.4"],"submenu":["17.5"],"标题":["17.5"],"title":["17.5","96.1","98.1"],"热点":["17.6"],"hot":["17.6"],"新闻":["17.6"],"news":["17.6"],"下载":["17.6"],"download":["17.6"],"ff8600":["17.8"],"尽量不缩写":["17.11"],"除非一看就明白的单词":["17.11"],"补丁":["17.12"],"mend":["17.12"],"简易收集":["18.0"],"面板":["18.0"],"历史":["18.0"],"收藏夹":["18.0"],"另":["18.0"],"将所有垂直平铺或水平平铺或层叠的窗口恢复":["18.0"],"关闭除当前和锁定标签外的所有标签":["18.0"],"可以在当前页面打开iternet地址或其他文件":["18.0"],"新建一个空白窗口":["18.0"],"可更改":["18.0"],"maxthon选项":["18.0"],"标签":["18.0"],"可以打印网页":["18.0"],"图片什么的":["18.0"],"添加到过滤列表":["18.0"],"将当前页面地址发送到过滤列表":["18.0"],"刷新当前页面":["18.0"],"保存网页":["18.0"],"可以将当前页面所有内容保存下来":["18.0"],"垂直平铺所有窗口":["18.0"],"粘贴当前剪贴板内的内容":["18.0"],"关闭当前标签":["18.0"],"窗口":["18.0"],"剪切当前选中内容":["18.0"],"一般只用于文本操作":["18.0"],"重做刚才动作":["18.0"],"撤消刚才动作":["18.0"],"按页面打开的先后时间顺序向前切换标签":["18.0"],"f11":["18.0"],"隐藏或显示菜单栏":["18.0"],"以小菜单方式向下切换标签":["18.0"],"域名自动完成url":["18.0"],"http":["18.0"],"www":["18.0","29.1"],"com":["18.0"],"url":["18.0"],"当输入焦点在搜索栏中时":["18.0"],"为高亮关键字":["18.0"],"拖曳":["18.0"],"保存该链接的地址或已选中的文本或指定的图片到一个文件夹中":["18.0"],"保存目录可更改":["18.0"],"小键盘":["18.0"],"当前页面放大20":["18.0"],"当前页面缩小20":["18.0"],"恢复当前页面的缩放为原始大小":["18.0"],"indent":["20.0"],"文本缩进":["20.0"],"em":["20.0"],"文字":["20.0"],"height":["20.0","116.1"],"demo6":["21.1"],"tab":["21.1"],"电视剧的卡了":["21.1"],"的撒":["21.1"],"formatonsave":["21.2"],"true":["21.2","55.7","55.8","61.7","76.18","78.21","88.1"],"块元素":["22.1"],"和":["22.1","23.1","78.18"],"行内元素":["22.1"],"因此p":["22.2"],"里面不能放块级元素":["22.2"],"特别是不能放":["22.2"],"同理":["22.2"],"行内元素只能容纳文本或其他行内元素":["22.3"],"链接里面不能再放链接":["22.3"],"特殊情况链接":["22.3"],"里面可以放块级元素":["22.3"],"转换为行内块":["22.4"],"颜色单位":["23.1"],"附录":["23.1"],"无背景图":["23.2"],"背景图像在横向上平铺":["23.3"],"背景图像固定":["23.5"],"样式不冲突":["24.1"],"不会层叠":["24.1"],"这些元素开头的可以继承":["24.2"],"以及color属性":["24.2"],"body行高1":["24.3"],"5这样写法最大的优势就是里面子元素可以根据自己文字大小自动调整行高":["24.3"],"important无穷大":["24.4"],"继承的权重是0":["24.4"],"如果该元素没有直接选中":["24.4"],"往盒子里面装内容":["25.0"],"margin":["25.1","121.1"],"盒子与盒子之间的距离":["25.1"],"color":["25.3","34.0"],"不可为负值":["25.4"],"请参阅":["25.4"],"color的值画3d凹槽":["25.5"],"ridge":["25.5"],"color的值画菱形边框":["25.5"],"inset":["25.5"],"表示相邻边框合并在一起":["25.8"],"3个值":["25.9"],"代表上内边距5像素左右内边距10像素下内边距20像素":["25.9"],"可以为父元素定义上边框":["25.11"],"可以为父元素定义上内边距":["25.11"],"可以为父元素添加overflow":["25.11"],"阴影的颜色":["25.13"],"请参阅css颜色值":["25.13"],"可选":["25.14"],"模糊的距离":["25.14"],"以前默认的":["25.15"],"a":["26.0","32.10","68.5","93.3"],"i":["26.0","39.4","66.3","68.3","83.0","109.5"],"em等":["26.0"],"元素向左浮动":["26.1"],"动":["26.2"],"俗称脱标":["26.2"],"以防止引起问题":["26.3"],"浮动的盒子只会影响浮动盒子后面的标准流不会影响前面的标准流":["26.3"],"同时清除左右两侧浮动的影响":["26.4"],"我们实际工作中":["26.4"],"几乎只用clear":["26.4"],"父级添加双伪元素":["26.5"],"添加许多无意义的标签":["26.6"],"结构化较差":["26.6"],"无法显示溢出的部分":["26.7"],"ie6":["26.8"],"7专有":["26.8"],"zoom":["26.8","26.9"],"兼容性问题":["26.10"],"父级双伪元素":["26.10"],"定位模式用于指定一个元素在文档中的定位方式":["27.0"],"边偏移则决定了该元素的最终位置":["27.0"],"fixed":["27.2"],"固定定位":["27.2","27.7"],"继续保留原来位置":["27.6"],"因此":["27.6","108.2"],"相对定位并没有脱标":["27.6"],"相对":["27.7"],"绝对":["27.7"],"固定定位也是脱标的":["27.8"],"其实固定定位也可以看作是一种特殊的绝对定位":["27.8"],"多走版心宽度的一半位置":["27.9"],"就可以让固定定位的盒子贴着版心右侧对齐了":["27.9"],"则按照书写顺序":["27.12"],"后来居上":["27.12"],"数字后面不能加单位":["27.12"],"默认大小是内容的大小":["27.14"],"group":["28.1"],"将对象作为表格列组显示":["28.1"],"header":["28.1","124.3"],"将对象作为表格标题组显示":["28.1"],"footer":["28.1"],"对于表格外的其他对象":["28.2"],"其作用等同于hidden":["28.2"],"ie5":["28.2"],"一般情况下":["28.3"],"我们都不想让溢出的内容显示出来":["28.3"],"因为溢出的部分会影响布局":["28.3"],"但是如果有定位的盒子":["28.3"],"的遗憾是国外服务器":["29.1"],"打开网速较慢":["29.1"],"阿里iconfont字库":["29.1"],"iconfontcn":["29.1"],"truetype":["29.2"],"woff":["29.2"],"8来设置":["30.1"],"视口宽度":["30.2"],"设备宽度":["30.2"],"20230415001716818":["30.4"],"浮动的盒子脱标":["31.1"],"主轴":["31.3"],"侧轴":["31.3"],"交叉轴":["31.3"],"空白间距均分在相邻盒子之间":["31.4"],"弹性盒子沿着主轴线被拉伸至铺满容器":["31.5"],"需要取消子集高度":["31.5"],"如果盒子没有高度":["31.5"],"则自动拉伸":["31.5"],"只占用父盒子剩余尺寸":["31.6"],"从下向上":["31.7"],"主轴更换后":["31.7"],"justify":["31.7"],"调整对齐方式":["31.8"],"align":["31.8"],"content":["31.8","104.4"],"html标签的字号":["32.2"],"计算结果":["32.2"],"1rem":["32.2"],"320px":["32.3"],"竖屏":["32.5","33.3"],"orientation":["32.5","33.3"],"portrait":["32.5","33.3"],"横屏":["32.5"],"目前阶段":["32.7"],"网页要引入对应的css文件":["32.7"],"可以通过less实现":["32.8"],"alt":["32.10"],"20220409171259440":["32.12"],"添加如下代码":["32.15"],"注意文件夹名称后面添加":["32.15"],"1vh":["32.18"],"100视口宽度":["32.19"],"1200px":["33.0"],"not":["33.1","35.1","56.9"],"屏幕阅读模式":["33.2"],"不区分类型":["33.2"],"all":["33.2"],"屏幕方向":["33.3"],"防止表单域拖拽":["35.0"],"文本":["35.1"],"allowed":["35.1"],"把图片转换为块级元素display":["36.0"],"元素放置在父元素的基线上":["37.0"],"把元素的顶端与行中最高元素的顶端对齐":["37.0"],"文字用省略号替代超出的部分":["38.1"],"text":["38.1","93.14"],"orient":["38.2"],"vertical":["38.2"],"要限制盒子高度":["38.2"],"更推荐让后台人员来做这个效果":["38.2"],"如果没有有定位":["39.1"],"则加相对定位":["39.1"],"保留位置":["39.1"],"如果有定位":["39.1"],"orign":["39.4"],"微软雅黑":["40.0"],"5fae":["40.0"],"不对替换内容调整大小":["41.0"],"scale":["41.0"],"这样服务器只需要一次请求就可以了":["42.1"],"精灵技术目的":["42.1"],"所以数值是负值":["42.2"],"使用精灵图的时候需要精确测量":["42.2"],"不过语法上更加严格":["43.1"],"元素必须被正确地嵌套":["43.1"],"元素必须被关闭":["43.1"],"xhtml标签名必须用小写字母":["43.1"],"文档必须拥有根元素":["43.1"],"html5指的是html的第五次重大修改":["43.1"],"第5个版本":["43.1"],"html5":["43.1"],"是":["43.1"],"不是一个html标签":["43.2"],"它就是一个文档类型声明标签":["43.2"],"只有处于":["43.2"],"cn的文档也可以显示英文":["43.3"],"这里说的英文网页和中文网页主要是指":["43.3"],"自动格式化代码":["43.4"],"easy":["43.4"],"less":["43.4"],"less样式支持":["43.4"],"open":["43.4"],"in":["43.4","69.5","69.9"],"browser":["43.4"],"右键选择浏览器打开html文件":["43.4"],"regex":["43.4"],"previewer":["43.4"],"预览正则表达式效果":["43.4"],"npm":["43.4","109.5"],"intellisense":["43.4"],"npm快速引包":["43.4"],"文件命名规范":["43.4"],"html的框架结构":["44.1"],"head":["44.1","104.4"],"下划线":["44.2","44.3"],"u":["44.2","44.3"],"删除线":["44.2"],"s":["44.2"],"sub和sup":["44.3"],"大于小于":["44.4"],"图片不显示之后的提示信息":["45.0"],"下载链接":["46.0"],"网页元素链接":["46.0"],"必须赋给td":["48.0"],"rowspan":["48.0"],"合并行":["48.0"],"thead":["48.0"],"定义头部":["48.0"],"disc":["49.0"],"不占位":["50.1"],"value":["50.1","69.9","78.19"],"就是input的值":["50.1"],"占位":["50.1"],"maxlength":["50.1"],"限制输入内容的长度":["50.1"],"字段名":["50.1"],"区分多个表单域":["50.2"],"各种表单元素控件":["50.2"],"textarea":["50.3","50.4","76.17"],"rows":["50.3"],"上海":["50.4"],"用户注册":["50.4"],"包括将值分成原始值和对象两大类":["51.1"],"函数的用法":["51.1"],"借鉴scheme语言和awk语言":["51.1"],"将函数当作第一等公民":["51.1"],"并引入闭包":["51.1"],"原型继承模型":["51.1"],"借鉴self语言":["51.1"],"控制硬件":["51.2"],"物联网":["51.2"],"ruff":["51.2"],"20220411220654228":["52.0"],"全局对象":["52.1"],"法":["52.2"],"以及":["52.2"],"symbol":["52.2"],"description":["52.2"],"明确定义了":["52.2"],"function":["52.2","68.5","122.6"],"body":["52.3","76.17","80.3","82.2","82.3","89.2","89.3","90.6","90.8","93.12","93.14","97.1","98.1","99.1","100.3","101.1","102.1","103.0"],"p":["52.3"],"hello":["52.3"],"world":["52.3"],"比如弹出框":["52.4"],"控制浏览器跳转":["52.4"],"外部引入js":["53.1"],"引入js不能在标签内写代码":["53.1"],"写了也不执行":["53.1"],"ctrl":["53.2"],"shift":["53.2"],"info":["53.3"],"浏览器弹出输入框":["53.3"],"用户可以输入":["53.3"],"内存":["54.2"],"中申请一块用来存放数据的空间":["54.2"],"两种声明赋值方法":["54.3"],"javascript":["54.3","70.3","74.2","78.17","78.26","78.27","82.2","82.3","89.2","89.3","90.6","90.7","93.12","93.14","93.17","104.4"],"声明":["54.3"],"最后的结果就是81因为18被覆盖掉了":["54.5"],"nl":["54.8"],"age":["54.8"],"遵守驼峰命名法":["54.8"],"首字母小写":["54.8"],"后面单词的首字母需要大写":["54.8"],"myfirstname":["54.8"],"x为数字":["55.1"],"null":["55.3","86.13"],"infinity":["55.4"],"代表无穷大":["55.4"],"大于任何数值":["55.4"],"代表无穷小":["55.4"],"小于任何数值":["55.4"],"nan":["55.4","55.7","66.0"],"这些字符的数量就是字符串的长度":["55.5"],"通过字符串的":["55.5"],"length":["55.5","68.3","69.4"],"属性可以获取整个字符串的长度":["55.5"],"字符串拼接":["55.5"],"多个字符串之间可以使用":["55.5"],"进行拼接":["55.5"],"interface":["55.12"],"long":["55.12"],"mative":["55.12"],"package":["55.12","108.4"],"private":["55.12"],"protected":["55.12","115.5"],"public":["55.12"],"short":["55.12"],"static":["55.12"],"super":["55.12","85.9"],"synchronized":["55.12"],"throws":["55.12"],"取余数":["56.2"],"取模":["56.2"],"返回除法的余数9":["56.2"],"不要直接判断两个浮点数是否相等":["56.3"],"我们成为返回值":["56.4"],"我们可以称为后置递增":["56.5"],"先自加":["56.6"],"后返回值":["56.6"],"先返回原值":["56.7"],"后自加":["56.7"],"不等号":["56.8"],"全等":["56.8"],"非":["56.9"],"逻辑或":["56.10"],"除":["56.11"],"取模后再赋值":["56.11"],"赋值运算符":["56.12"],"循环结构":["57.1"],"这三种结构代表三种代码执行的顺序":["57.1"],"20220412162238873":["57.2"],"16497517948072":["57.2"],"20220412162302543":["57.3"],"20220412162532195":["57.4"],"执行的代码":["57.5"],"执行流程":["57.5","57.6"],"上述条件都不成立执行此处代码":["57.6"],"false":["57.7","61.7","78.8"],"则返回表达式3的值":["57.7"],"简单理解":["57.7"],"就类似于":["57.7"],"if":["57.7","58.5","69.4","76.14","88.1"],"并在遇到":["57.8"],"时停止":["57.8"],"整个":["57.8"],"语句代码执行结束":["57.8"],"如果所有的":["57.8"],"的值都和表达式的值不匹配":["57.8"],"当分支比较少时":["57.9"],"else语句的执行效率比switch语句高":["57.9"],"⑤":["57.9"],"否则退出循环":["58.4"],"每次循环的最后都要执行的表达式":["58.4"],"通常被用于更新或者递增计数器变量":["58.4"],"这个人今年1岁了":["58.5"],"他出生了":["58.5"],"else":["58.5"],"内层循环执行的顺序也要遵循":["58.6"],"循环的执行顺序":["58.6"],"for":["58.7","63.8","66.3","68.3","69.4"],"循环的不同之处在于":["58.7"],"如果结果为":["58.8"],"则继续执行循环体代码":["58.8"],"如果为":["58.8"],"后面不执行":["58.10"],"继续开始下一次循环":["58.10"],"立即终止循环":["58.11"],"console":["58.11","60.7","62.13","65.5","66.1","68.2","68.5","69.3","92.3","98.4","103.3","103.4","103.5","103.6","109.12"],"log":["58.11","60.7","62.13","63.5","65.5","66.1","68.2","68.5","69.3","92.3","95.7","98.4","103.5","109.12"],"大黄":["60.3"],"瑞奇":["60.3"],"数组里面的数据一定要用逗号分隔":["60.3"],"arr2":["60.6"],"坦言":["60.6"],"往前":["60.6"],"趣味无穷":["60.6"],"通过修改数组索引的方式追加元素":["60.9"],"展示":["61.1"],"该属性可被更改或删除":["61.2"],"value能否被更改":["61.2"],"任何有效的":["61.2"],"在原型对象上包含了数组的各种方法":["61.3"],"可以对数组进行使用":["61.3"],"数组的索引是从0开始":["61.4"],"即元素的第一项索引为0":["61.4"],"result1":["61.6"],"array":["61.6"],"result2":["61.6"],"所以通常我们将函数名命名为动词":["62.3"],"比如getsum":["62.3"],"调用的时候千万不要忘记添加小括号":["62.4"],"口诀":["62.4"],"函数不调用":["62.4"],"自己不执行":["62.4"],"形参1":["62.7"],"形参2":["62.7"],"形参3":["62.7"],"可以定义任意多的参数":["62.7"],"用逗号分隔":["62.7"],"函数体":["62.7"],"调用的时候实参值是传递给形参的":["62.8"],"形参简单理解为":["62.8"],"不用声明的变量":["62.8"],"实参个数少于形参":["62.9"],"getresult":["62.11"],"还能够返回return语句中的值":["62.12"],"同时还可以以结束当前的函数体内的代码":["62.12"],"fn2":["62.14"],"函数表达式声明方式跟声明变量差不多":["62.15"],"只不过变量里面存的是值":["62.15"],"减少了名字冲突":["63.1"],"全局可以使用":["63.7"],"就近原则":["63.9"],"按照代码书写的顺序从上往下执行":["64.1"],"bc是全局变量":["64.4"],"abc都是局部变量":["64.4"],"局部变量":["64.4"],"分两步":["64.4"],"全局变量":["64.4"],"一组值":["65.1"],"时":["65.1","91.3"],"函数名":["65.4"],"方法在对象里面调用的时候":["65.4"],"男":["65.6"],"冰雨":["65.6"],"返回这个新对象":["65.7"],"所以构造函数里面不需要return":["65.7"],"是属性值":["65.8"],"语法中的变量是自定义的":["65.8"],"它需要符合命名规范":["65.8"],"宋翔宇":["65.9"],"王波":["65.9"],"樊琳":["65.9"],"王兆国":["65.9"],"许成":["65.9"],"李兴":["65.9"],"currentarr":["65.9"],"arrmath":["65.9"],"圆周率":["66.1"],"50之间的数字":["66.3"],"或":["67.1"],"者":["67.1"],"time":["67.2"],"h":["67.2","95.2"],"m":["67.2"],"我们经常利用总的毫秒数来计算时间":["67.3"],"因为它更加精确":["67.3"],"h5新增的获得总的毫秒数":["67.4"],"return":["67.5","68.4"],"天":["67.5"],"等价于":["68.1"],"请输入正确的数组":["68.2"],"newarr":["68.3","69.4"],"里面需要写一个函数":["68.4"],"升序":["68.4"],"push":["68.5"],"数组去重":["68.5"],"c":["68.5"],"z":["68.5"],"b":["68.5"],"uniqe":["68.5"],"方法用于把数组中的所有元素转换为一个字符串":["68.6"],"从零开始":["68.7"],"删除0个":["68.7"],"在索引为2的位置添加或替换为":["68.7"],"销毁这个临时变量":["69.1"],"这样基本数据类型就有了属性和方法":["69.2"],"如果没有就赋值为1":["69.5"],"输出对象":["69.5"],"再遍历对象":["69.5"],"max":["69.5","69.9","89.6"],"char":["69.5"],"k":["69.5","69.9"],"and":["69.6"],"sbustring":["69.6"],"str3":["69.7"],"red":["69.7"],"pink":["69.7"],"ki":["69.7"],"tolowercase":["69.8"],"查看结果":["69.9"],"建立max最大值":["69.9"],"准备输出最大的字符":["69.9"],"判断属性值是否大于最大值":["69.9"],"如果大于最大值就赋值对象值给最大值":["69.9"],"输出出现次数最多的字符的次数":["69.9"],"输出出现次数最多的字符":["69.9"],"因此叫做引用数据类型":["70.1"],"通过new关键字创建的对象":["70.1"],"系统对象":["70.1"],"自定义对象":["70.1"],"javascript中没有堆栈的概念":["70.2"],"通过堆栈的方式":["70.2"],"20220417002936560":["70.3"],"真正的对象实例存放在堆空间中":["70.4"],"org":["71.1","90.8"],"zh":["71.1"],"通过这些":["72.1"],"接口可以改变网页的内容":["72.1"],"注释等":["72.2"],"dom中使用node表示":["72.2"],"文档页面从上往下加载":["73.1"],"所以得先有标签":["73.1"],"标签名":["73.2"],"ol":["73.2"],"父元素必须是":["73.2"],"queryselectorall":["73.3"],"根据指定选择器返回所有元素对象":["73.3"],"例如":["74.1","124.3"],"我们可以在用户点击某按钮时产生一个事件":["74.1"],"采用函数赋值形式":["74.3"],"onmouseup":["74.4","78.23"],"鼠标弹起触发":["74.4","78.23"],"onmousedown":["74.4","78.23"],"某个时间":["75.1"],"backgroundcolor":["75.2","116.1"],"js修改style样式操作":["75.2"],"产生的是行内样式":["75.2"],"getattribute":["75.6"],"属性值":["75.6","118.1"],"nav":["75.8"],"list":["75.11","84.0"],"andy":["75.11"],"这两种方式都可以获取元素节点":["76.0"],"我们后面都会使用":["76.0"],"但是节点操作更简单":["76.0"],"文本节点包括文字":["76.1"],"空格":["76.1"],"换行等":["76.1"],"我们在实际开发中":["76.1"],"节点操作主要操作的是":["76.1"],"box":["76.3"],"erweima":["76.3"],"其余节点不返回":["76.4"],"这个是我们重点掌握的":["76.4"],"虽然":["76.4"],"也是包含所有的节点":["76.5","76.11","76.12"],"我是li5":["76.6"],"ie9以上才支持":["76.7","76.8"],"我是li2":["76.9"],"我是li3":["76.9"],"ie9才支持":["76.13"],"nextsibling":["76.14"],"nodetype":["76.14"],"是根据我们的需求动态生成的":["76.15"],"所以我们也称为":["76.15"],"前面":["76.16"],"id":["76.17"],"则是深度拷贝":["76.18"],"create":["76.19"],"总结":["76.19"],"createelement":["77.1"],"disabled":["77.4"],"修改元素样式":["77.4"],"children":["77.5"],"兄":["77.5"],"previouselementsibling":["77.5"],"removeattribute":["77.6"],"能够说出常用的鼠标和键盘事件":["78.1"],"代替":["78.3"],"特点":["78.3"],"注册事件的唯一性":["78.3"],"同一个元素同一个事件可以注册多个监听器":["78.3"],"button":["78.4","80.6","82.2","82.3","84.0","89.3","124.7"],"传统注册事件":["78.4"],"方法监听注册事件":["78.4"],"这里要带":["78.5"],"on":["78.5"],"事件处理函数":["78.5","78.9","78.16"],"相当于":["78.6"],"onclick":["78.6"],"学完":["78.8"],"dom":["78.8","78.14"],"当目标触发事件时回调函数被调用":["78.9"],"的捕获过程":["78.12"],"之后会产生泡泡":["78.12"],"会在最低点":["78.12"],"最具体元素":["78.12"],"之后漂浮到水面上":["78.12"],"class":["78.13","90.1","93.14"],"son盒子":["78.13"],"最顶层节点":["78.14"],"是个形参":["78.16"],"系统帮我们设定为事件对象":["78.16"],"不需要传递实参过去":["78.16"],"当我们注册事件时":["78.16"],"event对象就会被系统自动创建":["78.16"],"并依次传递给事件监听器":["78.16"],"this":["78.18"],"的区别":["78.18"],"是事件绑定的元素":["78.18"],"提交":["78.19"],"sub":["78.19"],"father":["78.20"],"son":["78.20"],"son儿子":["78.20"],"cancelbubble":["78.21"],"screenx":["78.25"],"返回鼠标相对于电脑屏幕的x坐标":["78.25"],"screeny":["78.25"],"keydown":["78.26"],"keypress":["78.26"],"keyup":["78.26"],"属性能区分大小写":["78.27"],"返回不同的ascii值":["78.27"],"的顶级对象是":["79.1"],"dom主要学习的是操作页面元素":["79.1"],"学习的是浏览器窗口交互的一些对象":["79.1"],"不要用这个name变量":["79.2"],"接收两个参数":["80.1"],"domcountentloaded事件触发时":["80.1"],"仅当dom加载完成":["80.1"],"不包括样式表":["80.1"],"图片":["80.1"],"flash等等":["80.1"],"如果页面的图片很多的话":["80.1"],"等就可以执行":["80.2"],"加载速度比load更快一些":["80.2"],"div":["80.3","88.2","115.5"],"普通函数是按照代码顺序直接调用":["80.5"],"而这个函数":["80.5"],"需要等待事件":["80.5"],"事件到了才会去调用这个函数":["80.5"],"因此称为回调函数":["80.5"],"点击停止定时器":["80.6"],"第一次执行也是间隔毫秒数之后执行":["80.7"],"之后每隔毫秒数就执行一次":["80.7"],"这样所导致的问题是":["81.1"],"如果":["81.1"],"js":["81.1","113.1"],"执行的时间过长":["81.1"],"前一个任务结束后再执行后一个任务":["81.3"],"异步":["81.3"],"在做这件事的同时":["81.3"],"对象":["82.0","89.1"],"路径":["82.1"],"由零或多个":["82.1"],"符号隔开的字符串":["82.1"],"参数":["82.1","91.3"],"以键值对的形式":["82.1"],"通过":["82.1"],"5s之后跳转页面":["82.2"],"点击":["82.2","82.3","89.3"],"windows":["83.0"],"window":["83.0"],"location":["83.0"],"href":["83.0"],"手机":["83.0"],"html":["84.0","104.4","120.4"],"点击我去往列表页":["84.0"],"多态是建立在继承的基础上的":["85.2"],"一个父类对象可以产生多个不同的子类对象":["85.2"],"根据这些子类对象的不同可以具备不同的方法":["85.2"],"在对象种用方法来表示":["85.3"],"动词":["85.3"],"通过类实例化一个具体的对象":["85.4"],"必须实例化":["85.5"],"类里面所有函数不需要写function":["85.6"],"new":["85.8","85.11","86.8","87.2"],"继承中":["85.10"],"如果实例化子类输出一个方法":["85.10"],"先看子类有没有这个方法":["85.10"],"如果有就先执行子类的":["85.10"],"var":["85.11","95.6"],"在es6之前":["86.1"],"对象不是基于类创建的":["86.1"],"原型":["86.6"],"指向构造函数的原型对象":["86.6"],"20230415025018085":["86.7"],"l":["86.8"],"调用自己的方法":["86.9"],"里面原型是对象":["86.9","86.10"],"20220428162946572":["86.12"],"一般指向函数的调用者":["86.14"],"组合继承":["87.0"],"son1":["87.2"],"ldh":["87.2","87.3"],"自有和父的方法都继承":["87.3"],"新的class写法只是让对象原型的写法更加清晰":["87.4"],"更像面向对象编程的语法而已":["87.4"],"zhaodao":["88.1"],"在foreach里面return不会终止迭代":["88.1"],"configurable":["88.3"],"目标属性是否可以被删除或是否可以再次修改特性true":["88.3"],"fasle默认为false":["88.3"],"keys":["88.3"],"用于获取对象自身的所有属性":["88.3"],"的实例":["89.1"],"函数也属于对象":["89.1"],"20220428210858863":["89.1"],"同时想调用这个函数的时候":["89.5"],"可以使用":["89.5"],"比如继承":["89.5"],"比如使用":["89.6"],"math":["89.6"],"求数组的最大值":["89.6"],"apply经常跟数组有关系":["89.8"],"比如借助于数学对象实现数组最大值最小值":["89.8"],"比如一些保留字如":["90.1"],"enum":["90.1"],"export":["90.1"],"为函数开启严格模式":["90.2"],"两种情况":["90.2"],"为整个脚本":["90.3"],"script标签":["90.3"],"开启严格模式":["90.3"],"事件":["90.7"],"对象还是指向调用者":["90.7"],"就是一个高阶函数":["90.9"],"函数也是一种数据类型":["90.9"],"同样可以作为参数":["90.9"],"本作用域内的局部变量会销毁":["91.1"],"里面会多一个":["91.3"],"closure":["91.3"],"等同于上面的log":["91.6"],"有闭包":["91.6"],"服饰":["92.0"],"getid":["92.0"],"json":["92.0","108.4"],"o":["92.0"],"foreach":["92.0"],"item":["92.0","95.8"],"方法二":["92.2"],"方法三":["92.2"],"替换":["93.2"],"或者从字符串中获取我们想要的特定部分":["93.2"],"提取":["93.2"],"z0":["93.3"],"str我们要检测的文本":["93.6"],"就是检测str文本是否符合我们写的正则表达式规范":["93.6"],"jquery":["93.7"],"正则表达式部分":["93.7"],"正则测试工具":["93.7"],"在线正则表达式测试":["93.7"],"都返回":["93.10"],"表示取反的意思":["93.11"],"千万别和边界符":["93.11"],"混淆":["93.11"],"input":["93.14"],"type":["93.14","108.4"],"它是让":["93.15"],"在线测试正则表达式":["93.15"],"n":["93.16"],"v":["93.16"],"f":["93.16"],"匹配非空格的字符":["93.16"],"u9fa5":["93.17"],"gi":["93.19"],"年后该组织改名为":["94.1"],"publications":["94.3"],"standards":["94.3"],"standard":["94.3"],"2018年":["94.4"],"对象解构赋值":["94.4"],"正则扩展":["94.4"],"第10版":["94.4"],"2019年":["94.4"],"数组方法":["94.4"],"第11版":["94.4"],"2020年":["94.4"],"链式操作":["94.4"],"动态导入等":["94.4"],"es":["94.4"],"定期召开会议":["94.5"],"会议由会员公司的代表与特邀专家":["94.5"],"就业必备技能":["94.6"],"github":["94.7"],"io":["94.7"],"不影响作用域链":["95.1"],"g":["95.2"],"iloveyou":["95.2"],"has":["95.3"],"already":["95.3"],"been":["95.3"],"referenceerror":["95.4"],"is":["95.4"],"大哥":["95.6"],"存在变量提升":["95.6"],"let":["95.6"],"这里是可以使用的":["95.7"],"const":["96.1"],"不能使用arguments":["100.2"],"ad":["100.4"],"d2":["103.1"],"csdn博客":["104.1"],"symbol内置属性":["104.1"],"都是作为某个对象类型的属性去使用":["104.4"],"doctype":["104.4"],"lang":["104.4"],"en":["104.4"],"charset":["104.4"],"utf":["104.4"],"viewport":["104.4"],"相当于函数的暂停标记":["105.0"],"也可以认为是函数的分隔符":["105.0"],"每调用一次":["105.0"],"方法":["105.0","113.2"],"执行一段代码":["105.0"],"第一次调用对象的next方法":["106.1"],"指针自动指向数据结构的第一个成员":["106.1"],"接下来不断调用next方法":["106.1"],"指针一直往后移动":["106.1"],"直到指向最后一个成员":["106.1"],"then方法":["107.0"],"模块化的好处":["108.1"],"大家都遵守同样的模块化规范写代码":["108.1"],"降低了沟通的成本":["108.1"],"太多的模块化规范给开发者增加了学习的难度与开发的成本":["108.2"],"import":["108.3"],"关键字":["108.3"],"向外共享模块成员使用":["108.3"],"的根节点中添加":["108.4"],"直接导入并执行模块中的代码":["108.5"],"否则会报错":["108.8"],"按需导入可以和默认导入一起使用":["108.12"],"20220518233714501":["108.13"],"回调地狱的缺点":["109.1"],"代码耦合性太强":["109.1"],"牵一发而动全身":["109.1"],"难以维护":["109.1"],"的概念":["109.2"],"result":["109.3"],"error":["109.3"],"调用":["109.3"],"安装then":["109.5"],"r3":["109.6","110.2","110.3"],"方法的链式调用":["109.7"],"files":["109.12"],"txt":["109.12"],"r1":["109.12"],"解决了回调地狱的问题":["110.1"],"链式调用的缺点":["110.1"],"代码冗余":["110.1"],"则后续的任务就不得不一直等待":["111.1"],"从而导致程序假死的问题":["111.1"],"宿主环境进行执行":["111.2"],"当异步任务执行完成后":["111.2"],"会通知":["111.2"],"javascript主线程":["111.2"],"主线程不断重复上面的第":["111.3"],"事件循环":["111.4"],"异步任务":["111.5"],"finally":["112.1"],"process":["112.1"],"nexttick":["112.1"],"其他微任务":["112.1"],"再继续执行下一个宏任务":["112.2"],"再执行下一个宏任务":["112.3"],"正确的输出顺序是":["112.4"],"移动端的zepto":["113.1"],"这些库都是对原生javascript的封装":["113.1"],"就是学习调用这些函数":["113.2"],"jquery出现的目的是加快前端人员的开发速度":["113.2"],"树形菜单":["113.3"],"日期控件":["113.3"],"轮播图等":["113.3"],"不兼容ie678":["114.0"],"主要更新版本":["114.0"],"css文件":["114.1"],"图片加载完毕才执行内部代码":["114.1"],"包装成jquery对象":["114.2"],"就可以调用jquery的方法":["114.2"],"伪数组形式存储":["114.3"],"get":["114.4"],"使用空格":["115.2"],"代表后代选择器":["115.2"],"获取ul下的所有li元素":["115.2"],"选择索引号为奇数的元素":["115.4"],"even":["115.4"],"检查当前元素是否含有某个特定的类":["115.5"],"如果又":["115.5"],"则返回true":["115.5"],"eq":["115.5"],"index":["115.5","123.5"],"toggleclass":["116.2"],"鼠标移出元素要触发的函数":["117.2"],"mouseleave":["117.2"],"调整透明度":["117.4"],"or":["117.5"],"fast":["117.5"],"或表示动画时长的毫秒数之":["117.5"],"相当于停止结束上一次动画":["117.8"],"该方法获取data":["118.3"],"index不用写data":["118.3"],"设置元素内容":["119.2"],"语法2":["120.1"],"object":["120.1"],"element":["120.1"],"放在目标元素的后面":["120.3"],"before":["120.3"],"以上参数为空":["121.1"],"则获取相应值":["121.1"],"返回的是数字型":["121.1"],"如果父级没有带有定位":["121.2"],"则以文档为准":["121.2"],"只能获取":["121.2"],"不能设置":["121.2"],"resize":["122.2"],"scroll等":["122.2"],"回调函数":["122.4"],"即绑定在元素身上的侦听函数":["122.4"],"one":["122.6"],"input不会有关标":["122.8"],"不会触发元素默认行为":["122.8"],"阻止冒泡":["122.9"],"前面加true":["123.1"],"完全克隆":["123.1"],"拷贝的对象":["123.1"],"而不是地址":["123.1"],"jquery变量规定新的名称":["123.2"],"htmleaf":["123.3"],"hide":["123.5"],"show":["123.5"],"mouseover":["123.5"],"除此之外":["124.0"],"它还有一些自定义的选择器":["124.0"],"或是":["124.2"],"过滤掉所有标题元素":["124.3"],"h1":["124.3"],"h2":["124.3"],"h3等":["124.3"],"元素":["124.4"],"parent":["124.4"],"选取拥有子元素的":["124.4"],"选取属性title用空格分隔的值中包含字符en的":["124.6"],"only":["124.7"],"在":["124.7"],"option":["124.8"],"selected":["124.8"],"选取所有的select":["124.8"],"选取所有的按钮":["124.9"],"file":["124.9"],"选取所有的上传域":["124.9"]},{"0":["55.6","92.0","104.4"],"1":["26.8","26.9","55.8","56.2","62.11","67.5","94.4","104.4"],"2":["43.4","56.2","62.11","62.13","65.6","85.6","115.5","117.1"],"3":["5.4","26.0","43.4","60.6","62.13","62.15","68.2"],"4":["7.0","62.13","65.6","105.0"],"5":["62.13","67.5"],"6":["46.0","62.13","85.11"],"8":["56.12","66.2"],"10":["50.4","51.2"],"16":["93.3"],"17":["92.3"],"18":["67.5"],"20":["50.3"],"30":["50.4"],"100":["87.2"],"123":["78.16"],"1000":["117.5"],"2020":["94.4"],"2022":["67.5"],"5650":["39.4"],"156234789":["112.4"],"其实":["2.0"],"我们移动端更喜欢使用这些标签":["2.0"],"html5还增加了很多其他标签":["2.0"],"则忽略preload":["3.1"],"要播放视频的url":["3.1"],"20230414195425800":["3.1"],"则每当音频结束时重新开始播放":["3.2"],"url":["3.2"],"要播放的音频的url":["3.2"],"谷歌浏览器把音频和视频自动播放禁止了":["3.2"],"循环和设置大小属性":["3.3"],"color":["4.0"],"生成一个颜色选择表单":["4.0"],"multiple":["4.1"],"可以多选文件提交":["4.1"],"伪类选择器":["5.1"],"权重为10":["5.1"],"type会把指定元素的盒子排序":["5.2"],"image":["5.2","10.0","12.1","12.3","23.4","31.3","50.4","52.3","54.8","55.4","57.5","57.6","86.8","87.3","91.3","112.1"],"20230414200023217":["5.2"],"盒子内容的后面模拟空盒子":["5.3"],"盒子内容的前面模拟空盒子":["5.3"],"20230414200517118":["6.1"],"小米mix":["6.2"],"小米笔记本官方网站":["6.2"],"便捷":["6.3"],"诚信的服务":["6.3"],"为您提供愉悦的网上购物体验":["6.3"],"我们只需要准备好这三个标签":["6.4"],"具体里面的内容":["6.4"],"有专门的":["6.4"],"seo":["6.4"],"人员准备":["6.4"],"最后给链接一个title属性":["7.0"],"这样鼠标放到logo上就可以看到提示文字了":["7.0"],"opera":["8.5"],"和trident":["8.5"],"internet":["8.5"],"explorer":["8.5"],"中":["8.5"],"会应用colorcolor属性的值":["8.5"],"另外":["8.5"],"如果颜色值省略":["8.5"],"webkit中阴影是透明的":["8.5"],"webkit以及一些其他浏览器":["8.5"],"可以设置延迟触发时间默认是1s":["10.0"],"20230414201532976":["10.0"],"scale":["11.0","104.4"],"对行内标签没有效果":["11.2"],"默认旋转的中心点是元素的中心点":["11.3"],"可以设置缩放中心":["11.5"],"记得要将位移放到最前":["11.6","11.7"],"当我们进行综合写法":["11.7"],"同时有位移和其他属性的时候":["11.7"],"duration":["12.1"],"20230414210118664":["12.1"],"paused":["12.2"],"fill":["12.2"],"mode":["12.2"],"规定动画结束后状态":["12.2"],"保持forwards回到起始backwards":["12.2"],"前两个属性必写":["12.3"],"20230414210220781":["12.3"],"指定了时间函数中的间隔数量":["12.4"],"步长":["12.4"],"百分比":["14.1"],"z取值为0":["14.3"],"1之间的数字":["14.3"],"表示子元素处于2d平面内星现":["14.4"],"z":["14.5"],"id":["16.2"],"id有唯一性":["16.2"],"属性值只能是1个":["16.2"],"登录条":["17.1"],"loginbar":["17.1"],"页面外围控制整体布局宽度":["17.1","17.4"],"wrapper":["17.1","17.4"],"左右中":["17.1"],"left":["17.1"],"right":["17.1"],"center":["17.1"],"摘要":["17.5"],"summary":["17.5"],"合作伙伴":["17.6"],"partner":["17.6"],"友情链接":["17.6"],"link":["17.6"],"版权":["17.6","44.2"],"copyright":["17.6"],"9pt":["17.9"],"偷懒经常缩写":["17.11"],"布局":["17.12"],"版面":["17.12"],"layout":["17.12"],"自动保存当前页面所有内容到指定文件夹":["18.0"],"保存路径可更改":["18.0"],"所有页面放大20":["18.0"],"所有页面缩小20":["18.0"],"输入焦点移到搜索栏":["18.0"],"关闭":["18.0"],"打开并激活到你设置的主页":["18.0"],"在新窗口中打开剪贴板中的地址":["18.0"],"如果剪贴板中为文字":["18.0"],"则调用搜索引擎搜索该文字":["18.0"],"搜索引擎可选择":["18.0"],"等同于ctrl":["18.0"],"关闭除锁定标签外的全部标签":["18.0"],"按页面打开的先后时间顺序向后切换标签":["18.0"],"以小菜单方式向上切换标签":["18.0"],"域名自动完成":["18.0"],"保存当前表单":["18.0"],"保存为通用表单":["18.0"],"展开收藏夹列表":["18.0"],"资源管理器":["18.0"],"end显示当前窗口的底端":["18.0"],"home显示当前窗口的顶端":["18.0"],"numlock":["18.0"],"数字键盘的减号":["18.0"],"折叠所选的文件夹":["18.0"],"数字键盘的加号":["18.0"],"显示所选文件夹的内容":["18.0"],"数字键盘的星号":["18.0"],"显示所选文件夹的所有子文件夹":["18.0"],"向左键当前所选项处于展开状态时折叠该项":["18.0"],"或选定其父文件夹":["18.0"],"向右键当前所选项处于折叠状态时展开该项":["18.0"],"或选定第一个子文件夹":["18.0"],"自然键盘":["18.0"],"显示或隐藏":["18.0"],"菜单":["18.0"],"d显示桌面":["18.0"],"r打开":["18.0"],"e打开":["18.0"],"我的电脑":["18.0"],"f搜索文件或文件夹":["18.0"],"u打开":["18.0"],"工具管理器":["18.0"],"break显示":["18.0"],"tab在打开的项目之间切换":["18.0"],"辅助功能":["18.0"],"按右边的shift键八秒钟切换筛选键的开和关":["18.0"],"按shift五次切换粘滞键的开和关":["18.0"],"按numlock五秒钟切换切换键的开和关":["18.0"],"左边的alt":["18.0"],"左边的shift":["18.0"],"numlock切换鼠标键的开和关":["18.0"],"printscreen切换高对比度的开和关":["18.0"],"line":["19.0"],"height":["19.0"],"行间距":["20.0"],"上间距":["20.0"],"下间距":["20.0"],"文本高度":["20.0"],"只需要设置一次即可":["21.2"],"以后都可以自动保存格式化代码":["21.2"],"两种类型":["22.1"],"h6等都是文字类块级标签":["22.2"],"里面也不能放其他块级元素":["22.2"],"但是给":["22.3"],"转换一下块级模式最安全":["22.3"],"颜色表":["23.1"],"使用绝对或相对地址指定背景图像":["23.2"],"背景图像在纵向平铺":["23.3"],"20230414180321148":["23.4"],"20230414180402888":["23.5"],"不管父元素权重多高":["24.4"],"子元素得到的权重都是0":["24.4"],"长度单位":["25.4"],"color的值画3d凹边":["25.5"],"outset":["25.5","25.13"],"color的值画3d凸边":["25.5"],"20230414184635572":["25.8"],"30px":["25.9"],"4个值":["25.9"],"上是5像素":["25.9"],"右10像素下20像素左是30像素顺时针":["25.9"],"以上方法是让块级元素水平居中":["25.10"],"行内元索或者行由块元索水平居中给其父元索添加text":["25.10"],"align":["25.10","31.7"],"center即可":["25.10"],"hidden":["25.11","124.9"],"20230414185012592":["25.11"],"将外部阴影":["25.13"],"改为内部阴影":["25.13"],"阴影的颜色":["25.14"],"参阅css颜色值":["25.14"],"定位":["26.0"],"元素向右浮动":["26.1"],"浮动的盒子不再保留原先的位置":["26.2"],"清除浮动的策略是":["26.4"],"闭合浮动":["26.4"],"要求这个新的空标签必须是块级元素":["26.6"],"右侧偏移量":["27.3"],"定义元素相对于其父元素右边线的距离":["27.3"],"它最典型的应用是给绝对定位当爹的":["27.6"],"则以最近一级的有定位祖先元素为参考点移动位置":["27.7"],"bottom其中一个才有效":["27.10"],"只有定位的盒子才有z":["27.12"],"index属性":["27.12"],"会压住下面标准流所有的内容":["27.16"],"将对象作为表格脚注组显示":["28.1"],"row":["28.1"],"将对象作为表格行显示":["28.1"],"将对象作为表格行组显示":["28.1"],"5尚不支持此属性":["28.2"],"继续占有原来的位置":["28.2"],"请慎用overflow":["28.3"],"因为它会隐藏多余的部分":["28.3"],"这个是阿里妈妈m2ux的一个iconfont字体图标字库":["29.1"],"包含了淘宝图标库和阿里妈妈图标库":["29.1"],"可以使用al制作图标上传生成":["29.1"],"重点是":["29.1"],"免费":["29.1","113.3"],"weight":["29.2"],"normal":["29.2"],"style":["29.2","77.4"],"display":["29.2"],"block":["29.2","36.0"],"20230415001616761":["30.1"],"缩放1倍":["30.2"],"不缩放":["30.2"],"20230415002049210":["31.3"],"evenly":["31.4"],"弹性盒子与容器之间间距相等":["31.4"],"内容高度":["31.5"],"如果盒子没有宽度":["31.5"],"则为内容宽度":["31.5"],"content变成垂直居中":["31.7"],"items变成水平居中":["31.7"],"取值与justify":["31.8"],"content基本相同":["31.8"],"1html字号大小":["32.2"],"32px":["32.3"],"px单位数值":["32.4"],"基准根字号":["32.4"],"landscape":["32.5","33.3"],"单行注释无法渲染到css文件":["32.10"],"20220409174918755":["32.13"],"20220409175833463":["32.15"],"100视口高度":["32.18"],"skyblue":["33.0"],"区间大的写在前面":["33.0"],"默认值":["33.2"],"包括以上3钟情形":["33.2"],"横屏":["33.3"],"pink":["34.0"],"禁止":["35.1"],"把此元素放在父元素的中部":["37.0"],"把元素的顶璃与行中最低的元素的顶端对齐":["37.0"],"ellipsis":["38.1"],"因为后台人员可以设置显示多少个字":["38.2"],"操作更简单":["38.2"],"则加z":["39.1"],"index":["39.1"],"8f6f":["40.0"],"96c5":["40.0"],"down":["41.0"],"调整内容大小就像没有指定内容或者包含内容一样":["41.0"],"每个小背景图片的大小和位置":["42.2"],"与":["43.1"],"whatwg":["43.1"],"合作的结果":["43.1"],"h5网络标准统一":["43.1"],"可以跨平台":["43.1"],"多设备使用":["43.1"],"语义化比较强":["43.1"],"doctype":["43.1"],"lang":["43.1"],"字符集":["43.1"],"内部的才是html标签":["43.2"],"body":["43.3","44.1","78.16","78.25","78.26","78.27","80.5","80.7","89.1","89.5","89.6","90.7","93.11","93.17","96.1","104.4"],"标签里面的内容是中文还是英文的":["43.3"],"文件命名规则":["43.4"],"用":["43.4"],"英文":["43.4"],"不建议使用中文":["43.4"],"名称全部用":["43.4"],"小写":["43.4"],"英文字母":["43.4"],"数字":["43.4"],"下划线的组合":["43.4"],"其中不得包含汉字":["43.4"],"空格和特殊字符":["43.4"],"必须以英文字母开头":["43.4"],"命名的时候最好使用语义化比较强的英文":["43.4"],"特殊符号":["44.2"],"nbsp":["44.2"],"空格":["44.2"],"copy":["44.2"],"reg":["44.2"],"商标":["44.2"],"下标和上标":["44.3"],"20230413195648789":["44.4"],"锚点链接":["46.0"],"tbody":["48.0"],"定义主体部分":["48.0"],"放在":["48.0"],"内":["48.0"],"实心圆":["49.0"],"checked":["50.1"],"单选和多选的默认选中":["50.1"],"在form表单写button按钮跟提交按钮一样":["50.1"],"cols":["50.3","50.4"],"文本内容":["50.3"],"rows":["50.4"],"20230413201556177":["50.4"],"smalltalk的一种变种":["51.1"],"正则表达式":["51.1"],"借鉴perl语言":["51.1"],"字符串和数组处理":["51.1"],"借鉴python语言":["51.1"],"app":["51.2"],"cordova":["51.2"],"tostring":["52.2"],"的返回值并固定了":["52.2"],"sort":["52.2"],"的顺序":["52.2"],"20220411225019700":["52.3"],"获取分辨率等":["52.4"],"外部js":["53.1"],"cript写法":["53.1"],"输出":["54.3"],"初始化":["54.3"],"只赋值":["54.7"],"推荐翻译网站":["54.8"],"有道":["54.8"],"爱词霸":["54.8"],"20220412004949618":["54.8"],"bill":["55.1"],"x为字符串":["55.1"],"声明了变量a为空值":["55.3"],"not":["55.4","95.4"],"a":["55.4"],"代表一个非数值":["55.4"],"isnan":["55.4"],"判断一个变量是否为非数字的类型":["55.4"],"返回true或false":["55.4"],"20220412111912207":["55.4"],"其拼接方式为":["55.5"],"字符串":["55.5"],"任何类型":["55.5"],"拼接之后的新字符串":["55.5"],"拼接前会把与字符串相加的任何类型转成字符串":["55.5"],"再拼接成一个新的字符串":["55.5"],"小白":["55.11"],"transient":["55.12"],"volatile":["55.12"],"注意":["55.12","56.5","57.8","62.4","62.9","66.1","109.6"],"如果将保留字用作变量名或函数名":["55.12"],"那么除非将来的浏览器实现了该保留字":["55.12"],"否则很可能收不到任何错误消息":["55.12"],"当浏览器将其实现后":["55.12"],"该单词将被看做关键字":["55.12"],"如此将出现关键字错误":["55.12"],"递增和递减运算符必须和变量配合使用":["56.5"],"要求值和数据类型都一致":["56.8"],"逗号运算符":["56.12"],"20220412162712218":["57.5"],"20220412170845002":["57.6"],"else":["57.7","62.14","65.9","83.0","92.0"],"双分支":["57.7"],"的简写":["57.7"],"则执行":["57.8"],"里的代码":["57.8"],"执行case":["57.8"],"里面的语句时":["57.8"],"如果没有break":["57.8"],"则继续执行下一个case里面的语句":["57.8"],"当分支比较多时":["57.9"],"switch语句的执行效率比较高":["57.9"],"而且结构更清晰":["57.9"],"当然":["58.4"],"递减变量也是可以的":["58.4"],"这个人今年100岁了":["58.5"],"死了":["58.5"],"这个人今年":["58.5"],"岁了":["58.5"],"外层循环执行一次":["58.6"],"内层循环要执行全部次数":["58.6"],"循环可以做较为复杂的条件判断":["58.7"],"比如判断用户名和密码":["58.7"],"false":["58.8","65.9","93.8"],"则退出循环":["58.8"],"继续执行后面代码":["58.8"],"console":["58.10","62.11","67.5","87.2","109.10","109.11"],"log":["58.10","62.11","67.5","87.2","103.3","103.4","103.6","109.10","109.11"],"数组里面的数据":["60.3"],"成为元素":["60.3"],"值":["61.2"],"数值":["61.2"],"对象":["61.2","120.1"],"函数等":["61.2"],"默认为undefined":["61.2"],"该属性对应的值":["61.2"],"即数组规定了原型对象上的某些属性":["61.2"],"所以对数组的对象属性是不能操作的":["61.2"],"声明函数本身并不会执行代码":["62.4"],"只有调用函数时才会执行函数体代码":["62.4"],"带参数的函数调用":["62.7"],"实参1":["62.7"],"实参2":["62.7"],"实参3":["62.7"],"实参和形参的多个参数之间用逗号分隔":["62.8"],"在javascript中":["62.9"],"形参的默认值是undefined":["62.9"],"re":["62.11","65.9"],"如果没有返回return":["62.11"],"则返回undefined":["62.11"],"backday":["62.14"],"prompt":["62.14"],"请输入年份":["62.14"],"alert":["62.14"],"当前年份是闰年":["62.14"],"二月份有29天":["62.14"],"当前年份是平年":["62.14"],"二月份有28天":["62.14"],"而函数表达式里面存的是函数":["62.15"],"函数表达式也可以进行传递参数":["62.15"],"无法使用":["63.7"],"a为局部变量":["64.4"],"输出报错未定义":["64.4"],"报错a未定义":["64.4"],"为什么使用对象":["65.1"],"对象的结构相比于数组更加清晰和简单":["65.1"],"调用对象的方法":["65.3"],"方法名":["65.3"],"方法":["65.4"],"构造函数名字首字母必须要大写字母":["65.6"],"构造函数不需要return就可以返回结果":["65.6"],"调用构造函数必须使用new":["65.6"],"只要":["65.6"],"通常我们会将这个变量写为":["65.8"],"或者":["65.8"],"key":["65.8"],"newarr":["65.9"],"创建新数组":["65.9"],"默认为false":["65.9"],"如果匹配不到则为true":["65.9"],"m":["65.9"],"将arr和currentarr里面的每一个值进行比较":["65.9"],"如果currentarr里面有值匹配":["65.9"],"则输出false":["65.9"],"break":["65.9"],"如果匹配到":["65.9"],"则跳出循环":["65.9"],"true":["65.9"],"循环完成后":["65.9"],"将值还为true的":["65.9"],"拿出来创建新数组":["65.9"],"内置对象":["65.9"],"javascript中的对象分为3种":["65.9"],"自定义对象":["65.9"],"浏览器对象":["65.9"],"前两种对象是js基础内容":["65.9"],"属于ecmascript":["65.9"],"的三个浏览器对象属于我们js独有的":["65.9"],"javascript提供多个内置对象":["65.9"],"math":["65.9"],"date":["65.9"],"array":["65.9","70.1"],"string等":["65.9"],"向下取整":["66.1"],"向上取整":["66.1"],"四舍五入版":["66.1"],"就近取整":["66.1"],"结果是":["66.1"],"绝对值":["66.1"],"隐式转换成数值":["66.1"],"求最大和最小":["66.1"],"次机会":["66.3"],"如果date":["67.1"],"不写参数":["67.1"],"就返回当前时间":["67.1"],"里面写参数":["67.1"],"就返回括号里面输入的时间":["67.1"],"s":["67.2"],"return":["67.2","68.5","76.14","86.15"],"now":["67.4"],"时":["67.5"],"分":["67.5"],"00":["67.5"],"if":["68.3"],"降序":["68.4"],"demo":["68.5"],"j1":["68.7"],"删除一个":["68.7"],"添加":["68.7"],"null":["69.1","76.14","78.11"],"如果对象属性值大于max":["69.5"],"就赋值max为对象值":["69.5"],"把k对象属性赋值给char":["69.5"],"输出最大对象值":["69.5"],"输出最大对象属性":["69.5"],"nd":["69.6"],"str4":["69.7"],"转换为小写":["69.8"],"newstr":["69.9"],"循环所有字符串":["69.9"],"concat":["69.9"],"如object":["70.1"],"date等":["70.1"],"可以让大家更容易理解代码的一些执行方式":["70.2"],"便于将来学习其他语言":["70.2"],"20220417003309308":["70.4"],"cn":["71.1"],"通过demo进行测试":["71.2"],"结构和样式":["72.1"],"dom把以上内容都看作是对象":["72.2"],"所以script写到标签下面":["73.1"],"单个对象":["73.2"],"必须指明是哪一个元素对象":["73.2"],"然后去执行某些操作":["74.1"],"鼠标按下触发":["74.4","78.23"],"css权重比较高":["75.2"],"一般的":["76.0"],"节点至少拥有三个基本属性":["76.0"],"利用":["76.1"],"树可以把节点划分为不同的层级关系":["76.1"],"常见的是":["76.1"],"父子兄层级关系":["76.1"],"是一个非标准":["76.4"],"但是得到了各个浏览器的支持":["76.4"],"因此我们可以放心使用":["76.4"],"我是li4":["76.9"],"动态创建元素节点":["76.15"],"before":["76.16"],"button":["76.17"],"发布":["76.17"],"ul":["76.17"],"会复制节点本身以及里面所有的子节点":["76.18"],"不同浏览器下":["76.19"],"效率要比":["76.19"],"高":["76.19"],"classname":["77.4"],"nextelementsibling":["77.5"],"移除属性":["77.6"],"同一个元素同一个事件只能设置一个处理函数":["78.3"],"最后注册的处理函数将会覆盖前面注册的处理函数":["78.3"],"按注册顺序依次执行":["78.3"],"ie9":["78.4"],"attachevent":["78.4"],"当目标触发事件时回调函数被调用":["78.5"],"ie9以前的版本支持":["78.5","78.9"],"事件流后":["78.8"],"我们再进一步学习":["78.8"],"这个过程相当于事件冒泡":["78.12"],"20220419205736977":["78.12"],"但是因为dom流的影响":["78.13"],"我们点击子盒子":["78.13"],"会先弹出":["78.13"],"之后再弹出":["78.13"],"在这里插入图片描述":["78.13"],"div":["78.16","82.2"],"这个函数的调用者":["78.18"],"绑定这个事件的元素":["78.18"],"是事件触发的元素":["78.18"],"返回鼠标相对于电脑屏幕的y坐标":["78.25"],"javascript":["78.25","80.2","89.5","89.6"],"dom是w3c标准规范":["79.1"],"是浏览器厂商在各自浏览器上定义的":["79.1"],"兼容性较差":["79.1"],"window下有一个特殊属性window":["79.2"],"从用户访问到onload触发可能需要较长的时间":["80.1"],"交互效果就不能实现":["80.1"],"必然影响用户的体验":["80.1"],"此时用":["80.1"],"domcontentloaded事件比较合适":["80.1"],"这样就会造成页面的渲染不连贯":["81.1"],"导致页面渲染加载阻塞的感觉":["81.1"],"你还可以去处理其他事情":["81.3"],"20230415022123815":["81.5"],"同步任务放在执行栈中执行":["81.5"],"异步任务由异步进程处理放到任务队列中":["81.5"],"执行栈中的任务执行完毕会去任务队列中查看是否有异步任务执行":["81.5"],"由于主线程不断的重复获得任务":["81.5"],"执行任务":["81.5"],"再获取任务":["81.5"],"再执行":["81.5"],"所以这种机制被称为事件循环":["81.5"],"event":["81.5"],"loop":["81.5"],"符号分隔开来":["82.1"],"片段":["82.1"],"后面内容":["82.1"],"常见于链接":["82.1"],"锚点":["82.1"],"电脑":["83.0"],"前进":["84.0"],"也就是说表现出了不同的形态即多态":["85.2"],"多个函数方法之间不需要加逗号分隔":["85.6"],"调用父类中的构造函数":["85.9"],"如果子类里面没有":["85.10"],"就去查找父类有没有这个方法":["85.10"],"如果有则执行":["85.10"],"就近原则":["85.10"],"如果需要输出对象名":["85.12"],"则要在类的外面声明一个变量":["85.12"],"在constructor里面that指向this":["85.12"],"而是用一种称为构造函数的特殊函数来定义对象和他们的特征":["86.1"],"20220428152334075":["86.8"],"里面有自己的方法和原型对象的方法":["86.9"],"被覆盖":["86.10"],"对象原型的意义就在于为对象成员查找机制提供一个方向":["86.13"],"或者说一条路线":["86.13"],"父构造函数原型对象也添加了子构造函数原型对象的方法":["87.3"],"指向父构造函数":["87.3"],"需要重新指回":["87.3"],"20220428173427479":["87.3"],"es6的类就是语法糖":["87.4"],"在some里面":["88.1"],"遇到return":["88.1"],"true就是终止遍历":["88.1"],"迭代效率更高":["88.1"],"效果类似for":["88.3"],"in":["88.3"],"返回一个由属性名组成的数组":["88.3"],"bind不调用函数":["89.8"],"但是还想改变this指向":["89.8"],"比如改变定时器内部的this指向":["89.8"],"extends":["90.1"],"import":["90.1"],"super不能做变量名":["90.1"],"为某个函数开启严格模式":["90.3"],"传递给另外一个参数使用":["90.9"],"最典型的就是作为回调函数":["90.9"],"同理函数也可以作为返回值传递回来":["90.9"],"这就表明产生了闭包":["91.3"],"20230415025456611":["91.3"],"20230415025520223":["91.5"],"that":["91.6"],"length":["92.0"],"等":["93.2"],"oschina":["93.7"],"net":["93.7"],"reg1":["93.8"],"以abc开头":["93.8"],"以abc结尾":["93.8"],"必须是abc":["93.8"],"uname":["93.14"],"span":["93.14"],"请输入用户名":["93.14"],"https":["93.15"],"runoob":["93.15"],"com":["93.15"],"r":["93.16"],"国际":["94.1"],"htm":["94.3"],"next":["94.4"],"动态指向下一个版本":["94.4"],"注":["94.4"],"从":["94.4"],"es6":["94.4"],"开始":["94.4"],"每年发布一个版本":["94.4"],"版本号比年份最后一位大":["94.4"],"出席":["94.5"],"批量声明并赋值":["95.2"],"declared":["95.3"],"defined":["95.4"],"二哥":["95.6"],"遍历":["98.5"],"set结构的实例和数组一样":["98.5"],"也拥有foreach方法":["98.5"],"用于对每一个成员执行某种操作":["98.5"],"foreach":["98.5"],"symbol创建对象属性":["104.2"],"width":["104.4"],"device":["104.4"],"initial":["104.4"],"title":["104.4"],"symbol内置属性":["104.4"],"方法可以传递实参":["105.0"],"作为":["105.0"],"语句的返回值":["105.0"],"每调用next方法返回一个包含value和done属性的对象":["106.1"],"需要自定义遍历数据时":["106.1"],"要想到迭代器":["106.1"],"catch方法":["107.0"],"极大方便了各个模块之间的相互调用":["108.1"],"利人利己":["108.1"],"大一统的":["108.2"],"模块化规范诞生了":["108.2"],"export":["108.3"],"module":["108.4"],"节点":["108.4"],"20220518233408346":["108.12"],"大量冗余的代码相互嵌套":["109.1"],"代码的":["109.1"],"可读性变差":["109.1"],"方法时":["109.3"],"成功的回调函数是必选的":["109.3"],"失败的回调函数是可选的":["109.3"],"上述的代码":["109.6"],"无法保证文件的读取顺序":["109.6"],"需要做进一步的改进":["109.6"],"就解决了回调地狱的问题":["109.7"],"r3":["109.8"],"res":["109.10","109.11"],"catch":["109.12"],"i":["109.12"],"message":["109.12"],"阅读性差":["110.1"],"不易理解":["110.1"],"d":["110.3"],"c":["110.3"],"执行异步任务的":["111.2"],"回调函数":["111.2"],"步":["111.3"],"它们的回调函数会被加入到任务队列中":["111.5"],"等待主线程空闲时再执行":["111.5"],"20220519155032272":["112.1"],"内部都是用javascript实现的":["113.1"],"我们主要学习jquery":["113.1"],"我们可以非常方便的调用和使用它":["113.2"],"从而提高开发效率":["113.2"],"开源":["113.3"],"更推荐使用第一种方式":["114.1"],"包括孙子等":["115.2"],"选择索引号为偶数的元素":["115.4"],"索引从0开始":["115.5"],"如果是复合属性则必须采取驼峰命名法":["116.1"],"如果值不是数字":["116.1"],"则需要加引号":["116.1"],"如":["117.5"],"而且返回是数字型":["118.3"],"方法可用于遍历任何对象":["120.1"],"主要用于数据处理":["120.1"],"比如数组":["120.1"],"里面的函数有两个参数":["120.1"],"index是每个元素的索引号":["120.1"],"element遍历内容":["120.1"],"放在目标元素的前面":["120.3"],"清空匹配元素的内容":["120.4"],"如果参数是数字":["121.1"],"则是修改相应值":["121.1"],"参数可以不必写单位":["121.1"],"设置或获取元素被卷去的头部和左侧":["121.2"],"方法设置或返回被选元素被卷曲的头部":["121.2"],"20220424214339932":["122.4"],"只能触发一次":["122.6"],"stoppropagation":["122.9"],"修改目标对象不会影响被拷贝对象":["123.1"],"如果有不冲突的属性":["123.1"],"会合并到一起":["123.1"],"noconflict":["123.2"],"click":["123.5"],"change":["123.5"],"中所有选择器都以美元符号开头":["124.0"],"选取多个元素":["124.1"],"animated":["124.3"],"选取正在执行动画的":["124.3"],"focus":["124.3"],"选取当前获取焦点的元素":["124.3"],"选取拥有属性id":["124.6"],"并且属性title以":["124.6"],"结束的":["124.6"],"中选取是唯一子元素的":["124.7"],"的子元素中被选中的元素":["124.8"],"选取所有不可见元素":["124.9"]}]'},n={"0.0":{t:"正在努力编写中......",p:"",l:"error.html",a:"正在努力编写中"},"1.0":{t:"# Html5 新特性\r",p:`HTML5的新增特性主要是针对于以前的不足，增加了一些新的标签、新的表单和新的表单属性等。
这些新特性都有兼容性问题，基本是 ...`,l:"front-end/CSS/HTML5新特性/01-新特性说明.html",a:"html5-新特性"},"2.0":{t:"# 语义化标签\r",p:`&lt;header&gt; :头部标签
&lt;nav&gt; :导航标签
&lt;article&gt; : 内容标签
 ...`,l:"front-end/CSS/HTML5新特性/02-语义化标签.html",a:"语义化标签"},"3.0":{t:"# 多媒体标签\r",p:`音频: &lt;audio&gt;
视频: &lt;video&gt;
使用它们可以很方便的在页面中嵌入音频和视频，而不再去 ...`,l:"front-end/CSS/HTML5新特性/03-多媒体标签.html",a:"多媒体标签"},"3.1":{t:"视频\r",p:`当前&lt;video&gt;元素支持三种视频格式：尽量使用MP4格式
!image-20230414195132235
& ...`,l:"front-end/CSS/HTML5新特性/03-多媒体标签.html#视频",a:"视频"},"3.2":{t:"音频\r",p:`mp3、wav、ogg
!image-20230414195456269
&lt;audio src=&quot;文件地址” ...`,l:"front-end/CSS/HTML5新特性/03-多媒体标签.html#音频",a:"音频"},"3.3":{t:"总结\r",p:`
音频标签和视频标签使用方式基本一致
浏览器支持情况不同
谷歌浏览器把音频和视频自动播放禁止了
我们可以给视频标签添加mut ...`,l:"front-end/CSS/HTML5新特性/03-多媒体标签.html#总结",a:"总结"},"4.0":{t:"# 表单控件\r",p:`HTML5新增的input类型



属性值
说明




type=&quot;email&quot;
限制用户输入必须为 ...`,l:"front-end/CSS/HTML5新特性/04-表单控件.html",a:"表单控件"},"4.1":{t:"表单属性\r",p:`


属性
值
说明




required
required
表单拥有该属性表示其内容不能为空，必填


placeho ...`,l:"front-end/CSS/HTML5新特性/04-表单控件.html#表单属性",a:"表单属性"},"5.0":{t:"# 选择器\r",p:"\r",l:"front-end/CSS/HTML5新特性/05-选择器.html",a:"选择器"},"5.1":{t:"属性选择器\r",p:`属性选择器可以根据元素特定属性的来选择元素。这样就可以不用借助于类或者id选择器



选择符
简介




E[att]
 ...`,l:"front-end/CSS/HTML5新特性/05-选择器.html#属性选择器",a:"属性选择器"},"5.2":{t:"结构伪类选择器\r",p:`结构伪类选择器主要根据文档结构来选择器元素，常用于根据父级选择器里面的子元素



选择符
简介




E:first-c ...`,l:"front-end/CSS/HTML5新特性/05-选择器.html#结构伪类选择器",a:"结构伪类选择器"},"5.3":{t:"伪元素选择器\r",p:`伪元素选择器可以帮助我们利用CSS创建新标签元素,而不需要HTML标签,从而简化HTML结构



选择符
简介




: ...`,l:"front-end/CSS/HTML5新特性/05-选择器.html#伪元素选择器",a:"伪元素选择器"},"5.4":{t:"ui元素状态伪类选择器\r",p:`


属性
说明




input:checked{}
选择单选或者复选框选中状态


e:enabled
表单元素可用状 ...`,l:"front-end/CSS/HTML5新特性/05-选择器.html#ui元素状态伪类选择器",a:"ui元素状态伪类选择器"},"5.5":{t:"否定伪类选择器\r",p:`e:not（f）


同级别下除了自己都选择

`,l:"front-end/CSS/HTML5新特性/05-选择器.html#否定伪类选择器",a:"否定伪类选择器"},"5.6":{t:"目标伪类选择器\r",p:`
实现跳转内容

div:target{

`,l:"front-end/CSS/HTML5新特性/05-选择器.html#目标伪类选择器",a:"目标伪类选择器"},"6.0":{t:"# 网站TDK三大标签SEO优化\r",p:"\r",l:"front-end/CSS/HTML5新特性/06-SEO优化.html",a:"网站tdk三大标签seo优化"},"6.1":{t:"SEO是什么\r",p:"SEO（Search Engine Optimization）汉译为搜索引擎优化，是一种利用搜索引擎的规则提高网站在有关搜索 ...",l:"front-end/CSS/HTML5新特性/06-SEO优化.html#seo是什么",a:"seo是什么"},"6.2":{t:"T – Title（网站标题）\r",p:`title 具有不可替代性，是我们内页的第一个重要标签，是搜索引擎了解网页的入口和对网页主题归属的最佳判断点。
建议：网站名 ...`,l:"front-end/CSS/HTML5新特性/06-SEO优化.html#t-–-title-网站标题",a:"t-–-title-网站标题"},"6.3":{t:"D – description（网站描述）\r",p:`简要说明我们网站主要是做什么的。
我们提倡，description 作为网站的总体业务和主题概括，多采用“我们是…”、“我们 ...`,l:"front-end/CSS/HTML5新特性/06-SEO优化.html#d-–-description-网站描述",a:"d-–-description-网站描述"},"6.4":{t:"K – keywords （关键字）\r",p:`keywords 是页面关键词，是搜索引擎的关注点之一。
keywords 最好限制为 6～8 个关键词，关键词之间用英文逗 ...`,l:"front-end/CSS/HTML5新特性/06-SEO优化.html#k-–-keywords-关键字",a:"k-–-keywords-关键字"},"7.0":{t:"# LOGO seo优化\r",p:`

logo 里面首先放一个h1标签，目的是为了提权，告诉搜索引攀，这个地方很重要。


h1里面再放一个链接，可以返回首页 ...`,l:"front-end/CSS/HTML5新特性/07-LOGO优化.html",a:"logo-seo优化"},"8.0":{t:"# 图片模糊处理 filter\r",p:"\r",l:"front-end/CSS/HTML5新特性/08-图片模糊处理.html",a:"图片模糊处理-filter"},"8.1":{t:"blur（px）\r",p:"给图像设置高斯模糊。&quot;radius&quot;一值设定高斯函数的标准差，或者是屏幕上以多少像素融在一起，所以值越大 ...",l:"front-end/CSS/HTML5新特性/08-图片模糊处理.html#blur-px",a:"blur-px"},"8.2":{t:"contrast（%）\r",p:"调整图像的对比度。值是0%的话，图像会全黑。值是100%，图像不变。值可以超过100%，意味着会运用更低的对比。若没有设置值 ...",l:"front-end/CSS/HTML5新特性/08-图片模糊处理.html#contrast",a:"contrast"},"8.3":{t:"grayscale（%）\r",p:"将图像转换为灰度图像。值定义转换的比例。值为100%则完全转为灰度图像，值为0%图像无变化。值在0%到100%之间，则是效果 ...",l:"front-end/CSS/HTML5新特性/08-图片模糊处理.html#grayscale",a:"grayscale"},"8.4":{t:"hue-rotate（deg）\r",p:"给图像应用色相旋转。&quot;angle&quot;一值设定图像会被调整的色环角度值。值为0deg，则图像无变化。若值未设 ...",l:"front-end/CSS/HTML5新特性/08-图片模糊处理.html#hue-rotate-deg",a:"hue-rotate-deg"},"8.5":{t:"drop-shadow（h-shadow v-shadow blur spread color）\r",p:"给图像设置一个阴影效果。阴影是合成在图像下面，可以有模糊度的，可以以特定颜色画出的遮罩图的偏移版本。 函数接受&lt;sha ...",l:"front-end/CSS/HTML5新特性/08-图片模糊处理.html#drop-shadow-h-shadow-v-shadow-blur-spread-color",a:"drop-shadow-h-shadow-v-shadow-blur-spread-color"},"8.6":{t:"invert(*%*)\r",p:"将图像转换为灰度图像。值定义转换的比例。值为100%则完全转为灰度图像，值为0%图像无变化。值在0%到100%之间，则是效果 ...",l:"front-end/CSS/HTML5新特性/08-图片模糊处理.html#invert",a:"invert"},"9.0":{t:"# calc 宽度计算\r",p:`width：calc（100%-80px）

`,l:"front-end/CSS/HTML5新特性/09-宽度计算.html",a:"calc-宽度计算"},"10.0":{t:"# transition过渡\r",p:"过渡( transition)是CSS3中具有颠覆性的特征之-,我们可以在不使用 Flash 动画或JavaScript的情 ...",l:"front-end/CSS/HTML5新特性/10-transition过渡.html",a:"transition过渡"},"11.0":{t:"# 2D转换\r",p:`转换( transform )是CSS3中具有颠爱性的特征之一, 可以实现元素的位移、旋转、缩放等效果
转换( transf ...`,l:"front-end/CSS/HTML5新特性/11-2D转换.html",a:"_2d转换"},"11.1":{t:"平面转换\r",p:`改变盒子在平面内的状态（位移、旋转、缩放）
2D转换
transform相对于盒子自身尺寸
translate（）只给一个值 ...`,l:"front-end/CSS/HTML5新特性/11-2D转换.html#平面转换",a:"平面转换"},"11.2":{t:"移动 translate\r",p:`
语法

transform: translate(x,y); 或者分开写
transform: translatex(n) ...`,l:"front-end/CSS/HTML5新特性/11-2D转换.html#移动-translate",a:"移动-translate"},"11.3":{t:"旋转 rotate\r",p:`2D旋转指的是让元素在2维平面内顺势针旋转或者逆时针旋转。
transform：rotate(度数)

重点


rotat ...`,l:"front-end/CSS/HTML5新特性/11-2D转换.html#旋转-rotate",a:"旋转-rotate"},"11.4":{t:"旋转中心点\r",p:`transform-origin：x y ；
可以写方位名词 left right top bottom
`,l:"front-end/CSS/HTML5新特性/11-2D转换.html#旋转中心点",a:"旋转中心点"},"11.5":{t:"缩放 scale\r",p:`transform：scale（x，y）
不可以是负数
x，y表示倍数
transform：scale（a）
等比例缩放，同 ...`,l:"front-end/CSS/HTML5新特性/11-2D转换.html#缩放-scale",a:"缩放-scale"},"11.6":{t:"综合写法\r",p:`注意:


同时使用多个转换,其格式为: transform: translate() rotate() scale().. ...`,l:"front-end/CSS/HTML5新特性/11-2D转换.html#综合写法",a:"综合写法"},"11.7":{t:"总结\r",p:`
转换transform 我们简单理解就是变形有2D和3D之分
我们暂且学了三个 分别是位移旋转和缩放
2D 移动trans ...`,l:"front-end/CSS/HTML5新特性/11-2D转换.html#总结",a:"总结"},"12.0":{t:"# 动画\r",p:"动画(animation)是CSS3中具有顛覆性的特征之一，可通过设置多个节点来精确控制一个或一组动画，常用来实现复杂的动画 ...",l:"front-end/CSS/HTML5新特性/12-动画.html",a:"动画"},"12.1":{t:"动画序列 keyframes\r",p:`
0%是动画的开始，100%是动画的完成。这样的规则就是动画序列。
在@keyframes中规定某项CSS样式，就能创建由当 ...`,l:"front-end/CSS/HTML5新特性/12-动画.html#动画序列-keyframes",a:"动画序列-keyframes"},"12.2":{t:"动画属性\r",p:`


属性
描述




@keyframes
规定动画。


animation
所有动画属性的简写属性，除了animat ...`,l:"front-end/CSS/HTML5新特性/12-动画.html#动画属性",a:"动画属性"},"12.3":{t:"动画简写\r",p:`animation :动画名称 持续时间 运动曲线 何时开始 播放次数 是否反方向 动画起始或者结束的状态;
animati ...`,l:"front-end/CSS/HTML5新特性/12-动画.html#动画简写",a:"动画简写"},"12.4":{t:"速度曲线 animation-timing-function\r",p:`


值
描述




linear
动画从头到尾的速度是相同的。匀速


ease
默认。动画以低速开始，然后加快，在结束 ...`,l:"front-end/CSS/HTML5新特性/12-动画.html#速度曲线-animation-timing-function",a:"速度曲线-animation-timing-function"},"13.0":{t:"# 渐变\r",p:`目标:使用background-image属性实现渐变背景效果

渐变是多个颜色逐渐变化的视觉效果
一般用于设置盒子的背景
 ...`,l:"front-end/CSS/HTML5新特性/13-渐变.html",a:"渐变"},"14.0":{t:"# 空间转换\r",p:`目标:使用transform属性实现元素在空间内的位移、旋转、缩放等效果

空间:是从坐标轴角度定义的x 、y和z三条坐标轴 ...`,l:"front-end/CSS/HTML5新特性/14-空间转换.html",a:"空间转换"},"14.1":{t:"空间位移\r",p:`语法：

transform: translate3d(x, y, z);
transform: translateX(值) ...`,l:"front-end/CSS/HTML5新特性/14-空间转换.html#空间位移",a:"空间位移"},"14.2":{t:"透视\r",p:`目标:使用perspective属性实现透视效果
属性(添加给父级)

perspective: 值;
取值:像素单位数值， ...`,l:"front-end/CSS/HTML5新特性/14-空间转换.html#透视",a:"透视"},"14.3":{t:"空间旋转\r",p:`目标:使用rotate实现元素空间旋转效果
语法：

transform: rotateZ(值);
transform: r ...`,l:"front-end/CSS/HTML5新特性/14-空间转换.html#空间旋转",a:"空间旋转"},"14.4":{t:"立体呈现\r",p:`目标:使用transform-style: preserve-3d呈现立体图形

思考: 使用perspective透视属性 ...`,l:"front-end/CSS/HTML5新特性/14-空间转换.html#立体呈现",a:"立体呈现"},"14.5":{t:"空间缩放\r",p:`目标:使用scale实现空间缩放效果
语法：

transform: scaleX(倍数);
transform: scal ...`,l:"front-end/CSS/HTML5新特性/14-空间转换.html#空间缩放",a:"空间缩放"},"15.0":{t:"# 起步\r",p:"\r",l:"front-end/CSS/基础/01-起步.html",a:"起步"},"15.1":{t:"什么是CSS？\r",p:"英文全名: cascading style sheets(百度百科)层叠样式表WEB标准中的表现标准语言,表现标准语言在网页 ...",l:"front-end/CSS/基础/01-起步.html#什么是css",a:"什么是css"},"15.2":{t:"CSS层叠样式表\r",p:`
选择器{属性：属性值；属性：属性值；}


CSS样式表

内部样式表
外部样式表
外部导入样式表
内联样式表

`,l:"front-end/CSS/基础/01-起步.html#css层叠样式表",a:"css层叠样式表"},"15.3":{t:"link和import的区别\r",p:`!image-20230414163954048
`,l:"front-end/CSS/基础/01-起步.html#link和import的区别",a:"link和import的区别"},"16.0":{t:"# 选择器\r",p:"\r",l:"front-end/CSS/基础/02-选择器.html",a:"选择器"},"16.1":{t:"选择器基本用法\r",p:`选择器（选择符）{属性：属性值；属性：属性值；}

!image-20230414171747804
`,l:"front-end/CSS/基础/02-选择器.html#选择器基本用法",a:"选择器基本用法"},"16.2":{t:"选择器分类\r",p:`选择器分为基础选择器和复合选择器两大类，先介绍基础选择器

基础选择器是由单个选择器组成的
基础选择器又包括：标签选择器、类 ...`,l:"front-end/CSS/基础/02-选择器.html#选择器分类",a:"选择器分类"},"16.3":{t:"选择器权重\r",p:`id选择器100 &gt; class选择器10 &gt; 类型选择器1 &gt; 通配符选择器0
`,l:"front-end/CSS/基础/02-选择器.html#选择器权重",a:"选择器权重"},"16.4":{t:"复合选择器\r",p:"\r",l:"front-end/CSS/基础/02-选择器.html#复合选择器",a:"复合选择器"},"16.5":{t:"后代选择器\r",p:`!image-20230414174832335
`,l:"front-end/CSS/基础/02-选择器.html#后代选择器",a:"后代选择器"},"16.6":{t:"子选择器\r",p:`!image-20230414174843237
`,l:"front-end/CSS/基础/02-选择器.html#子选择器",a:"子选择器"},"16.7":{t:"并集选择器\r",p:`!image-20230414174851085
`,l:"front-end/CSS/基础/02-选择器.html#并集选择器",a:"并集选择器"},"16.8":{t:"伪类选择器\r",p:`!image-20230414174915002
!image-20230414174923306
`,l:"front-end/CSS/基础/02-选择器.html#伪类选择器",a:"伪类选择器"},"16.9":{t:"focus伪类选择器\r",p:`!image-20230414174937886
`,l:"front-end/CSS/基础/02-选择器.html#focus伪类选择器",a:"focus伪类选择器"},"17.0":{t:"# 命名规范\r",p:"\r",l:"front-end/CSS/基础/03-命名规范.html",a:"命名规范"},"17.1":{t:"标签命名\r",p:`内容：content/container
导航：nav
侧栏：sidebar
栏目：column
标志：logo
页面主体： ...`,l:"front-end/CSS/基础/03-命名规范.html#标签命名",a:"标签命名"},"17.2":{t:"注释写法\r",p:`注释的写法:
/Footer/
内容区
/End Footer/
`,l:"front-end/CSS/基础/03-命名规范.html#注释写法",a:"注释写法"},"17.3":{t:"id命名\r",p:"\r",l:"front-end/CSS/基础/03-命名规范.html#id命名",a:"id命名"},"17.4":{t:"1、页面结构\r",p:`容器: container
页头：header
内容：content/container
页面主体：main
页尾：foot ...`,l:"front-end/CSS/基础/03-命名规范.html#_1、页面结构",a:"_1、页面结构"},"17.5":{t:"2、导航\r",p:`导航：nav
主导航：mainbav
子导航：subnav
顶导航：topnav
边导航：sidebar
左导航：lefts ...`,l:"front-end/CSS/基础/03-命名规范.html#_2、导航",a:"_2、导航"},"17.6":{t:"3、功能\r",p:`标志：logo
广告：banner
登陆：login
登录条：loginbar
注册：regsiter
搜索：search
 ...`,l:"front-end/CSS/基础/03-命名规范.html#_3、功能",a:"_3、功能"},"17.7":{t:"4、class命名\r",p:"\r",l:"front-end/CSS/基础/03-命名规范.html#_4、class命名",a:"_4、class命名"},"17.8":{t:"1、颜色\r",p:`使用颜色的名称或者16进制代码,如:
.red { color: red; }

.f60 { color: #f60; } ...`,l:"front-end/CSS/基础/03-命名规范.html#_1、颜色",a:"_1、颜色"},"17.9":{t:"2、字体大小\r",p:`直接使用&quot;font+字体大小&quot;作为名称,如:
.font12px { font-size: 12px;  ...`,l:"front-end/CSS/基础/03-命名规范.html#_2、字体大小",a:"_2、字体大小"},"17.10":{t:"3、对齐样式\r",p:`使用对齐目标的英文名称,如:
.left { float:left; } 
.bottom { float:bottom;  ...`,l:"front-end/CSS/基础/03-命名规范.html#_3、对齐样式",a:"_3、对齐样式"},"17.11":{t:"4、标题栏样式\r",p:`使用类别+功能的方式命名,如:
.barnews { } 
.barproduct { } 




一律小写


尽量用英 ...`,l:"front-end/CSS/基础/03-命名规范.html#_4、标题栏样式",a:"_4、标题栏样式"},"17.12":{t:"CSS文件命名\r",p:`主要的 master.css
模块 module.css
基本共用 base.css
主题 themes.css
专栏 co ...`,l:"front-end/CSS/基础/03-命名规范.html#css文件命名",a:"css文件命名"},"18.0":{t:"# Win快捷键\r",p:`Ctrl+S 保存 
Ctrl+W 关闭程序 
Ctrl+N 新建 
Ctrl+O 打开 
Ctrl+Z 撤销 
Ctrl+ ...`,l:"front-end/CSS/基础/04-Win快捷键.html",a:"win快捷键"},"19.0":{t:"# 字体属性\r",p:`


Font-family
字体





font-size
字体大小



font-weight
字体粗细
Norm ...`,l:"front-end/CSS/基础/05-字体属性.html",a:"字体属性"},"20.0":{t:"# 文本属性\r",p:`


属性
解释
用法




color
文本颜色
!red, green, blue, pink  #FFOOOO, # ...`,l:"front-end/CSS/基础/06-文本属性.html",a:"文本属性"},"21.0":{t:"# Emmet语法\r",p:"\r",l:"front-end/CSS/基础/07-Emmet语法.html",a:"emmet语法"},"21.1":{t:"快速生成HTML结构语法\r",p:`

生成标签直接输入标签名按tab键即可比如 div 然后tab键，就可以生成&lt;div&gt;&lt;/div&gt; ...`,l:"front-end/CSS/基础/07-Emmet语法.html#快速生成html结构语法",a:"快速生成html结构语法"},"21.2":{t:"快速格式化代码\r",p:`Vscode快速格式化代码: shift+alt+f
也可以设置当我们保存页面的时候自动格式化代码:
1)文件------& ...`,l:"front-end/CSS/基础/07-Emmet语法.html#快速格式化代码",a:"快速格式化代码"},"22.0":{t:"# 元素显示模式\r",p:"\r",l:"front-end/CSS/基础/08-元素显示模式.html",a:"元素显示模式"},"22.1":{t:"什么是元素显示模式\r",p:`作用：网页的标签非常多，在不同地方会用到不同类型的标签，了解他们的特点可以更好的布局我们的页面
元素显示模式就是元素（标签） ...`,l:"front-end/CSS/基础/08-元素显示模式.html#什么是元素显示模式",a:"什么是元素显示模式"},"22.2":{t:"块元素\r",p:"常见的块元素有&lt;h1&gt;~&lt;h6&gt;、&lt;p&gt;、&lt;div&gt;、&lt;u&gt;、& ...",l:"front-end/CSS/基础/08-元素显示模式.html#块元素",a:"块元素"},"22.3":{t:"行内元素\r",p:"常见的行内元素有&lt;a&gt;、&lt;strong&gt;、&lt;b&gt;、&lt;em&gt;、&lt;i&gt ...",l:"front-end/CSS/基础/08-元素显示模式.html#行内元素",a:"行内元素"},"22.4":{t:"元素显示模式转换\r",p:"特殊情况下，我们需要元素模式的转换，简单理解一个模式的元素需要另外一种模式的特性比如想要增加链接&lt;a&gt;的触发范围 ...",l:"front-end/CSS/基础/08-元素显示模式.html#元素显示模式转换",a:"元素显示模式转换"},"23.0":{t:"# CSS背景\r",p:"\r",l:"front-end/CSS/基础/09-背景.html",a:"css背景"},"23.1":{t:"背景颜色\r",p:`background-color
语法：
background-color : transparent | color

参 ...`,l:"front-end/CSS/基础/09-背景.html#背景颜色",a:"背景颜色"},"23.2":{t:"背景图片\r",p:`background-image
语法：
background-image : none | url(url)

参数：
n ...`,l:"front-end/CSS/基础/09-背景.html#背景图片",a:"背景图片"},"23.3":{t:"背景平铺\r",p:`background-repeat
语法：
background-repeat : repeat | no-repeat | ...`,l:"front-end/CSS/基础/09-背景.html#背景平铺",a:"背景平铺"},"23.4":{t:"背景图片位置\r",p:`background-position
语法：
background-position : length | length
 ...`,l:"front-end/CSS/基础/09-背景.html#背景图片位置",a:"背景图片位置"},"23.5":{t:"背景滚动\r",p:`background-attachment
语法：
background-attachment : scroll | fix ...`,l:"front-end/CSS/基础/09-背景.html#背景滚动",a:"背景滚动"},"23.6":{t:"背景复合写法\r",p:`!image-20230414180416235
`,l:"front-end/CSS/基础/09-背景.html#背景复合写法",a:"背景复合写法"},"23.7":{t:"背景透明\r",p:`!image-20230414180424964
`,l:"front-end/CSS/基础/09-背景.html#背景透明",a:"背景透明"},"23.8":{t:"背景总结\r",p:`!image-20230414180438812
`,l:"front-end/CSS/基础/09-背景.html#背景总结",a:"背景总结"},"24.0":{t:"# CSS特性\r",p:"\r",l:"front-end/CSS/基础/10-CSS特性.html",a:"css特性"},"24.1":{t:"层叠性\r",p:`相同选择器给设置相同的样式，此时一个样式就会覆盖（层曼）另一个冲突的样式。层叠性主要解决样式冲突的问题

层叠性原则:

样 ...`,l:"front-end/CSS/基础/10-CSS特性.html#层叠性",a:"层叠性"},"24.2":{t:"继承性\r",p:`CSS中的继承:子标签会继承父标签的某些样式，如文本颜色和字号。简单的理解就是∶子承父业。
恰当地使用继承可以简化代码，降低 ...`,l:"front-end/CSS/基础/10-CSS特性.html#继承性",a:"继承性"},"24.3":{t:"行高的继承性\r",p:`!image-20230414181133732

行高可以跟单位也可以不跟单位
如果子元素没有设置行高，则会继承父元素的行 ...`,l:"front-end/CSS/基础/10-CSS特性.html#行高的继承性",a:"行高的继承性"},"24.4":{t:"优先级\r",p:`!image-20230414181520748


权重是有4组数字组成但是不会有进位。
可以理解为类选择器永远大于元素选 ...`,l:"front-end/CSS/基础/10-CSS特性.html#优先级",a:"优先级"},"25.0":{t:"# 盒子模型\r",p:`本质：

先准备好相关的网页元素,网页元素基本都是盒子Box
利用CSS设置好盒子样式,然后摆放到相应位置
往盒子里面装内容 ...`,l:"front-end/CSS/基础/11-盒子模型.html",a:"盒子模型"},"25.1":{t:"盒子模型的组成\r",p:`!image-20230414184106921

Border 盒子边框
Content 内容
Padding 盒子边框与 ...`,l:"front-end/CSS/基础/11-盒子模型.html#盒子模型的组成",a:"盒子模型的组成"},"25.2":{t:"边框border\r",p:"\r",l:"front-end/CSS/基础/11-盒子模型.html#边框border",a:"边框border"},"25.3":{t:"边框\r",p:`border
语法：
border : border-width | border-style | border-color ...`,l:"front-end/CSS/基础/11-盒子模型.html#边框",a:"边框"},"25.4":{t:"边框粗细\r",p:`border-width
参数：
medium : 默认宽度
thin : 小于默认宽度
thick : 大于默认宽度
le ...`,l:"front-end/CSS/基础/11-盒子模型.html#边框粗细",a:"边框粗细"},"25.5":{t:"边框样式\r",p:`border-style
!image-20230414184451480
参数：
none : 无边框。与任何指定的bor ...`,l:"front-end/CSS/基础/11-盒子模型.html#边框样式",a:"边框样式"},"25.6":{t:"边框颜色\r",p:`border-color
`,l:"front-end/CSS/基础/11-盒子模型.html#边框颜色",a:"边框颜色"},"25.7":{t:"边框复合写法\r",p:`!image-20230414184517907
`,l:"front-end/CSS/基础/11-盒子模型.html#边框复合写法",a:"边框复合写法"},"25.8":{t:"表格边框\r",p:`border-collapse
控制浏览器绘制表格边框的方式。它控制相邻单元格的边框。
语法：
border-collaps ...`,l:"front-end/CSS/基础/11-盒子模型.html#表格边框",a:"表格边框"},"25.9":{t:"内边距padding\r",p:`padding属性用于设置内边距,即边框与内容之间的距离。
会影响盒子实际大小：已有宽高，会撑大盒子



属性
作用


 ...`,l:"front-end/CSS/基础/11-盒子模型.html#内边距padding",a:"内边距padding"},"25.10":{t:"外边距margin\r",p:`margin属性用于设置外边距,即控制盒子和盒子之间的距离。
margin简写和padding一样
外边距可以让块级盒子水平 ...`,l:"front-end/CSS/基础/11-盒子模型.html#外边距margin",a:"外边距margin"},"25.11":{t:"外边距合并-嵌套块元素塌陷\r",p:`

相邻块元素垂直外边距的合并
当上下相邻的两个块元素(兄弟关系)相遇时,如果上面的元素有下外边距margin-bottom ...`,l:"front-end/CSS/基础/11-盒子模型.html#外边距合并-嵌套块元素塌陷",a:"外边距合并-嵌套块元素塌陷"},"25.12":{t:"圆角边框\r",p:`border-radius
!image-20230414185035850
`,l:"front-end/CSS/基础/11-盒子模型.html#圆角边框",a:"圆角边框"},"25.13":{t:"盒子阴影\r",p:`box-shadow
语法：
box-shadow: h-shadow v- shadow blur spread colo ...`,l:"front-end/CSS/基础/11-盒子模型.html#盒子阴影",a:"盒子阴影"},"25.14":{t:"文字阴影\r",p:`text-shadow
语法：
text-shadow: h-shadow v-shadow blur color ;


 ...`,l:"front-end/CSS/基础/11-盒子模型.html#文字阴影",a:"文字阴影"},"25.15":{t:"盒子模型新增-怪异盒\r",p:"CSS3中可以通过box- sizing来指定盒模型,有2个值:即可指定为content-box、border-box ,这 ...",l:"front-end/CSS/基础/11-盒子模型.html#盒子模型新增-怪异盒",a:"盒子模型新增-怪异盒"},"26.0":{t:"# 浮动\r",p:`传统网页布局的三种方式


普通流（标准流）
按照规定好的默认方式排列

块级元素会独占一行,从上向下顺序排列

​	常用元 ...`,l:"front-end/CSS/基础/12-浮动.html",a:"浮动"},"26.1":{t:"什么是浮动\r",p:`float属性用于创建浮动框,将其移动到一边,直到左边缘或右边缘触及包含块或另一个浮动框的边缘
语法:
选择器{ float ...`,l:"front-end/CSS/基础/12-浮动.html#什么是浮动",a:"什么是浮动"},"26.2":{t:"浮动特性\r",p:`加了浮动之后的元素,会具有很多特性需要我们掌握的：


浮动元素会脱离标准流(脱标)


浮动的元素会一行内显示井且元素顶部 ...`,l:"front-end/CSS/基础/12-浮动.html#浮动特性",a:"浮动特性"},"26.3":{t:"浮动布局注意点\r",p:`

浮动和标准流的父盒子搭配
先用标准流的父元素排列上下位置,之后内部子元素采取浮动排列左右位置


一个元素浮动了,理论上 ...`,l:"front-end/CSS/基础/12-浮动.html#浮动布局注意点",a:"浮动布局注意点"},"26.4":{t:"清除浮动\r",p:`清除浮动本质：

清除浮动的本质是清除浮动元素造成的影响
如果父盒子本身有高度,则不需要清除浮动
清除浮动之后， 父级就会根 ...`,l:"front-end/CSS/基础/12-浮动.html#清除浮动",a:"清除浮动"},"26.5":{t:"清除浮动的方法\r",p:`
额外标签法也称为隔墙法,是W3C推荐的做法
父级添加overflow属性
父级添加after伪元素
父级添加双伪元素

`,l:"front-end/CSS/基础/12-浮动.html#清除浮动的方法",a:"清除浮动的方法"},"26.6":{t:"额外标签法\r",p:`也称为隔墙法,是W3C推荐的做法
额外标签法会在浮动元素末尾添加一个空的标签
&lt;div style=&quot; cl ...`,l:"front-end/CSS/基础/12-浮动.html#额外标签法",a:"额外标签法"},"26.7":{t:"父级添加overflow\r",p:`可以给父级添加overflow属性,将其属性值设置为hidden. auto 或scroll

注意是给父元素添加代码


 ...`,l:"front-end/CSS/基础/12-浮动.html#父级添加overflow",a:"父级添加overflow"},"26.8":{t:"after伪元素法\r",p:`:after方式是额外标签法的升级版。也是给父元素添加
.clearfix:after{
	content: &quot;& ...`,l:"front-end/CSS/基础/12-浮动.html#after伪元素法",a:"after伪元素法"},"26.9":{t:"双伪元素清除浮动\r",p:`也是给父元素添加
.clearfix:before, 
.clearfix:after {
	content:&quot;& ...`,l:"front-end/CSS/基础/12-浮动.html#双伪元素清除浮动",a:"双伪元素清除浮动"},"26.10":{t:"清除浮动总结\r",p:`为什么需要清除浮动?

父级没高度
子盒子浮动了
影响下面布局了,我们就应该清除浮动了




清除浮动的方式
优点
缺点
 ...`,l:"front-end/CSS/基础/12-浮动.html#清除浮动总结",a:"清除浮动总结"},"27.0":{t:"# 定位\r",p:`某个元素可以自由在一个盒子内移动位置，并且压住屏幕某个位置
定位:将盒子定在某一个位置 ,所以定位也是在摆放盒子,按照定位的 ...`,l:"front-end/CSS/基础/13-定位.html",a:"定位"},"27.1":{t:"定位组成\r",p:"\r",l:"front-end/CSS/基础/13-定位.html#定位组成",a:"定位组成"},"27.2":{t:"定位模式\r",p:`决定元素的定位方式,它通过CSS的position属性来设置,其值可以分为四个:



值
语义




static
静态 ...`,l:"front-end/CSS/基础/13-定位.html#定位模式",a:"定位模式"},"27.3":{t:"边偏移\r",p:`


边偏移属性
示例
描述




top
top: 80px
顶端偏移量，定义元素相对于其父元素上边线的距离.


bo ...`,l:"front-end/CSS/基础/13-定位.html#边偏移",a:"边偏移"},"27.4":{t:"定位方式\r",p:"\r",l:"front-end/CSS/基础/13-定位.html#定位方式",a:"定位方式"},"27.5":{t:"静态定位\r",p:`静态定位是元素的默认定位方式，无定位的意思

静态定位按照标准流特性摆放位置,它没有边偏移
静态定位在布局时很少用到

`,l:"front-end/CSS/基础/13-定位.html#静态定位",a:"静态定位"},"27.6":{t:"相对定位\r",p:`相对定位是元素在移动位置的时候,是相对于它原来的位置来说的(自恋型)
相对定位的特点: (务必记住)

它是相对于自己原来的 ...`,l:"front-end/CSS/基础/13-定位.html#相对定位",a:"相对定位"},"27.7":{t:"绝对定位\r",p:`绝对定位是元素在移动位置的时候,是相对于它祖先元素来说的(拼爹型)

如果没有祖先元素或者祖先元素没有定位,则以浏览器为准定 ...`,l:"front-end/CSS/基础/13-定位.html#绝对定位",a:"绝对定位"},"27.8":{t:"固定定位\r",p:`固定定位是元素固定于浏览器可视区的位置。主要使用场景:可以在浏览器页面滚动时元素的位置不会改变
固定定位的特点: (务必记住 ...`,l:"front-end/CSS/基础/13-定位.html#固定定位",a:"固定定位"},"27.9":{t:"根据版心定位\r",p:`

让固定定位的盒子left: 50%.走到浏览器可视区(也可以看做版心)的一半位置


让固定定位的盒子margin-le ...`,l:"front-end/CSS/基础/13-定位.html#根据版心定位",a:"根据版心定位"},"27.10":{t:"粘性定位 sticky\r",p:`粘性定位可以被认为是相对定位和固定定位的混合。sticky粘性的
粘性定位的特点:

以浏览器的可视窗口为参照点移动元索(固 ...`,l:"front-end/CSS/基础/13-定位.html#粘性定位-sticky",a:"粘性定位-sticky"},"27.11":{t:"定位总结\r",p:`!image-20230414190952891
`,l:"front-end/CSS/基础/13-定位.html#定位总结",a:"定位总结"},"27.12":{t:"定位叠放次序 z-index\r",p:`在使用定位布局时,可能会出现盒子重叠的情况。此时,可以使用Z-index来控制盒子的前后次序(z轴)
语法:
选择器{ z- ...`,l:"front-end/CSS/基础/13-定位.html#定位叠放次序-z-index",a:"定位叠放次序-z-index"},"27.13":{t:"定位的拓展\r",p:"\r",l:"front-end/CSS/基础/13-定位.html#定位的拓展",a:"定位的拓展"},"27.14":{t:"定位特殊特性\r",p:`绝对定位和固定定位也和浮动类似

行内元素添加绝对或者固定定位,可以直接设置高度和宽度
块级元素添加绝对或者固定定位,如果不 ...`,l:"front-end/CSS/基础/13-定位.html#定位特殊特性",a:"定位特殊特性"},"27.15":{t:"脱标的盒子不会触发外边距塌陷\r",p:`浮动元素、绝对定位(固定定位 )元素的都不会触发外边距合并的问题
`,l:"front-end/CSS/基础/13-定位.html#脱标的盒子不会触发外边距塌陷",a:"脱标的盒子不会触发外边距塌陷"},"27.16":{t:"绝对定位(固定定位)会完全压住盒子\r",p:`浮动元素不同,只会压住它下面标准流的盒子,但是不会压住下面标准流盒子里面的文字(图片)
但是绝对定位(固定定位)会压住下面标 ...`,l:"front-end/CSS/基础/13-定位.html#绝对定位-固定定位-会完全压住盒子",a:"绝对定位-固定定位-会完全压住盒子"},"28.0":{t:"# 元素的显示与隐藏\r",p:`类似网站广告,当我们点击关闭就不见了,但是我们重新刷新页面,会重新出现!
本质:让一个元素在页面中隐藏或者显示出来。
`,l:"front-end/CSS/基础/14-元素显示与隐藏.html",a:"元素的显示与隐藏"},"28.1":{t:"display属性\r",p:`display属性用于设置-个元索应如何显示

display:none ; 隐藏对象
display: block ;除了 ...`,l:"front-end/CSS/基础/14-元素显示与隐藏.html#display属性",a:"display属性"},"28.2":{t:"visibility可见性\r",p:`语法：
 visibility: inherit | visible | collapse | hidden

参数：
in ...`,l:"front-end/CSS/基础/14-元素显示与隐藏.html#visibility可见性",a:"visibility可见性"},"28.3":{t:"overflow 溢出\r",p:`语法：
overflow : visible | auto | hidden | scroll

参数：
visible : ...`,l:"front-end/CSS/基础/14-元素显示与隐藏.html#overflow-溢出",a:"overflow-溢出"},"29.0":{t:"# 字体图标\r",p:"\r",l:"front-end/CSS/基础/15-字体图标.html",a:"字体图标"},"29.1":{t:"字体图标的产生\r",p:`字体图标使用场景:主要用于显示网页中通用、常用的一些小图标
精灵图是有诸多优点的，但是缺点很明显：


图片文件还是比较大的 ...`,l:"front-end/CSS/基础/15-字体图标.html#字体图标的产生",a:"字体图标的产生"},"29.2":{t:"字体图标引入\r",p:`字体文件格式
不同浏览器所支持的字体格式是不样的,字体图标之所以兼容.就是因为包含了生流浏览器支持的字体文件


TureT ...`,l:"front-end/CSS/基础/15-字体图标.html#字体图标引入",a:"字体图标引入"},"29.3":{t:"字体图标追加\r",p:`!image-20230414192416711
`,l:"front-end/CSS/基础/15-字体图标.html#字体图标追加",a:"字体图标追加"},"30.0":{t:"# 移动WEB\r",p:"\r",l:"front-end/CSS/移动WEB/01-移动WEB.html",a:"移动web"},"30.1":{t:"分辨率\r",p:`屏幕尺寸

指的是屏幕对角线的长度，一般用英寸来度量

分辨率分类


物理分辨率是生产屏幕时就固定的，它是不可被改变的

 ...`,l:"front-end/CSS/移动WEB/01-移动WEB.html#分辨率",a:"分辨率"},"30.2":{t:"视口\r",p:`使用meta标签设置视口宽度，制作适配不同设备宽度的网页
目标：网页宽度和设备宽度(分辨率)相同。
解决办法：添加视口标签。 ...`,l:"front-end/CSS/移动WEB/01-移动WEB.html#视口",a:"视口"},"30.3":{t:"二倍图\r",p:`能够使用像素大厨软件测量二倍图中元素的尺寸
图片分辨率, 为了高分辨率下图片不会模糊失真
二倍图一般指750像素宽度的图片
`,l:"front-end/CSS/移动WEB/01-移动WEB.html#二倍图",a:"二倍图"},"30.4":{t:"设计稿尺寸\r",p:`现阶段设计稿参考iPhone6/7/8，设备宽度375px产出设计稿。
二倍图设计稿尺寸：750px
!image-2023 ...`,l:"front-end/CSS/移动WEB/01-移动WEB.html#设计稿尺寸",a:"设计稿尺寸"},"30.5":{t:"百分比布局\r",p:`能够使用百分比布局开发网页


百分比布局， 也叫流式布局


效果： 宽度自适应，高度固定


`,l:"front-end/CSS/移动WEB/01-移动WEB.html#百分比布局",a:"百分比布局"},"31.0":{t:"# flex布局\r",p:"\r",l:"front-end/CSS/移动WEB/02-flex布局.html",a:"flex布局"},"31.1":{t:"弹性布局\r",p:`问题

多个盒子横向排列使用什么属性？

​		 浮动

设置盒子间的间距使用什么属性？

	margin 


需要注意什 ...`,l:"front-end/CSS/移动WEB/02-flex布局.html#弹性布局",a:"弹性布局"},"31.2":{t:"flex布局的特点\r",p:`

是一种浏览器提倡的布局模型


布局网页更简单、灵活


避免浮动脱标的问题


`,l:"front-end/CSS/移动WEB/02-flex布局.html#flex布局的特点",a:"flex布局的特点"},"31.3":{t:"flex布局模型构成\r",p:`作用：


基于flex精确灵活控制块级盒子的布局方式，避免浮动布局中脱离文档流现象发生


flex布局非常适合结构化布局 ...`,l:"front-end/CSS/移动WEB/02-flex布局.html#flex布局模型构成",a:"flex布局模型构成"},"31.4":{t:"主轴对齐方式——justify-content\r",p:`修改主轴对齐方式
&lt;!--使用justify-content调节元素在主轴的对齐方式--&gt;
justify-co ...`,l:"front-end/CSS/移动WEB/02-flex布局.html#主轴对齐方式——justify-content",a:"主轴对齐方式——justify-content"},"31.5":{t:"侧轴对齐方式——align-items\r",p:`使用align-items调节元素在侧轴的对齐方式


修改侧轴对齐方式属性
==align-items：；==（添加到弹性 ...`,l:"front-end/CSS/移动WEB/02-flex布局.html#侧轴对齐方式——align-items",a:"侧轴对齐方式——align-items"},"31.6":{t:"伸缩比——flex\r",p:`使用flex属性修改弹性盒子伸缩比


属性

flex：值；



取值分类

数值（整数）

&lt;!--注意：只占用 ...`,l:"front-end/CSS/移动WEB/02-flex布局.html#伸缩比——flex",a:"伸缩比——flex"},"31.7":{t:"主轴方向——flex-direction\r",p:`使用flex-direction改变元素排列方向

主轴默认是水平方向, 侧轴默认是垂直方向
修改主轴方向属性: flex- ...`,l:"front-end/CSS/移动WEB/02-flex布局.html#主轴方向——flex-direction",a:"主轴方向——flex-direction"},"31.8":{t:"弹性盒子换行\r",p:`使用flex-wrap实现弹性盒子多行排列效果



属性
作用




nowrap
默认值。规定灵活的项目不拆行或不拆列 ...`,l:"front-end/CSS/移动WEB/02-flex布局.html#弹性盒子换行",a:"弹性盒子换行"},"32.0":{t:"# 移动适配\r",p:`

rem ： 目前多数企业在用的解决方案


vw / vh：未来的解决方案


`,l:"front-end/CSS/移动WEB/03-移动适配.html",a:"移动适配"},"32.1":{t:" ",p:"",l:"front-end/CSS/移动WEB/03-移动适配.html#",a:""},"32.2":{t:"rem\r",p:`​	能够使用rem单位设置网页元素的尺寸


网页效果
屏幕宽度不同，网页元素尺寸不同（等比缩放）


px单位或百分比布局 ...`,l:"front-end/CSS/移动WEB/03-移动适配.html#rem",a:"rem"},"32.3":{t:"rem移动适配——媒体查询\r",p:`能够使用媒体查询设置差异化CSS样式


媒体查询能够检测视口的宽度，然后编写差异化的 CSS 样式


当某个条件成立,  ...`,l:"front-end/CSS/移动WEB/03-移动适配.html#rem移动适配——媒体查询",a:"rem移动适配——媒体查询"},"32.4":{t:"视口适配方案\r",p:`目前rem布局方案中，将网页等分成10份， HTML标签的字号为视口宽度的 1/10
!image-202204091542 ...`,l:"front-end/CSS/移动WEB/03-移动适配.html#视口适配方案",a:"视口适配方案"},"32.5":{t:"常用适配范围\r",p:`设备范围
默认样式 注意：默认样式要写在最前面
打印样式
@media print{}

手机或小屏手持设备
@media  ...`,l:"front-end/CSS/移动WEB/03-移动适配.html#常用适配范围",a:"常用适配范围"},"32.6":{t:"flexible\r",p:`使用flexible js配合rem实现在不同宽度的设备中，网页元素尺寸等比缩放效果
核心原理就是根据不同的视口宽度给网页中 ...`,l:"front-end/CSS/移动WEB/03-移动适配.html#flexible",a:"flexible"},"32.7":{t:"less\r",p:`less是一个css预处理器，less文件后缀为.less
扩充了css语言，使css具备一定的逻辑性、计算能力

注意：浏 ...`,l:"front-end/CSS/移动WEB/03-移动适配.html#less",a:"less"},"32.8":{t:"less语法\r",p:`使用Less运算写法完成px单位到rem单位的转换
思考：在px单位转换到rem单位过程中，哪项工作是最麻烦的？
答：除法运 ...`,l:"front-end/CSS/移动WEB/03-移动适配.html#less语法",a:"less语法"},"32.9":{t:"使用/导入\r",p:`在vscode里面找到easy less
!image-20220409161812504
即可自动生成对应的css样式文件 ...`,l:"front-end/CSS/移动WEB/03-移动适配.html#使用-导入",a:"使用-导入"},"32.10":{t:"注释\r",p:`

单行注释


语法
//注释内容



快捷键
ctrl+/





块注释


语法
/*注释内容*/



快捷键 ...`,l:"front-end/CSS/移动WEB/03-移动适配.html#注释",a:"注释"},"32.11":{t:"计算\r",p:`加减乘除的基本表达式
==不能单独写100 / 4px==
除法需要添加小括号或者.。
.box {
	width: 100 ...`,l:"front-end/CSS/移动WEB/03-移动适配.html#计算",a:"计算"},"32.12":{t:"嵌套\r",p:`作用

​	快速生成后代选择器
语法!image-20220409171230186

注意：&amp;不生成后代选择器，表 ...`,l:"front-end/CSS/移动WEB/03-移动适配.html#嵌套",a:"嵌套"},"32.13":{t:"变量\r",p:`把颜色提前存储到一个容器，设置属性值为这个容器名
变量：存储数据，方便使用和修改
语法
​	定义变量：@变量名：值；
​	使 ...`,l:"front-end/CSS/移动WEB/03-移动适配.html#变量",a:"变量"},"32.14":{t:"导入\r",p:`导入: @import “文件路径”;
!image-20220409175558579
`,l:"front-end/CSS/移动WEB/03-移动适配.html#导入",a:"导入"},"32.15":{t:"导出\r",p:`
方法一：

​	配置easyless插件，实现所有less有相同的导出路径
配置插件：设置——搜索easyless——在s ...`,l:"front-end/CSS/移动WEB/03-移动适配.html#导出",a:"导出"},"32.16":{t:"禁止导出\r",p:`在less文件第一行添加: // out: false
!image-20220409180935058
`,l:"front-end/CSS/移动WEB/03-移动适配.html#禁止导出",a:"禁止导出"},"32.17":{t:"vw/vh适配\r",p:`实现在不同宽度的设备中，网页元素尺寸等比缩放效果
`,l:"front-end/CSS/移动WEB/03-移动适配.html#vw-vh适配",a:"vw-vh适配"},"32.18":{t:"vw/vh\r",p:`
相对单位
相对视口的尺寸计算结果
vw：viewport width

1vw=1/100视口宽度


vh：viewpo ...`,l:"front-end/CSS/移动WEB/03-移动适配.html#vw-vh",a:"vw-vh"},"32.19":{t:"vw适配原理\r",p:`
vw单位尺寸

确定设计稿对应的vw的尺寸
vw单位的尺寸=px单位数值/（1/100视口宽度）



`,l:"front-end/CSS/移动WEB/03-移动适配.html#vw适配原理",a:"vw适配原理"},"33.0":{t:"# 媒体查询\r",p:`
开发常用写法

媒体特性常用写法

max-width
min-width





!image-20220410192 ...`,l:"front-end/CSS/移动WEB/04-媒体查询.html",a:"媒体查询"},"33.1":{t:"语法\r",p:`完整写法
!image-20220410194220892
关键词

and
only
not

`,l:"front-end/CSS/移动WEB/04-媒体查询.html#语法",a:"语法"},"33.2":{t:"媒体类型\r",p:`能够根据设备宽度的变化，设置差异化样式
媒体是用来区分设备类型的，如屏幕设备、打印设备等，其中手机、电脑、平板都属于屏幕设备 ...`,l:"front-end/CSS/移动WEB/04-媒体查询.html#媒体类型",a:"媒体类型"},"33.3":{t:"媒体特征\r",p:`媒体特性主要用来描述媒体类型的具体特征，如当前屏幕的宽高、分辨率、横屏或竖屏等。



特性名称
属性
值




视口的宽 ...`,l:"front-end/CSS/移动WEB/04-媒体查询.html#媒体特征",a:"媒体特征"},"33.4":{t:"外链式css引入\r",p:`!image-20220410194952713
`,l:"front-end/CSS/移动WEB/04-媒体查询.html#外链式css引入",a:"外链式css引入"},"34.0":{t:"# CSS三角形\r",p:`div {
width: 0;
height: 0;
line-height: 0;
font-size: 0;
borde ...`,l:"front-end/CSS/进阶/01-三角形.html",a:"css三角形"},"35.0":{t:"# CSS用户界面\r",p:`什么是界面样式
所谓的界面样式，就是更改一些用户操作样式，以便提高更好的用户体验

更改用户的鼠标样式
表单轮廓
防止表单域 ...`,l:"front-end/CSS/进阶/02-用户界面交互.html",a:"css用户界面"},"35.1":{t:"鼠标样式 cursor\r",p:`设置或检索在对象上移动的鼠标指针采用何种系统预定义的光标形状
li {cursor: pointer; }




属性值
 ...`,l:"front-end/CSS/进阶/02-用户界面交互.html#鼠标样式-cursor",a:"鼠标样式-cursor"},"35.2":{t:"轮廓线 outline\r",p:`给表单添加outline:0;或者outline: none;样式之后，就可以去掉默认的蓝色边框
input {outlin ...`,l:"front-end/CSS/进阶/02-用户界面交互.html#轮廓线-outline",a:"轮廓线-outline"},"35.3":{t:"文本框 textarea\r",p:`防止拖拽
div{resize：none；}

`,l:"front-end/CSS/进阶/02-用户界面交互.html#文本框-textarea",a:"文本框-textarea"},"36.0":{t:"# 解决图片底部默认空白缝隙问题\r",p:`bug:图片底侧会有一个白缝隙，原因是行内块元素会和文字的基线对齐
主要解决方法有两种:

给图片添加vertical-al ...`,l:"front-end/CSS/进阶/03-图片底部空白间隙.html",a:"解决图片底部默认空白缝隙问题"},"37.0":{t:"# vertical-align 垂直居中\r",p:`CSS的vertical-align属性使用场景。经常用于设置图片或者表单(行内块元素)和文字垂直对齐。
官方解释:用于设置 ...`,l:"front-end/CSS/进阶/04-垂直居中.html",a:"vertical-align-垂直居中"},"38.0":{t:"# 溢出的文字省略号显示\r",p:"\r",l:"front-end/CSS/进阶/05-溢出文字省略号.html",a:"溢出的文字省略号显示"},"38.1":{t:"**单行文本溢出显示省略号**\r",p:`/*必须满足三个条件*/
/*1.先强制-行内显示文本*/
	white-space: nowrap; ( 默认normal ...`,l:"front-end/CSS/进阶/05-溢出文字省略号.html#单行文本溢出显示省略号",a:"单行文本溢出显示省略号"},"38.2":{t:"**多行文本溢出显示省略号**\r",p:`
有较大兼容性问题，适合于webKit浏览器或移动端(移动端大部分是webkit内核)

/*如下设置*/	
	overfl ...`,l:"front-end/CSS/进阶/05-溢出文字省略号.html#多行文本溢出显示省略号",a:"多行文本溢出显示省略号"},"39.0":{t:"# 布局技巧\r",p:"\r",l:"front-end/CSS/进阶/06-布局技巧.html",a:"布局技巧"},"39.1":{t:"margin负值的运用\r",p:`盒子左浮，边框重叠解决方法
float: left;
border: 1px solid red ;
margin-left ...`,l:"front-end/CSS/进阶/06-布局技巧.html#margin负值的运用",a:"margin负值的运用"},"39.2":{t:"文字围绕浮动元素\r",p:`!image-20230414193402887
`,l:"front-end/CSS/进阶/06-布局技巧.html#文字围绕浮动元素",a:"文字围绕浮动元素"},"39.3":{t:"行内块的巧妙运用\r",p:`text-align会使行内元素和行内块元素全部水平居中
`,l:"front-end/CSS/进阶/06-布局技巧.html#行内块的巧妙运用",a:"行内块的巧妙运用"},"39.4":{t:"CSS三角强化\r",p:`!image-20230414193432997
width: 0;
height: 0;
border -color: t ...`,l:"front-end/CSS/进阶/06-布局技巧.html#css三角强化",a:"css三角强化"},"40.0":{t:"# CSS初始化\r",p:`不同浏览器对有些标签的默认值是不同的，为了消除不同浏览器对HTML文本呈现的差异，照顾浏览器的兼容，我们需要对CSS初始化
 ...`,l:"front-end/CSS/进阶/07-CSS初始化.html",a:"css初始化"},"41.0":{t:"# 图片边框 object-fit\r",p:`


属性
方法




fill
默认值。调整替换后的内容大小，以填充元素的内容框。如有必要，将拉伸或者挤压物体以适应该对 ...`,l:"front-end/CSS/进阶/08-图片边框.html",a:"图片边框-object-fit"},"42.0":{t:"# 精灵图\r",p:"\r",l:"front-end/CSS/进阶/09-精灵图.html",a:"精灵图"},"42.1":{t:"为什么需要精灵图\r",p:"一个网页中往往会应用很多小的背景图像作为修饰，当网页中的图像过多时，服务器就会频繁地接收和发送请求图片，造成服务器请求压力过 ...",l:"front-end/CSS/进阶/09-精灵图.html#为什么需要精灵图",a:"为什么需要精灵图"},"42.2":{t:"精灵图（sprites）使用\r",p:`使用精灵图核心:


精灵技术主要针对于背景图片使用。就是把多个小背景图片整合到一张大图片中。


这个大图片也称为spri ...`,l:"front-end/CSS/进阶/09-精灵图.html#精灵图-sprites-使用",a:"精灵图-sprites-使用"},"43.0":{t:"# 基本概念\r",p:"\r",l:"front-end/HTML/01-基本概念.html",a:"基本概念"},"43.1":{t:"网页组成部分\r",p:`
html结构（表现）

W3C制定了结构html的语法、标准

css表现（样式）

W3C制定了表现css的语法、标准
 ...`,l:"front-end/HTML/01-基本概念.html#网页组成部分",a:"网页组成部分"},"43.2":{t:"<!DOCTYPE>标签\r",p:`我们使用VSCode的快捷方式来创建基本标签时，会出现如下图所示的情况：
!image-20230413193140630
 ...`,l:"front-end/HTML/01-基本概念.html#doctype-标签",a:"doctype-标签"},"43.3":{t:"lang\r",p:`lang：是用来定义当前文档显示的语言
语言的种类：

en定义语言为英语
zh-CN定义语言为中文

简单来说，定义en就 ...`,l:"front-end/HTML/01-基本概念.html#lang",a:"lang"},"43.4":{t:"charset字符集\r",p:`字符集（Character set）是多个字符的集合，以便计算机能够识别和存储各种文字
在&lt;head&gt;标签内，可 ...`,l:"front-end/HTML/01-基本概念.html#charset字符集",a:"charset字符集"},"44.0":{t:"# 常见标签\r",p:"\r",l:"front-end/HTML/02-常见标签.html",a:"常见标签"},"44.1":{t:"html语法\r",p:`

常规标记、双标记
	单标记
		&lt;标记名 /&gt;
		&lt;标记名  &gt;
	双标记
	&lt;标记名& ...`,l:"front-end/HTML/02-常见标签.html#html语法",a:"html语法"},"44.2":{t:"常见标签\r",p:`


含义
语法书写和语法






文本标题
&lt;h1&gt;文章或者重点标题&lt;/h1&gt;    &lt; ...`,l:"front-end/HTML/02-常见标签.html#常见标签",a:"常见标签"},"44.3":{t:"常用标记嵌套规范\r",p:`

同类型标签相互嵌套


自动换行可以嵌套不换行的标签


自动换行
h1-h6、p


同行显示，不换行



i em ...`,l:"front-end/HTML/02-常见标签.html#常用标记嵌套规范",a:"常用标记嵌套规范"},"44.4":{t:"转义字符\r",p:`&amp;nbsp； 空格
&amp;copy； 版权信息
&amp;reg； 商标
&amp;gt；&amp;lt；大于小 ...`,l:"front-end/HTML/02-常见标签.html#转义字符",a:"转义字符"},"45.0":{t:"# 插入图片\r",p:"&lt;img src=&quot;图片路径&quot;  title=&quot;鼠标悬停上去之后的提示信息&quot;  ...",l:"front-end/HTML/03-插入图片.html",a:"插入图片"},"46.0":{t:"# 超链接\r",p:"&lt;a href=&quot;网址&quot; target=&quot;_blank或者_self&quot;&gt; ...",l:"front-end/HTML/04-超链接.html",a:"超链接"},"47.0":{t:"# 划分\r",p:`&lt;div&gt;&lt;/div&gt;
&lt;span&gt;&lt;/span&gt;

`,l:"front-end/HTML/05-划分.html",a:"划分"},"48.0":{t:"# 表格\r",p:`!image-20230413195852071



属性
作用




table
表格


tr
行


th
标题列 ...`,l:"front-end/HTML/06-表格.html",a:"表格"},"49.0":{t:"# 列表\r",p:`!image-20230413200419522
Type：

circle空心圆
Square 实心方块
Disc 实心圆 ...`,l:"front-end/HTML/07-列表.html",a:"列表"},"50.0":{t:"# 表单\r",p:"\r",l:"front-end/HTML/08-表单.html",a:"表单"},"50.1":{t:"表单示例\r",p:"&lt;form method=&quot;get或者post&quot; action=&quot;向何处发送表单数据&q ...",l:"front-end/HTML/08-表单.html#表单示例",a:"表单示例"},"50.2":{t:"表单域\r",p:`包含表单元素的区域
&lt;form action=&quot;url地址（接受并处理表单数据的服务器）&quot; met ...`,l:"front-end/HTML/08-表单.html#表单域",a:"表单域"},"50.3":{t:"表单元素\r",p:`

input
&lt;label for=&quot;sex&quot;&gt;男&lt;/label&gt;
&lt;i ...`,l:"front-end/HTML/08-表单.html#表单元素",a:"表单元素"},"50.4":{t:"新增表单\r",p:`


Fieldset
表单字段集，对表单内容分组和嵌套




Lengend
表单字段集标题


Label
提示信息( ...`,l:"front-end/HTML/08-表单.html#新增表单",a:"新增表单"},"51.0":{t:"# 序言\r",p:"\r",l:"front-end/JavaScript/01-JavaScript基础/01-序言.html",a:"序言"},"51.1":{t:"JavaScript发展历史\r",p:"1994年，网景公司(Netscape)发布了Navigator浏览器0.9版，这是世界上第一款比较成熟的网络浏览器，轰动一 ...",l:"front-end/JavaScript/01-JavaScript基础/01-序言.html#javascript发展历史",a:"javascript发展历史"},"51.2":{t:"JavaScript能干什么\r",p:`
常见的网页效果【表单验证、轮播图】
利用js配合canvas实现游戏【COCOS2D.JS】
实现桌面端应用【electr ...`,l:"front-end/JavaScript/01-JavaScript基础/01-序言.html#javascript能干什么",a:"javascript能干什么"},"52.0":{t:"# JavaScript实现\r",p:`完整的JavaScript实现包含以下几个部分：

核心【ecmascript】
文档对象模型【DOM】
浏览器对象模型【B ...`,l:"front-end/JavaScript/01-JavaScript基础/02-JavaScript实现.html",a:"javascript实现"},"52.1":{t:"ECMAScript\r",p:`ECMAScript
语法
类型
语句
关键字
保留字
操作符
全局对象
`,l:"front-end/JavaScript/01-JavaScript基础/02-JavaScript实现.html#ecmascript",a:"ecmascript"},"52.2":{t:"ECMAScript发展阶段\r",p:`

ES6
类、模块、迭代器、生成器、箭头函数、期约、反射、代理等


ES7
Array.prototype.includ ...`,l:"front-end/JavaScript/01-JavaScript基础/02-JavaScript实现.html#ecmascript发展阶段",a:"ecmascript发展阶段"},"52.3":{t:"DOM（文档对象模型）\r",p:`文档对象模型（DOM）：提供与网页内容交互的方法和接口。
文档对象模型（DOM，Document Object Model） ...`,l:"front-end/JavaScript/01-JavaScript基础/02-JavaScript实现.html#dom-文档对象模型",a:"dom-文档对象模型"},"52.4":{t:"BOM(浏览器对象模型)\r",p:`浏览器对象模型（BOM）：提供与浏览器交互的方法和接口。
浏览器对象模型(Browser Object Model)是指浏览 ...`,l:"front-end/JavaScript/01-JavaScript基础/02-JavaScript实现.html#bom-浏览器对象模型",a:"bom-浏览器对象模型"},"53.0":{t:"# JavaScript基础语法\r",p:"\r",l:"front-end/JavaScript/01-JavaScript基础/03-JavaScript基础语法.html",a:"javascript基础语法"},"53.1":{t:"书写格式\r",p:`
行内式JS

 &lt;!-- 1.行内式 --&gt;
    &lt;input type=&quot;button& ...`,l:"front-end/JavaScript/01-JavaScript基础/03-JavaScript基础语法.html#书写格式",a:"书写格式"},"53.2":{t:"注释\r",p:`

单行注释
&lt;!-- 单行注释 --&gt;
    



多行注释
&lt;!-- 多行注释 --&gt;
   ...`,l:"front-end/JavaScript/01-JavaScript基础/03-JavaScript基础语法.html#注释",a:"注释"},"53.3":{t:"输入输出语句\r",p:`


方法
说明
归属




alert（msg）
浏览器弹出警示框
浏览器


console.log（msg）
浏览器 ...`,l:"front-end/JavaScript/01-JavaScript基础/03-JavaScript基础语法.html#输入输出语句",a:"输入输出语句"},"54.0":{t:"# 变量\r",p:"\r",l:"front-end/JavaScript/01-JavaScript基础/04-变量.html",a:"变量"},"54.1":{t:"变量概述\r",p:"\r",l:"front-end/JavaScript/01-JavaScript基础/04-变量.html#变量概述",a:"变量概述"},"54.2":{t:"什么是变量\r",p:`变量是用于存放数据的容器。我们通过变量名获取数据，甚至数据可以修改
本质：变量是程序在内存中申请一块用来存放数据的空间
`,l:"front-end/JavaScript/01-JavaScript基础/04-变量.html#什么是变量",a:"什么是变量"},"54.3":{t:"变量的使用\r",p:`变量在使用时分为两步：1.声明变量 2.赋值


声明变量
//声明变量
var age; //声明一个名称为age的变量
 ...`,l:"front-end/JavaScript/01-JavaScript基础/04-变量.html#变量的使用",a:"变量的使用"},"54.4":{t:"变量的语法扩展\r",p:"\r",l:"front-end/JavaScript/01-JavaScript基础/04-变量.html#变量的语法扩展",a:"变量的语法扩展"},"54.5":{t:"更新变量\r",p:`一个变量被重新复赋值后，它原有的值就会被覆盖，变量值将以最后一次赋的值为准。
var age = 18;
age = 81; ...`,l:"front-end/JavaScript/01-JavaScript基础/04-变量.html#更新变量",a:"更新变量"},"54.6":{t:"同时声明多个变量\r",p:`同时声明多个变量时，只需要写一个 var， 多个变量名之间使用英文逗号隔开。
`,l:"front-end/JavaScript/01-JavaScript基础/04-变量.html#同时声明多个变量",a:"同时声明多个变量"},"54.7":{t:"声明变量的特殊情况\r",p:`


情况
说明
结果




var age ; console.log (age);
只声明 不赋值
undefined ...`,l:"front-end/JavaScript/01-JavaScript基础/04-变量.html#声明变量的特殊情况",a:"声明变量的特殊情况"},"54.8":{t:"变量命名规范\r",p:`由字母(A-Za-z)、数字(0-9)、下划线(_)、美元符号( $ )组成，如：usrAge, num01, _name
 ...`,l:"front-end/JavaScript/01-JavaScript基础/04-变量.html#变量命名规范",a:"变量命名规范"},"54.9":{t:"交换变量值\r",p:`

`,l:"front-end/JavaScript/01-JavaScript基础/04-变量.html#交换变量值",a:"交换变量值"},"55.0":{t:"# 数据类型\r",p:"\r",l:"front-end/JavaScript/01-JavaScript基础/05-数据类型.html",a:"数据类型"},"55.1":{t:"变量的数据类型\r",p:"变量是用来存储值的所在处，它们有名字和数据类型。变量的数据类型决定了如何将代表这些值的位存储到计算机的 内存中。JavaSc ...",l:"front-end/JavaScript/01-JavaScript基础/05-数据类型.html#变量的数据类型",a:"变量的数据类型"},"55.2":{t:"数据类型分类\r",p:"\r",l:"front-end/JavaScript/01-JavaScript基础/05-数据类型.html#数据类型分类",a:"数据类型分类"},"55.3":{t:"简单数据类型\r",p:`


简单数据类型
说明
默认值




number
数字型，包含整型值和浮点型值，如21、0.21
0


boolea ...`,l:"front-end/JavaScript/01-JavaScript基础/05-数据类型.html#简单数据类型",a:"简单数据类型"},"55.4":{t:"1.数字型number\r",p:`JavaScript 数字类型既可以用来保存整数值，也可以保存小数(浮点数）。
var age = 21； //整数
var ...`,l:"front-end/JavaScript/01-JavaScript基础/05-数据类型.html#_1-数字型number",a:"_1-数字型number"},"55.5":{t:"2.字符串型string\r",p:`字符串型可以是引号中的任意文本，其语法为双引号“”和单引号‘’
var strMsg = &quot;我爱北京天安门~&qu ...`,l:"front-end/JavaScript/01-JavaScript基础/05-数据类型.html#_2-字符串型string",a:"_2-字符串型string"},"55.6":{t:"3.布尔型boolean\r",p:`布尔类型有两个值：true 和 false ，其中 true 表示真（对），而 false 表示假（错）。
布尔型和数字型相 ...`,l:"front-end/JavaScript/01-JavaScript基础/05-数据类型.html#_3-布尔型boolean",a:"_3-布尔型boolean"},"55.7":{t:"4.undefined\r",p:`一个声明后没有被赋值的变量会有一个默认值 undefined ( 如果进行相连或者相加时，注意结果）
var variabl ...`,l:"front-end/JavaScript/01-JavaScript基础/05-数据类型.html#_4-undefined",a:"_4-undefined"},"55.8":{t:"5.null\r",p:`一个声明变量给 null 值，里面存的值为空（学习对象时，我们继续研究null)
var vari = null;
cons ...`,l:"front-end/JavaScript/01-JavaScript基础/05-数据类型.html#_5-null",a:"_5-null"},"55.9":{t:"获取变量的数据类型\r",p:"\r",l:"front-end/JavaScript/01-JavaScript基础/05-数据类型.html#获取变量的数据类型",a:"获取变量的数据类型"},"55.10":{t:"获取检测变量的数据类型\r",p:`typeof 可用来获取检测变量的数据类型
不同类型的返回值
!image-20220412121320181
`,l:"front-end/JavaScript/01-JavaScript基础/05-数据类型.html#获取检测变量的数据类型",a:"获取检测变量的数据类型"},"55.11":{t:"数据类型转换\r",p:"使用表单、prompt 获取过来的数据默认是字符串类型的，此时就不能直接简单的进行加法运算，而需要转换变量的数据类型。通俗来 ...",l:"front-end/JavaScript/01-JavaScript基础/05-数据类型.html#数据类型转换",a:"数据类型转换"},"55.12":{t:"标识符、关键字、保留字\r",p:`1、标识符
标识(zhi)符：就是指开发人员为变量、属性、函数、参数取的名字。
标识符不能是关键字或保留字
2、关键字
关键 ...`,l:"front-end/JavaScript/01-JavaScript基础/05-数据类型.html#标识符、关键字、保留字",a:"标识符、关键字、保留字"},"56.0":{t:"# 运算符\r",p:"\r",l:"front-end/JavaScript/01-JavaScript基础/06-运算符.html",a:"运算符"},"56.1":{t:"运算符\r",p:`运算符（operator）也被称为操作符，是用于实现赋值、比较和执行算数运算等功能的符号
`,l:"front-end/JavaScript/01-JavaScript基础/06-运算符.html#运算符",a:"运算符"},"56.2":{t:"算数运算符\r",p:`概念：算术运算使用的符号，用于执行两个变量或值的算术运算。



运算符
描述
实例




+
加
10 + 20 = 3 ...`,l:"front-end/JavaScript/01-JavaScript基础/06-运算符.html#算数运算符",a:"算数运算符"},"56.3":{t:"浮点数的精度问题\r",p:`浮点数值的最高精度是 17 位小数，但在进行算术计算时其精确度远远不如整数。
!image-2022041214510703 ...`,l:"front-end/JavaScript/01-JavaScript基础/06-运算符.html#浮点数的精度问题",a:"浮点数的精度问题"},"56.4":{t:"表达式和返回值\r",p:`表达式：：是由数字、运算符、变量等以能求得数值的有意义排列方法所得的组合
表达式最终都会有一个结果，返回给我们，我们成为返回 ...`,l:"front-end/JavaScript/01-JavaScript基础/06-运算符.html#表达式和返回值",a:"表达式和返回值"},"56.5":{t:"递增和递减运算符\r",p:`如果需要反复给数字变量添加或减去1，可以使用**递增（++）和递减（--）**运算符来完成。
在 JavaScript 中， ...`,l:"front-end/JavaScript/01-JavaScript基础/06-运算符.html#递增和递减运算符",a:"递增和递减运算符"},"56.6":{t:"前置递增运算符\r",p:`++num 前置递增，就是自加1，类似于 num = num + 1，但是 ++num 写起来更简单
使用口诀：先自加，后返 ...`,l:"front-end/JavaScript/01-JavaScript基础/06-运算符.html#前置递增运算符",a:"前置递增运算符"},"56.7":{t:"后置递增运算符\r",p:`num++ 后置递增，就是自加1，类似于 num = num + 1 ，但是 num++ 写起来更简单。
使用口诀：先返回原 ...`,l:"front-end/JavaScript/01-JavaScript基础/06-运算符.html#后置递增运算符",a:"后置递增运算符"},"56.8":{t:"比较运算符\r",p:"概念：比较运算符（关系运算符）是两个数据进行比较时所使用的运算符，比较运算后，会返回一个布尔值 （true / false） ...",l:"front-end/JavaScript/01-JavaScript基础/06-运算符.html#比较运算符",a:"比较运算符"},"56.9":{t:"逻辑运算符\r",p:`概念：逻辑运算符是用来进行布尔值运算的运算符，其返回值也是布尔值。后面开发中经常用于多个条件的判断



逻辑运算符
说明
 ...`,l:"front-end/JavaScript/01-JavaScript基础/06-运算符.html#逻辑运算符",a:"逻辑运算符"},"56.10":{t:"短路运算（逻辑中断）\r",p:`短路运算的原理：当有多个表达式（值）时,左边的表达式值可以确定结果时,就不再继续运算右边的表达式的值
1、逻辑与
语法： 表 ...`,l:"front-end/JavaScript/01-JavaScript基础/06-运算符.html#短路运算-逻辑中断",a:"短路运算-逻辑中断"},"56.11":{t:"赋值运算符\r",p:`概念：用来把数据赋值给变量的运算符。



赋值运算符
说明




=
直接赋值


+=、-=
加、减一个数后在赋值

 ...`,l:"front-end/JavaScript/01-JavaScript基础/06-运算符.html#赋值运算符",a:"赋值运算符"},"56.12":{t:"运算符优先级\r",p:`


优先级
运算符
顺序




1
小括号
（）


2
一元运算符
++ -- ！


3
算数运算符
先* / 后  ...`,l:"front-end/JavaScript/01-JavaScript基础/06-运算符.html#运算符优先级",a:"运算符优先级"},"57.0":{t:"# 流程控制\r",p:"\r",l:"front-end/JavaScript/01-JavaScript基础/07-流程控制.html",a:"流程控制"},"57.1":{t:"流程控制\r",p:"在一个程序执行的过程中，各条代码的执行顺序对程序的结果是有直接影响的。很多时候我们要通过控制代码 的执行顺序来实现我们要完成 ...",l:"front-end/JavaScript/01-JavaScript基础/07-流程控制.html#流程控制",a:"流程控制"},"57.2":{t:"顺序流程控制\r",p:"顺序结构是程序中最简单、最基本的流程控制，它没有特定的语法结构，程序会按照代码的先后顺序，依次执行， 程序中大多数的代码都是 ...",l:"front-end/JavaScript/01-JavaScript基础/07-流程控制.html#顺序流程控制",a:"顺序流程控制"},"57.3":{t:"分支流程控制if语句\r",p:`由上到下执行代码的过程中，根据不同的条件，执行不同的路径代码（执行代码多选一的过程），从而得到不同的结果
!image-20 ...`,l:"front-end/JavaScript/01-JavaScript基础/07-流程控制.html#分支流程控制if语句",a:"分支流程控制if语句"},"57.4":{t:"if语句\r",p:`1、语法结构
// 条件成立执行代码，否则什么也不做
if (条件表达式) {
 // 条件成立执行的代码语句
}

2、执 ...`,l:"front-end/JavaScript/01-JavaScript基础/07-流程控制.html#if语句",a:"if语句"},"57.5":{t:"if else语句（双分支语句）\r",p:`1、语法结构
// 条件成立 执行 if 里面代码，否则执行else 里面的代码
if (条件表达式) {
 // [如果] ...`,l:"front-end/JavaScript/01-JavaScript基础/07-流程控制.html#if-else语句-双分支语句",a:"if-else语句-双分支语句"},"57.6":{t:"if else if 语句(多分支语句)\r",p:`1、语法结构
// 适合于检查多重条件。
if (条件表达式1) {
 语句1；
} else if (条件表达式2) {
 ...`,l:"front-end/JavaScript/01-JavaScript基础/07-流程控制.html#if-else-if-语句-多分支语句",a:"if-else-if-语句-多分支语句"},"57.7":{t:"三元表达式\r",p:`三元表达式也能做一些简单的条件选择。 由三元运算符组成的式子称为三元表达式
1、语法结构
表达式1 ? 表达式2 : 表达式 ...`,l:"front-end/JavaScript/01-JavaScript基础/07-流程控制.html#三元表达式",a:"三元表达式"},"57.8":{t:"分支流程控制switch语句\r",p:`switch 语句也是多分支语句，它用于基于不同的条件来执行不同的代码。
当要针对变量设置一系列的特定值的选项时，就可以使用 ...`,l:"front-end/JavaScript/01-JavaScript基础/07-流程控制.html#分支流程控制switch语句",a:"分支流程控制switch语句"},"57.9":{t:"switch语句和if else if 语句的区别\r",p:`① 一般情况下，它们两个语句可以相互替换
② switch...case语句通常处理case为比较确定值的情况，而 if…e ...`,l:"front-end/JavaScript/01-JavaScript基础/07-流程控制.html#switch语句和if-else-if-语句的区别",a:"switch语句和if-else-if-语句的区别"},"58.0":{t:"# 循环\r",p:"\r",l:"front-end/JavaScript/01-JavaScript基础/08-循环.html",a:"循环"},"58.1":{t:"循环\r",p:"\r",l:"front-end/JavaScript/01-JavaScript基础/08-循环.html#循环",a:"循环"},"58.2":{t:"循环的目的\r",p:`在实际问题中，有许多具有规律性的重复操作，因此在程序中要完成这类操作就需要重复执行某些语句
`,l:"front-end/JavaScript/01-JavaScript基础/08-循环.html#循环的目的",a:"循环的目的"},"58.3":{t:"JS中的循环\r",p:`在JS中，主要有三种类型的循环语句：
for 循环
while 循环
do...while 循环
`,l:"front-end/JavaScript/01-JavaScript基础/08-循环.html#js中的循环",a:"js中的循环"},"58.4":{t:"for循环\r",p:`1、语法结构
for 循环主要用于把某些代码循环若干次，通常跟计数有关系。其语法结构如下：
for(初始化变量; 条件表达式 ...`,l:"front-end/JavaScript/01-JavaScript基础/08-循环.html#for循环",a:"for循环"},"58.5":{t:"断点调试\r",p:"断点调试是指自己在程序的某一行设置一个断点，调试时，程序运行到这一行就会停住，然后你可以一步一步往下调试，调试 过程中可以看 ...",l:"front-end/JavaScript/01-JavaScript基础/08-循环.html#断点调试",a:"断点调试"},"58.6":{t:"双重for循环\r",p:"循环嵌套是指在一个循环语句中再定义一个循环语句的语法结构，例如在for循环语句中，可以再嵌套一个 for 循环，这样的 fo ...",l:"front-end/JavaScript/01-JavaScript基础/08-循环.html#双重for循环",a:"双重for循环"},"58.7":{t:"while循环\r",p:"while 语句可以在条件表达式为真的前提下，循环执行指定的一段代码，直到表达式不为真时结束循环。 while语句的语法结构 ...",l:"front-end/JavaScript/01-JavaScript基础/08-循环.html#while循环",a:"while循环"},"58.8":{t:"do while 循环\r",p:"do... while 语句其实是 while 语句的一个变体。该循环会先执行一次代码块，然后对条件表达式进行判断，如果条件 ...",l:"front-end/JavaScript/01-JavaScript基础/08-循环.html#do-while-循环",a:"do-while-循环"},"58.9":{t:"continue break循环\r",p:"\r",l:"front-end/JavaScript/01-JavaScript基础/08-循环.html#continue-break循环",a:"continue-break循环"},"58.10":{t:"continue关键字\r",p:`continue 关键字用于立即跳出本次循环，继续下一次循环（本次循环体中 continue 之后的代码就会少执行一次）
/ ...`,l:"front-end/JavaScript/01-JavaScript基础/08-循环.html#continue关键字",a:"continue关键字"},"58.11":{t:"break关键字\r",p:`break 关键字用于立即跳出整个循环（循环结束）。
for (var i = 1; i &lt;=100; i++){
  ...`,l:"front-end/JavaScript/01-JavaScript基础/08-循环.html#break关键字",a:"break关键字"},"59.0":{t:"# JavaScript命名规范\r",p:"\r",l:"front-end/JavaScript/01-JavaScript基础/09-JavaScript规范.html",a:"javascript命名规范"},"59.1":{t:"标识符命名规范\r",p:`变量、函数的命名必须要有意义
变量的名称一般用名词
函数的名称一般用动词
`,l:"front-end/JavaScript/01-JavaScript基础/09-JavaScript规范.html#标识符命名规范",a:"标识符命名规范"},"59.2":{t:"操作符命名规范\r",p:`操作符左右两侧尽量保留一个空格
`,l:"front-end/JavaScript/01-JavaScript基础/09-JavaScript规范.html#操作符命名规范",a:"操作符命名规范"},"59.3":{t:"单行注释规范\r",p:`单行注释前面注意有一个空格
`,l:"front-end/JavaScript/01-JavaScript基础/09-JavaScript规范.html#单行注释规范",a:"单行注释规范"},"59.4":{t:"其他规范\r",p:`!image-20230415011826626
`,l:"front-end/JavaScript/01-JavaScript基础/09-JavaScript规范.html#其他规范",a:"其他规范"},"60.0":{t:"# 数组\r",p:"\r",l:"front-end/JavaScript/01-JavaScript基础/10-数组.html",a:"数组"},"60.1":{t:"数组的概念\r",p:"数组是指一组数据的集合，其中的每个数据被称作元素，在数组中可以存放任意类型的元素。数组是一种将一组数据存储在单个变量名下的优 ...",l:"front-end/JavaScript/01-JavaScript基础/10-数组.html#数组的概念",a:"数组的概念"},"60.2":{t:"创建数组\r",p:"\r",l:"front-end/JavaScript/01-JavaScript基础/10-数组.html#创建数组",a:"创建数组"},"60.3":{t:"数组的创建方式\r",p:`

利用new创建数组
var arr = new Array(); //创建空的数组



利用数组字面量创建数组
//1 ...`,l:"front-end/JavaScript/01-JavaScript基础/10-数组.html#数组的创建方式",a:"数组的创建方式"},"60.4":{t:"数组的元素类型\r",p:`数组元素可以是任何类型的值
`,l:"front-end/JavaScript/01-JavaScript基础/10-数组.html#数组的元素类型",a:"数组的元素类型"},"60.5":{t:"获取数组中的元素\r",p:"\r",l:"front-end/JavaScript/01-JavaScript基础/10-数组.html#获取数组中的元素",a:"获取数组中的元素"},"60.6":{t:"数组的索引\r",p:`索引(下标):用来访问数组元素的序号(数组下标从0开始)
数组可以通过索引来访问,设置,修改对应的数组元素,我们可以通过&q ...`,l:"front-end/JavaScript/01-JavaScript基础/10-数组.html#数组的索引",a:"数组的索引"},"60.7":{t:"遍历数组\r",p:`遍历:就是把数组中的每个元素从头到尾都访问一次
var arr2 = ['坦言','往前','趣味无穷'];
for (va ...`,l:"front-end/JavaScript/01-JavaScript基础/10-数组.html#遍历数组",a:"遍历数组"},"60.8":{t:"数组的长度\r",p:`数组名.length
`,l:"front-end/JavaScript/01-JavaScript基础/10-数组.html#数组的长度",a:"数组的长度"},"60.9":{t:"数组中新增元素\r",p:`1.修改length长度
可以通过修改length长度来实现数组扩容的目的
length属性是可读写的
2.索引号增加数组元 ...`,l:"front-end/JavaScript/01-JavaScript基础/10-数组.html#数组中新增元素",a:"数组中新增元素"},"60.10":{t:"冒泡排序\r",p:`// 升序
        var arr = [7, 2, 8, 41, 1, 6];
        for (var  ...`,l:"front-end/JavaScript/01-JavaScript基础/10-数组.html#冒泡排序",a:"冒泡排序"},"61.0":{t:"# 什么是数组\r",p:`参考文献：Array - JavaScript | MDN (mozilla.org)
`,l:"front-end/JavaScript/01-JavaScript基础/11-数组进阶.html",a:"什么是数组"},"61.1":{t:"Array(数组)\r",p:`JavaScript的 Array 对象是用于构造数组的全局对象，数组是类似于列表的高阶对象。
在JavaScript里面， ...`,l:"front-end/JavaScript/01-JavaScript基础/11-数组进阶.html#array-数组",a:"array-数组"},"61.2":{t:"描述Array(MDN解释)\r",p:`

数组是一种类列表对象,它的原型中提供了遍历和修改元素的相关操作


数组的元素类型和长度不固定,其长度可以随时改变


 ...`,l:"front-end/JavaScript/01-JavaScript基础/11-数组进阶.html#描述array-mdn解释",a:"描述array-mdn解释"},"61.3":{t:"创建一个数组,其中包含的内容\r",p:`通过最简单的方式创建一个新数组:
    

输出后如下:
!image-20220516020042821
数组除了包含本 ...`,l:"front-end/JavaScript/01-JavaScript基础/11-数组进阶.html#创建一个数组-其中包含的内容",a:"创建一个数组-其中包含的内容"},"61.4":{t:"数组的基本使用方式\r",p:`
数组字面量创建
构造函数创建数组
获取数组的长度

    

注意:数组的索引是从0开始,即元素的第一项索引为0
`,l:"front-end/JavaScript/01-JavaScript基础/11-数组进阶.html#数组的基本使用方式",a:"数组的基本使用方式"},"61.5":{t:"数组的判断\r",p:"\r",l:"front-end/JavaScript/01-JavaScript基础/11-数组进阶.html#数组的判断",a:"数组的判断"},"61.6":{t:"1.instanceof\r",p:`可以通过其原型链上是否存在Array原型对象来判断该对象类型
因为数组对象是由构造函数产生,在原型链的底层是一个Array的 ...`,l:"front-end/JavaScript/01-JavaScript基础/11-数组进阶.html#_1-instanceof",a:"_1-instanceof"},"61.7":{t:"2.isArray()[推荐]\r",p:`Array.isArray() 用于确定==传递的值==是否是一个 Array。
该方法不仅可以判断一个变量的类型,还可以判 ...`,l:"front-end/JavaScript/01-JavaScript基础/11-数组进阶.html#_2-isarray-推荐",a:"_2-isarray-推荐"},"62.0":{t:"# 函数\r",p:"\r",l:"front-end/JavaScript/02-JavaScript函数与作用域/01-函数.html",a:"函数"},"62.1":{t:"函数的概念\r",p:`函数：就是封装了一段可被重复调用执行的代码块。通过此代码块可以实现大量代码的重复使用。
`,l:"front-end/JavaScript/02-JavaScript函数与作用域/01-函数.html#函数的概念",a:"函数的概念"},"62.2":{t:"函数的使用\r",p:`函数在使用时分为两步：声明函数和调用函数。
`,l:"front-end/JavaScript/02-JavaScript函数与作用域/01-函数.html#函数的使用",a:"函数的使用"},"62.3":{t:"1.声明函数\r",p:`// 声明函数
function 函数名() {
 //函数体代码
}

function 是声明函数的关键字,必须小写
由 ...`,l:"front-end/JavaScript/02-JavaScript函数与作用域/01-函数.html#_1-声明函数",a:"_1-声明函数"},"62.4":{t:"2.调用函数\r",p:`        // 1-100的累加和
        
        // 1.声明函数
        functi ...`,l:"front-end/JavaScript/02-JavaScript函数与作用域/01-函数.html#_2-调用函数",a:"_2-调用函数"},"62.5":{t:"3.函数的封装\r",p:`函数的封装是把一个或者多个功能通过函数的方式封装起来，对外只提供一个简单的函数接口
`,l:"front-end/JavaScript/02-JavaScript函数与作用域/01-函数.html#_3-函数的封装",a:"_3-函数的封装"},"62.6":{t:"函数的参数\r",p:"\r",l:"front-end/JavaScript/02-JavaScript函数与作用域/01-函数.html#函数的参数",a:"函数的参数"},"62.7":{t:"1.形参和实参\r",p:"在声明函数时，可以在函数名称后面的小括号中添加一些参数，这些参数被称为形参，而在调用该函数时， 同样也需要传递相应的参数，这 ...",l:"front-end/JavaScript/02-JavaScript函数与作用域/01-函数.html#_1-形参和实参",a:"_1-形参和实参"},"62.8":{t:"2.函数参数的传递过程\r",p:`// 声明函数
function getSum(num1, num2) {
 console.log(num1 + num2 ...`,l:"front-end/JavaScript/02-JavaScript函数与作用域/01-函数.html#_2-函数参数的传递过程",a:"_2-函数参数的传递过程"},"62.9":{t:"3.函数形参和实参个数不匹配问题\r",p:`


参数个数
说明




实参个数等于形参个数
输出正确结果


实参个数多于形参个数
只取到形参的个数


实参个数小 ...`,l:"front-end/JavaScript/02-JavaScript函数与作用域/01-函数.html#_3-函数形参和实参个数不匹配问题",a:"_3-函数形参和实参个数不匹配问题"},"62.10":{t:"函数的返回值\r",p:"\r",l:"front-end/JavaScript/02-JavaScript函数与作用域/01-函数.html#函数的返回值",a:"函数的返回值"},"62.11":{t:"return语句\r",p:`// 声明函数
function sum（）{
 ...
 return 666；
}
// 调用函数
sum(); //  ...`,l:"front-end/JavaScript/02-JavaScript函数与作用域/01-函数.html#return语句",a:"return语句"},"62.12":{t:"break,continue,return的区别\r",p:`break:结束当前的循环体
continue:跳出本次循环,继续执行下次循环
return:不仅可以退出循环,还能够返回r ...`,l:"front-end/JavaScript/02-JavaScript函数与作用域/01-函数.html#break-continue-return的区别",a:"break-continue-return的区别"},"62.13":{t:"arguments的使用\r",p:"当我们不确定有多少个参数传递的时候，可以用 arguments 来获取。在 JavaScript 中，arguments 实 ...",l:"front-end/JavaScript/02-JavaScript函数与作用域/01-函数.html#arguments的使用",a:"arguments的使用"},"62.14":{t:"函数案例\r",p:`//利用函数求任意个数的最大值
function getMax() {
            var max = argu ...`,l:"front-end/JavaScript/02-JavaScript函数与作用域/01-函数.html#函数案例",a:"函数案例"},"62.15":{t:"函数的两种声明方式\r",p:`1.利用函数关键字自定义函数(命名函数)
function fn() {

}
fn();

2.函数表达式(匿名函数)
v ...`,l:"front-end/JavaScript/02-JavaScript函数与作用域/01-函数.html#函数的两种声明方式",a:"函数的两种声明方式"},"63.0":{t:"# 作用域\r",p:"\r",l:"front-end/JavaScript/02-JavaScript函数与作用域/02-作用域.html",a:"作用域"},"63.1":{t:"作用域\r",p:`通常来说,一段代码程序中所用到的名字并不总是有效和可用的,而限定这个名字的可用性的代码范围就是这个名字的作用域.
作用域的使 ...`,l:"front-end/JavaScript/02-JavaScript函数与作用域/02-作用域.html#作用域",a:"作用域"},"63.2":{t:"1.全局作用域\r",p:`整个script标签或者是一个单独的js文件
`,l:"front-end/JavaScript/02-JavaScript函数与作用域/02-作用域.html#_1-全局作用域",a:"_1-全局作用域"},"63.3":{t:"2.局部作用域(函数作用域)\r",p:`在函数内部就是局部作用域,这个代码的名字只在函数内部起效果和作用
`,l:"front-end/JavaScript/02-JavaScript函数与作用域/02-作用域.html#_2-局部作用域-函数作用域",a:"_2-局部作用域-函数作用域"},"63.4":{t:"变量的作用域\r",p:"\r",l:"front-end/JavaScript/02-JavaScript函数与作用域/02-作用域.html#变量的作用域",a:"变量的作用域"},"63.5":{t:"1.全局变量\r",p:`在全局作用域下的变量
如果在函数内部没有声明直接赋值的变量也属于全局变量
function fun() {
         ...`,l:"front-end/JavaScript/02-JavaScript函数与作用域/02-作用域.html#_1-全局变量",a:"_1-全局变量"},"63.6":{t:"2.局部变量\r",p:`在局部作用域下的变量 只能在函数内部使用
函数的形参也可以看作是局部变量
`,l:"front-end/JavaScript/02-JavaScript函数与作用域/02-作用域.html#_2-局部变量",a:"_2-局部变量"},"63.7":{t:"3.从执行效率来看全局变量和局部变量\r",p:`1.全局变量只有在浏览器关闭的时候才会销毁,比较占内存资源
2.局部变量,当我们程序执行完毕就会销毁,会比较节约内存资源
v ...`,l:"front-end/JavaScript/02-JavaScript函数与作用域/02-作用域.html#_3-从执行效率来看全局变量和局部变量",a:"_3-从执行效率来看全局变量和局部变量"},"63.8":{t:"4.js现阶段没有块级作用域(ES6新增)\r",p:`//块级作用域 外面不能调用
{}
if{}
for{}

`,l:"front-end/JavaScript/02-JavaScript函数与作用域/02-作用域.html#_4-js现阶段没有块级作用域-es6新增",a:"_4-js现阶段没有块级作用域-es6新增"},"63.9":{t:"作用域链\r",p:`只要有代码,就有一个作用域
写在函数内部叫做局部作用域
如果函数中还有函数,那么在这个作用域里面会新增一个作用域
根据内部函 ...`,l:"front-end/JavaScript/02-JavaScript函数与作用域/02-作用域.html#作用域链",a:"作用域链"},"64.0":{t:"# 预解析\r",p:"\r",l:"front-end/JavaScript/02-JavaScript函数与作用域/03-预解析.html",a:"预解析"},"64.1":{t:"预解析\r",p:"JavaScript代码是由浏览器中的JavaScript解释器来执行的.JavaScript解释器在运行JavaScrip ...",l:"front-end/JavaScript/02-JavaScript函数与作用域/03-预解析.html#预解析",a:"预解析"},"64.2":{t:"变量预解析(变量提升)和函数预解析(函数提升)\r",p:"\r",l:"front-end/JavaScript/02-JavaScript函数与作用域/03-预解析.html#变量预解析-变量提升-和函数预解析-函数提升",a:"变量预解析-变量提升-和函数预解析-函数提升"},"64.3":{t:"变量预解析(变量提升)\r",p:`把所有的变量声明提升到当前的作用域最前面 不提升赋值操作
`,l:"front-end/JavaScript/02-JavaScript函数与作用域/03-预解析.html#变量预解析-变量提升",a:"变量预解析-变量提升"},"64.4":{t:"函数预解析(函数提升)\r",p:`把所有函数声明提升到当前作用域的最前面 ==不调用函数==
##预解析案例
先变量提升,再依次罗列
//1
console. ...`,l:"front-end/JavaScript/02-JavaScript函数与作用域/03-预解析.html#函数预解析-函数提升",a:"函数预解析-函数提升"},"65.0":{t:"# 对象\r",p:"\r",l:"front-end/JavaScript/03-JavaScript对象与内置对象/01-对象.html",a:"对象"},"65.1":{t:"对象\r",p:`对象是一个具体的事物
在JavaScript中,对象是一组无序的相关属性和方法的集合,所有的事物都是对象,例如字符串,数值, ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/01-对象.html#对象",a:"对象"},"65.2":{t:"创建对象的三种方式\r",p:"\r",l:"front-end/JavaScript/03-JavaScript对象与内置对象/01-对象.html#创建对象的三种方式",a:"创建对象的三种方式"},"65.3":{t:"1.利用字面量创建对象\r",p:`对象字面量:就是花括号{}里面包含了表达这个具体事物(对象)的属性和方法
//利用字面量创建对象
        var o ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/01-对象.html#_1-利用字面量创建对象",a:"_1-利用字面量创建对象"},"65.4":{t:"变量和属性的异同\r",p:`一.对象调用
相同点:
1.都是用来存储数据
区别:



变量
属性




单独声明并赋值,使用的时候直接写变量名,单独 ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/01-对象.html#变量和属性的异同",a:"变量和属性的异同"},"65.5":{t:"2.利用new Object创建对象\r",p:`var obj = new Object(); //创建一个空对象
        obj.name = 'q';
     ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/01-对象.html#_2-利用new-object创建对象",a:"_2-利用new-object创建对象"},"65.6":{t:"3.利用构造函数创建对象\r",p:`因为我们前面两种创建对象的方式一次只能创建一个对象
构造函数:是一种特殊的函数，主要用来初始化对象，即为对象成员变量赋初始值 ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/01-对象.html#_3-利用构造函数创建对象",a:"_3-利用构造函数创建对象"},"65.7":{t:"new关键字\r",p:`
在内存中创建一个新的空对象
让 this 指向这个新的对象
执行构造函数里面的代码，给这个新对象添加属性和方法
返回这个新 ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/01-对象.html#new关键字",a:"new关键字"},"65.8":{t:"遍历对象属性\r",p:`for...in 语句用于对数组或者对象的属性进行循环操作。
for (变量 in 对象名字) {
 // 在此执行代码
} ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/01-对象.html#遍历对象属性",a:"遍历对象属性"},"65.9":{t:"练习\r",p:`/*
创建一个电脑对象
有颜色(color)、重量(weight)、品牌(brand)、型号(type)等属性，
有看电影( ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/01-对象.html#练习",a:"练习"},"66.0":{t:"# Math对象\r",p:`Math数学对象,不是一个构造函数,所以我们不需要new来调用,而是直接使用里面的属性和方法
返回给定的一组数字中的最大值。 ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/02-Math对象.html",a:"math对象"},"66.1":{t:"Math常用方法\r",p:`


方法
描述
示例




Math.PI
表示一个圆的周长与直径的比例
输出为3.141592653589793


 ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/02-Math对象.html#math常用方法",a:"math常用方法"},"66.2":{t:"Math.round()\r",p:`//取整方法
//向下取整
console.log(Math.floor(1.1)); //1
console.log(Ma ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/02-Math对象.html#math-round",a:"math-round"},"66.3":{t:"random()\r",p:`//random随机数 random返回一个随机小数,0=&lt; x &lt;1
        //Math.rando ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/02-Math对象.html#random",a:"random"},"67.0":{t:"# 日期对象\r",p:"\r",l:"front-end/JavaScript/03-JavaScript对象与内置对象/03-日期对象.html",a:"日期对象"},"67.1":{t:"Date()方法的使用\r",p:`日期对象是一个构造函数,必须使用new来调用创建我们的日期对象
new Date(); //如果没有参数 返回当前系统时间
 ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/03-日期对象.html#date-方法的使用",a:"date-方法的使用"},"67.2":{t:"日期格式化\r",p:`


方法名
说明
代码




getFullYear()
获取当年
dObj.getFullYear()


getMo ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/03-日期对象.html#日期格式化",a:"日期格式化"},"67.3":{t:"获取日期的总的毫秒形式\r",p:`Date 对象是基于1970年1月1日（世界标准时间）起的毫秒数
1970年1月1日为什么作为计算机元年的开始？ - 知乎  ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/03-日期对象.html#获取日期的总的毫秒形式",a:"获取日期的总的毫秒形式"},"67.4":{t:"获取毫秒数\r",p:`//获取毫秒数的三种方法
var date = new Date();
//1.valueOf()
console.log( ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/03-日期对象.html#获取毫秒数",a:"获取毫秒数"},"67.5":{t:"倒计时--案例\r",p:`转换公式如下：
 d = parseInt(总秒数/ 60/60 /24); // 计算天数
 h = parseInt ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/03-日期对象.html#倒计时-案例",a:"倒计时-案例"},"68.0":{t:"# 数组对象\r",p:"\r",l:"front-end/JavaScript/03-JavaScript对象与内置对象/04-数组对象.html",a:"数组对象"},"68.1":{t:"数组创建\r",p:`//字面量
var arr = [];
//new Array
var = new Array();


//注意
var  ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/04-数组对象.html#数组创建",a:"数组创建"},"68.2":{t:"数组判断\r",p:`1.原型的方式
arr instanceof Array
2.对象的方式H5新增 ie9以上才支持
Array.isArra ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/04-数组对象.html#数组判断",a:"数组判断"},"68.3":{t:"添加或者删除数组元素\r",p:`


方法名
说明
返回值




push(参数1...)
末尾添加一个或多个元素,注意修改原数组
并返回新的长度


p ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/04-数组对象.html#添加或者删除数组元素",a:"添加或者删除数组元素"},"68.4":{t:"数组排序\r",p:`


方法名
说明
是否修改原数组




reverse()
颠倒数组中元素的顺序,无参数
会改变原来的数组,返回新数组
 ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/04-数组对象.html#数组排序",a:"数组排序"},"68.5":{t:"数组索引\r",p:`


方法名
说明
返回值




indexOf()
数组中查找给定元素的第一个索引
如果存在返回索引号 如果不存在,则返 ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/04-数组对象.html#数组索引",a:"数组索引"},"68.6":{t:"数组转换为字符串\r",p:`


方法名
说明
返回值




toString()
把数组转换成字符串,逗号分隔每一项
返回一个字符串


join( ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/04-数组对象.html#数组转换为字符串",a:"数组转换为字符串"},"68.7":{t:"其他方法(截取字符串)\r",p:`


方法名
说明
返回值




concat()
链接两个数组 不影响原数组
返回一个新数组


slice()
数组截 ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/04-数组对象.html#其他方法-截取字符串",a:"其他方法-截取字符串"},"69.0":{t:"# 字符串对象\r",p:"\r",l:"front-end/JavaScript/03-JavaScript对象与内置对象/05-字符串对象.html",a:"字符串对象"},"69.1":{t:"简单数据类型为什么有length属性呢?\r",p:`var str = 'andy';
            console.log(str.length);//输出4

/ ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/05-字符串对象.html#简单数据类型为什么有length属性呢",a:"简单数据类型为什么有length属性呢"},"69.2":{t:"基本包装类型\r",p:`为了方便操作基本数据类型,JavaScript还提供了三个特殊的引用类型:String,Number,Boolean
基本包 ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/05-字符串对象.html#基本包装类型",a:"基本包装类型"},"69.3":{t:"字符串不可变\r",p:`指里面的值不可变,虽然看上去可以改变内容,但其实是地址变量,内存中新开辟了一个内存空间
//占用大量内存
var str = ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/05-字符串对象.html#字符串不可变",a:"字符串不可变"},"69.4":{t:"根据字符返回位置\r",p:`字符串所有的方法,都不会修改字符串本身(字符串是不可变的),操作完成会返回一个新的字符串



方法名
说明




ind ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/05-字符串对象.html#根据字符返回位置",a:"根据字符返回位置"},"69.5":{t:"根据位置返回字符(重点)\r",p:`


方法名
说明
使用




charAt(index)
返回指定位置的字符(index 字符串索引号)
str.cha ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/05-字符串对象.html#根据位置返回字符-重点",a:"根据位置返回字符-重点"},"69.6":{t:"字符串操作方法(重点)\r",p:`


方法名
说明




concat(str1,str2...)
concat()方法用于链接两个或多个字符串,拼接字符 ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/05-字符串对象.html#字符串操作方法-重点",a:"字符串操作方法-重点"},"69.7":{t:"替换字符串/转为数组\r",p:`replace('被替换字符','替换为的字符)
//1.替换字符 replace('被替换的字符','替换为的字符')
  ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/05-字符串对象.html#替换字符串-转为数组",a:"替换字符串-转为数组"},"69.8":{t:"字符转大写和小写\r",p:`var str3 = 'red,pink,ki';
console.log(str3.toUpperCase());//转换 ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/05-字符串对象.html#字符转大写和小写",a:"字符转大写和小写"},"69.9":{t:"作业\r",p:"        // 给定一个字符串，如：“abaasdffggghhjjkkgfddsssss3444343”，问题如下： ...",l:"front-end/JavaScript/03-JavaScript对象与内置对象/05-字符串对象.html#作业",a:"作业"},"70.0":{t:"# 简单类型与复杂类型\r",p:"\r",l:"front-end/JavaScript/03-JavaScript对象与内置对象/06-简单类型与复杂类型.html",a:"简单类型与复杂类型"},"70.1":{t:"简单类型与复杂类型\r",p:`简单类型又叫做基本数据类型或者值类型,复杂类型又叫做引用类型

值类型:简单数据类型/基本数据类型,在存储时变量中存储的是值 ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/06-简单类型与复杂类型.html#简单类型与复杂类型",a:"简单类型与复杂类型"},"70.2":{t:"堆和栈\r",p:`1.栈(操作系统):由操作自动分配释放存放函数的参数值,局部变量的值等.其操作方式类似于数据结构中的栈;
简单数据类型存放在 ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/06-简单类型与复杂类型.html#堆和栈",a:"堆和栈"},"70.3":{t:"简单类型的内存分配\r",p:`
值类型(简单数据类型):string,number,boolean,undefined,null
值类型变量的数据直接存放 ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/06-简单类型与复杂类型.html#简单类型的内存分配",a:"简单类型的内存分配"},"70.4":{t:"复杂类型的内存分配\r",p:`
引用类型(复杂数据类型):通过new关键字创建的对象(系统对象,自定义对象),如object,array,date等
引用 ...`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/06-简单类型与复杂类型.html#复杂类型的内存分配",a:"复杂类型的内存分配"},"70.5":{t:"简单类型传参\r",p:"函数的形参也可以看做是一个变量，当我们把一个值类型变量作为参数传给函数的形参时，其实是把变量在栈空间里的值复制了一份给形参， ...",l:"front-end/JavaScript/03-JavaScript对象与内置对象/06-简单类型与复杂类型.html#简单类型传参",a:"简单类型传参"},"70.6":{t:"复杂类型传参\r",p:"函数的形参也可以看做是一个变量，当我们把引用类型变量传给形参时，其实是把变量在栈空间里保存的堆地址复制给了形参，形参和实参其 ...",l:"front-end/JavaScript/03-JavaScript对象与内置对象/06-简单类型与复杂类型.html#复杂类型传参",a:"复杂类型传参"},"71.0":{t:"# 查阅文档\r",p:"\r",l:"front-end/JavaScript/03-JavaScript对象与内置对象/07-查阅文档.html",a:"查阅文档"},"71.1":{t:"MDN\r",p:"Mozilla 开发者网络（MDN）提供了有关开放网络技术（Open Web）的信息，包括 HTML、CSS 和万维网及 H ...",l:"front-end/JavaScript/03-JavaScript对象与内置对象/07-查阅文档.html#mdn",a:"mdn"},"71.2":{t:"如何学习对象中的方法\r",p:`
查阅该方法的功能
查看里面参数的意义和类型
查看返回值的意义和类型
通过demo进行测试

`,l:"front-end/JavaScript/03-JavaScript对象与内置对象/07-查阅文档.html#如何学习对象中的方法",a:"如何学习对象中的方法"},"72.0":{t:"# DOM简介\r",p:"\r",l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/01-DOM简介.html",a:"dom简介"},"72.1":{t:"什么是DOM\r",p:"文档对象模型（Document Object Model，简称 DOM），是 W3C 组织推荐的处理可扩展标记语言（HTML ...",l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/01-DOM简介.html#什么是dom",a:"什么是dom"},"72.2":{t:"DOM树\r",p:`!image-20220417210945485
文档:一个页面就是一个文档,DOM中使用document表示
元素:页面中 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/01-DOM简介.html#dom树",a:"dom树"},"73.0":{t:"# 获取元素\r",p:"\r",l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/02-获取元素.html",a:"获取元素"},"73.1":{t:"根据ID获取\r",p:`使用getElementById()可以获取带有ID的元素对象
&lt;div id=&quot;time&quot;&gt ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/02-获取元素.html#根据id获取",a:"根据id获取"},"73.2":{t:"根据标签名获取\r",p:`使用getElementsByTagName()方法可以返回带有指定标签名的对象的集合
    &lt;ul&gt;
    ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/02-获取元素.html#根据标签名获取",a:"根据标签名获取"},"73.3":{t:"通过H5新增方法获取\r",p:`①getElementsByClassName
根据类名返回元素对象集合
document.getElementsByCla ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/02-获取元素.html#通过h5新增方法获取",a:"通过h5新增方法获取"},"73.4":{t:"获取特殊元素\r",p:"\r",l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/02-获取元素.html#获取特殊元素",a:"获取特殊元素"},"73.5":{t:"获取body元素\r",p:`document.body;

`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/02-获取元素.html#获取body元素",a:"获取body元素"},"73.6":{t:"获取html元素\r",p:`document.documentElement;

`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/02-获取元素.html#获取html元素",a:"获取html元素"},"74.0":{t:"# 事件基础\r",p:"\r",l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/03-事件基础.html",a:"事件基础"},"74.1":{t:"事件概述\r",p:`JavaScript 使我们有能力创建动态页面，而事件是可以被 JavaScript 侦测到的行为。
简单理解： 触发--响 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/03-事件基础.html#事件概述",a:"事件概述"},"74.2":{t:"事件三要素\r",p:`1.事件源
2.事件类型
3.事件处理程序


`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/03-事件基础.html#事件三要素",a:"事件三要素"},"74.3":{t:"执行事件的步骤\r",p:`1.获取事件源
2.注册事件(绑定事件)
3.添加事件处理程序(采用函数赋值形式)
`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/03-事件基础.html#执行事件的步骤",a:"执行事件的步骤"},"74.4":{t:"常见的鼠标事件\r",p:`


鼠标事件
触发条件




onclick
鼠标点击左键触发


onmouseover
鼠标经过触发


onmou ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/03-事件基础.html#常见的鼠标事件",a:"常见的鼠标事件"},"75.0":{t:"# 操作元素\r",p:"JavaScript的DOM的操作可以改变网页内容,结构和样式,我们可以利用DOM操作元素来改变元素里面的内容,属性等.注意 ...",l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/04-操作元素.html",a:"操作元素"},"75.1":{t:"改变元素内容\r",p:`从起始位置到终止位置的内容,但它去除html标签,同时空格和换行也会被去掉
非标准
element.innerText

  ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/04-操作元素.html#改变元素内容",a:"改变元素内容"},"75.2":{t:"样式属性操作\r",p:`1.element.style 行内样式操作
2.element.className 类名样式操作
 //更改div颜色,大 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/04-操作元素.html#样式属性操作",a:"样式属性操作"},"75.3":{t:"总结\r",p:`!image-20220418221454770
`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/04-操作元素.html#总结",a:"总结"},"75.4":{t:"排他思想\r",p:`//多个按钮选中一个,给一个颜色,其他颜色复原


`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/04-操作元素.html#排他思想",a:"排他思想"},"75.5":{t:"自定义属性\r",p:"\r",l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/04-操作元素.html#自定义属性",a:"自定义属性"},"75.6":{t:"获取属性值\r",p:`获取内置属性值(元素本身自带的属性)
element.属性;

获取自定义属性
element.getAttribute(' ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/04-操作元素.html#获取属性值",a:"获取属性值"},"75.7":{t:"设置属性值\r",p:`设置内置属性值
element.属性 = '值';

主要设置自定义的属性
element.setAttribute('属性 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/04-操作元素.html#设置属性值",a:"设置属性值"},"75.8":{t:"移除属性\r",p:`element.removeAttribute('属性');

&lt;body&gt;
    &lt;div id=&q ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/04-操作元素.html#移除属性",a:"移除属性"},"75.9":{t:"H5自定义属性\r",p:`自定义属性的目的:
保存并保存数据,有些数据可以保存到页面中而不用保存到数据库中
有些自定义属性容易引起歧义,不容易判断到底 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/04-操作元素.html#h5自定义属性",a:"h5自定义属性"},"75.10":{t:"设置H5自定义属性\r",p:`H5规定自定义属性**data-**开头作为属性名并赋值
&lt;div data-index = &quot;1&quot ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/04-操作元素.html#设置h5自定义属性",a:"设置h5自定义属性"},"75.11":{t:"获取H5自定义属性\r",p:`
兼容性获取 element.getAttribute('data-index')
H5新增的：element.datase ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/04-操作元素.html#获取h5自定义属性",a:"获取h5自定义属性"},"76.0":{t:"# 节点操作\r",p:`获取元素通常使用两种方式:
1.利用dom提供的方法获取元素

document.getElementById()
docu ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/05-节点操作.html",a:"节点操作"},"76.1":{t:"节点概述\r",p:`网页中的所有内容都是节点（标签、属性、文本、注释等），在DOM 中，节点使用 node 来表示。
HTML DOM 树中的所 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/05-节点操作.html#节点概述",a:"节点概述"},"76.2":{t:"节点层级\r",p:`利用DOM树可以把节点划分为不同的层级关系,常见的是父子兄层级关系
`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/05-节点操作.html#节点层级",a:"节点层级"},"76.3":{t:"父级节点\r",p:`node.parentNode


parentNode属性可以返回某节点的父结点，注意是==最近的一个父结点==
如果指定 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/05-节点操作.html#父级节点",a:"父级节点"},"76.4":{t:"子节点\r",p:`parentNode.childNodes(标准)


parentNode.childNodes 返回包含指定节点的子节点 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/05-节点操作.html#子节点",a:"子节点"},"76.5":{t:"第一个子节点\r",p:`parentNode.firstChild


firstChild 返回第一个子节点，找不到则返回null
同样，也是包含 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/05-节点操作.html#第一个子节点",a:"第一个子节点"},"76.6":{t:"最后一个子节点\r",p:`parentNode.lastChild


lastChild 返回最后一个子节点，找不到则返回null
同样，也是包含所 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/05-节点操作.html#最后一个子节点",a:"最后一个子节点"},"76.7":{t:"第一个子节点(兼容性)\r",p:`parentNode.firstElementChild


firstElementChild 返回第一个子节点，找不到则 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/05-节点操作.html#第一个子节点-兼容性",a:"第一个子节点-兼容性"},"76.8":{t:"最后一个子节点(兼容性)\r",p:`parentNode.lastElementChild


lastElementChild 返回最后一个子节点，找不到则返 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/05-节点操作.html#最后一个子节点-兼容性",a:"最后一个子节点-兼容性"},"76.9":{t:"解决方案\r",p:"实际开发中，firstChild 和 lastChild 包含其他节点，操作不方便，而 firstElementChild  ...",l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/05-节点操作.html#解决方案",a:"解决方案"},"76.10":{t:"兄弟节点\r",p:"\r",l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/05-节点操作.html#兄弟节点",a:"兄弟节点"},"76.11":{t:"下一个兄弟节点\r",p:`node.nextSibling


nextSibling 返回当前元素的下一个兄弟元素节点，找不到则返回null
同样， ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/05-节点操作.html#下一个兄弟节点",a:"下一个兄弟节点"},"76.12":{t:"上一个兄弟节点\r",p:`node.previousSibling


previousSibling 返回当前元素上一个兄弟元素节点，找不到则返回n ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/05-节点操作.html#上一个兄弟节点",a:"上一个兄弟节点"},"76.13":{t:"下一个兄弟节点(兼容性)\r",p:`node.nextElementSibling


nextElementSibling 返回当前元素下一个兄弟元素节点，找 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/05-节点操作.html#下一个兄弟节点-兼容性",a:"下一个兄弟节点-兼容性"},"76.14":{t:"上一个兄弟节点(兼容性)\r",p:`node.previousElementSibling


previousElementSibling 返回当前元素上一个 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/05-节点操作.html#上一个兄弟节点-兼容性",a:"上一个兄弟节点-兼容性"},"76.15":{t:"创建节点\r",p:`document.createElement('tagName');


document.createElement()  ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/05-节点操作.html#创建节点",a:"创建节点"},"76.16":{t:"添加节点\r",p:`node.appendChild(child)


node.appendChild() 方法将一个节点添加到指定父节点的子 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/05-节点操作.html#添加节点",a:"添加节点"},"76.17":{t:"删除节点\r",p:`node.removeChild(child)


node.removeChild()方法从 DOM 中删除一个子节点，返 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/05-节点操作.html#删除节点",a:"删除节点"},"76.18":{t:"复制节点\r",p:`node.cloneNode()


node.cloneNode()方法返回调用该方法的节点的一个副本。 也称为克隆节点/ ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/05-节点操作.html#复制节点",a:"复制节点"},"76.19":{t:"三种创建元素的方式区别\r",p:`
doucument.write()
element.innerHTML
document.createElement()
 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/05-节点操作.html#三种创建元素的方式区别",a:"三种创建元素的方式区别"},"77.0":{t:"# DOM重点核心\r",p:"\r",l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/06-DOM重点核心.html",a:"dom重点核心"},"77.1":{t:"创建元素(带引号)\r",p:`
document.write
innerHTML
createElement

`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/06-DOM重点核心.html#创建元素-带引号",a:"创建元素-带引号"},"77.2":{t:"增(不带引号)\r",p:`
appendChild
insertBefore

`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/06-DOM重点核心.html#增-不带引号",a:"增-不带引号"},"77.3":{t:"删(不带引号)\r",p:`
removeChild()
remove()

`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/06-DOM重点核心.html#删-不带引号",a:"删-不带引号"},"77.4":{t:"改\r",p:`
主要修改dom的元素属性，dom元素的内容、属性、表单的值等


修改元素属性：src、href、title 等
修改普通 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/06-DOM重点核心.html#改",a:"改"},"77.5":{t:"查\r",p:`
主要获取查询dom的元素


DOM提供的API方法：getElementById、getElementsByTagNam ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/06-DOM重点核心.html#查",a:"查"},"77.6":{t:"属性操作\r",p:`
主要针对于自定义属性


setAttribute：设置dom的属性值
getAttribute：得到dom的属性值
re ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/06-DOM重点核心.html#属性操作",a:"属性操作"},"78.0":{t:"# 事件高级\r",p:"\r",l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html",a:"事件高级"},"78.1":{t:"目标\r",p:`
能够写出元素注册事件的两种方式
能够说出删除事件的两种方式
能够说出DOM事件流的三个阶段
能够利用事件对象完成跟随鼠标案 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html#目标",a:"目标"},"78.2":{t:"注册事件(绑定事件)\r",p:"\r",l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html#注册事件-绑定事件",a:"注册事件-绑定事件"},"78.3":{t:"注册事件概述\r",p:`给元素添加事件,称为注册事件或者绑定事件
注册事件有两种方式:传统方式和方法监听注册方式



传统注册方式
方法监听注册方 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html#注册事件概述",a:"注册事件概述"},"78.4":{t:"①addEventListener事件监听方式(最佳方案)\r",p:`
eventTarget.addEventListener()方法将指定的监听器注册到 eventTarget（目标对象）上 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html#_1addeventlistener事件监听方式-最佳方案",a:"_1addeventlistener事件监听方式-最佳方案"},"78.5":{t:"②attachEvent事件监听方式(兼容,了解,一般不用)\r",p:`
eventTarget.attachEvent()方法将指定的监听器注册到 eventTarget（目标对象） 上
当该对 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html#_2attachevent事件监听方式-兼容-了解-一般不用",a:"_2attachevent事件监听方式-兼容-了解-一般不用"},"78.6":{t:"③注册事件兼容性解决方案\r",p:`兼容性处理的原则：首先照顾大多数浏览器，再处理特殊浏览器
 function addEventListener(elemen ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html#_3注册事件兼容性解决方案",a:"_3注册事件兼容性解决方案"},"78.7":{t:"删除事件(解绑事件)\r",p:"\r",l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html#删除事件-解绑事件",a:"删除事件-解绑事件"},"78.8":{t:"removeEventListener删除事件方式\r",p:`eventTarget.removeEventListener(type,listener[,useCapture]);

 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html#removeeventlistener删除事件方式",a:"removeeventlistener删除事件方式"},"78.9":{t:"detachEvent删除事件方式(兼容,不考虑)\r",p:`eventTarget.detachEvent(eventNameWithOn,callback);

该方法接收两个参数： ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html#detachevent删除事件方式-兼容-不考虑",a:"detachevent删除事件方式-兼容-不考虑"},"78.10":{t:"传统事件删除方式\r",p:`eventTarget.onclick = null;

事件删除示例：
&lt;body&gt;
    &lt;div& ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html#传统事件删除方式",a:"传统事件删除方式"},"78.11":{t:"删除事件兼容性解决方案\r",p:` function removeEventListener(element, eventName, fn) {
       ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html#删除事件兼容性解决方案",a:"删除事件兼容性解决方案"},"78.12":{t:"DOM事件流\r",p:`
事件流描述的是从页面中接收事件的顺序
事件发生时会在元素节点之间按照特定的顺序传播，这个传播过程即DOM事件流

!ima ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html#dom事件流",a:"dom事件流"},"78.13":{t:"捕获阶段\r",p:`
document -&gt; html -&gt; body -&gt; father -&gt; son


JS 代码 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html#捕获阶段",a:"捕获阶段"},"78.14":{t:"冒泡阶段\r",p:`
son -&gt; father -&gt;body -&gt; html -&gt; document

&lt;bod ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html#冒泡阶段",a:"冒泡阶段"},"78.15":{t:"事件对象(重点)\r",p:"\r",l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html#事件对象-重点",a:"事件对象-重点"},"78.16":{t:"事件对象\r",p:`eventTarget.onclick = function(event) {
   // 这个 event 就是事件对象， ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html#事件对象",a:"事件对象"},"78.17":{t:"事件对象的兼容性方案\r",p:`事件对象本身的获取存在兼容问题：

标准浏览器中是浏览器给方法传递的参数，只需要定义形参 e 就可以获取到。
在 IE6~8 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html#事件对象的兼容性方案",a:"事件对象的兼容性方案"},"78.18":{t:"事件对象的常见属性和方法\r",p:`


事件对象属性方法
说明




e.target
返回触发事件的对象 标准


e.srcElement
返回触发事件 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html#事件对象的常见属性和方法",a:"事件对象的常见属性和方法"},"78.19":{t:"事件对象阻止默认行为\r",p:`&lt;body&gt;
    &lt;div&gt;123&lt;/div&gt;
    &lt;a href=&qu ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html#事件对象阻止默认行为",a:"事件对象阻止默认行为"},"78.20":{t:"阻止事件冒泡\r",p:`事件冒泡：开始时由最具体的元素接收，然后逐级向上传播到到 DOM 最顶层节点
事件冒泡本身的特性，会带来的坏处，也会带来的好 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html#阻止事件冒泡",a:"阻止事件冒泡"},"78.21":{t:"阻止事件冒泡的兼容性解决方案\r",p:`if(e &amp;&amp; e.stopPropagation){
      e.stopPropagation(); ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html#阻止事件冒泡的兼容性解决方案",a:"阻止事件冒泡的兼容性解决方案"},"78.22":{t:"事件委托(代理,委派)\r",p:`
事件委托也称为事件代理，在 jQuery 里面称为事件委派
事件委托的原理

不是每个子节点单独设置事件监听器，而是事件监 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html#事件委托-代理-委派",a:"事件委托-代理-委派"},"78.23":{t:"常用的鼠标事件\r",p:`


鼠标事件
触发条件




onclick
鼠标点击左键触发


onmouseover
鼠标经过触发


onmou ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html#常用的鼠标事件",a:"常用的鼠标事件"},"78.24":{t:"禁止鼠标右键与鼠标选中\r",p:`
contextmenu主要控制应该何时显示上下文菜单，主要用于程序员取消默认的上下文菜单
selectstart 禁止鼠标 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html#禁止鼠标右键与鼠标选中",a:"禁止鼠标右键与鼠标选中"},"78.25":{t:"鼠标事件对象\r",p:`
event对象代表事件的状态，跟事件相关的一系列信息的集合
现阶段我们主要是用鼠标事件对象 MouseEvent 和键盘事 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html#鼠标事件对象",a:"鼠标事件对象"},"78.26":{t:"常用的键盘事件\r",p:`


键盘事件
触发条件




onkeyup
某个键盘按键被松开时触发


onkeydown
某个键盘按键被按下时触发 ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html#常用的键盘事件",a:"常用的键盘事件"},"78.27":{t:"键盘对象属性\r",p:`


键盘事件对象 属性
说明




keyCode
返回该键值的ASCII值




onkeydown和 onkeyu ...`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html#键盘对象属性",a:"键盘对象属性"},"78.28":{t:"ASCII表\r",p:`!image-20220419231745024
`,l:"front-end/JavaScript/04-JavaScript进阶之DOM技术/07-事件高级.html#ascii表",a:"ascii表"},"79.0":{t:"# BOM\r",p:`\r
\r
\r`,l:"front-end/JavaScript/05-JavaScript进阶之BOM技术/01-BOM.html",a:"bom"},"79.1":{t:"BOM概述\r",p:`BOM = Browser Object Model 👉浏览器对象模型
它提供了独立于内容而与浏览器窗口进行交互的对象，其 ...`,l:"front-end/JavaScript/05-JavaScript进阶之BOM技术/01-BOM.html#bom概述",a:"bom概述"},"79.2":{t:"BOM构成\r",p:`!image-20230415022303647


BOM 比 DOM 更大。它包含 DOM。


window 对象是浏 ...`,l:"front-end/JavaScript/05-JavaScript进阶之BOM技术/01-BOM.html#bom构成",a:"bom构成"},"80.0":{t:"# window 对象的常见事件\r",p:"\r",l:"front-end/JavaScript/05-JavaScript进阶之BOM技术/02-window对象的常见事件.html",a:"window-对象的常见事件"},"80.1":{t:"窗口加载事件\r",p:"window.onload是窗口（页面）加载事件，当文档内容完全加载完成会触发该事件（包括图像，脚本文件，CSS文件等），就 ...",l:"front-end/JavaScript/05-JavaScript进阶之BOM技术/02-window对象的常见事件.html#窗口加载事件",a:"窗口加载事件"},"80.2":{t:"区别\r",p:`
load等页面内容全部加载完毕，包括页面dom元素，图片，flash，css等
DOMContentLoaded 是DOM ...`,l:"front-end/JavaScript/05-JavaScript进阶之BOM技术/02-window对象的常见事件.html#区别",a:"区别"},"80.3":{t:"调整窗口大小事件\r",p:`window.onresize 是调整窗口大小加载事件，当触发时就调用的处理函数
window.onresize = fun ...`,l:"front-end/JavaScript/05-JavaScript进阶之BOM技术/02-window对象的常见事件.html#调整窗口大小事件",a:"调整窗口大小事件"},"80.4":{t:"定时器\r",p:`window 对象给我们提供了两个定时器

setTimeout()
setInterval()

`,l:"front-end/JavaScript/05-JavaScript进阶之BOM技术/02-window对象的常见事件.html#定时器",a:"定时器"},"80.5":{t:"setTimeout()定时器\r",p:`setTimeout()方法用于设置一个定时器，该定时器在定时器到期后执行调用函数。
window.setTimeout(调 ...`,l:"front-end/JavaScript/05-JavaScript进阶之BOM技术/02-window对象的常见事件.html#settimeout-定时器",a:"settimeout-定时器"},"80.6":{t:"clearTimeout()停止定时器\r",p:`
clearTimeout()方法取消了先前通过调用 setTimeout()建立的定时器

window.clearTim ...`,l:"front-end/JavaScript/05-JavaScript进阶之BOM技术/02-window对象的常见事件.html#cleartimeout-停止定时器",a:"cleartimeout-停止定时器"},"80.7":{t:"setInterval()定时器\r",p:`
setInterval()方法重复调用一个函数，每隔这个时间，就去调用一次回调函数

window.setInterval ...`,l:"front-end/JavaScript/05-JavaScript进阶之BOM技术/02-window对象的常见事件.html#setinterval-定时器",a:"setinterval-定时器"},"80.8":{t:"this指向\r",p:`

this的指向在函数定义的时候是确定不了的，只有函数执行的时候才能确定this到底指向谁现阶段，我们先了解一下几个thi ...`,l:"front-end/JavaScript/05-JavaScript进阶之BOM技术/02-window对象的常见事件.html#this指向",a:"this指向"},"81.0":{t:"# JS执行机制\r",p:"\r",l:"front-end/JavaScript/05-JavaScript进阶之BOM技术/03-JS执行机制.html",a:"js执行机制"},"81.1":{t:"JS是单线程\r",p:`
JavaScript 语言的一大特点就是==单线程==，也就是说，==同一个时间只能做一件事==。这是因为 Javascr ...`,l:"front-end/JavaScript/05-JavaScript进阶之BOM技术/03-JS执行机制.html#js是单线程",a:"js是单线程"},"81.2":{t:"一个问题\r",p:`以下代码执行的结果是什么？
console.log(1);
setTimeout(function() {
    cons ...`,l:"front-end/JavaScript/05-JavaScript进阶之BOM技术/03-JS执行机制.html#一个问题",a:"一个问题"},"81.3":{t:"同步和异步\r",p:`
为了解决这个问题，利用多核 CPU 的计算能力，HTML5 提出 Web Worker 标准，允许 JavaScript  ...`,l:"front-end/JavaScript/05-JavaScript进阶之BOM技术/03-JS执行机制.html#同步和异步",a:"同步和异步"},"81.4":{t:"同步任务\r",p:`
同步任务都在主线程上执行，形成一个执行栈

`,l:"front-end/JavaScript/05-JavaScript进阶之BOM技术/03-JS执行机制.html#同步任务",a:"同步任务"},"81.5":{t:"异步任务\r",p:`

JS中的异步是通过回调函数实现的


异步任务有以下三种类型

普通事件，如click,resize等
资源加载，如lo ...`,l:"front-end/JavaScript/05-JavaScript进阶之BOM技术/03-JS执行机制.html#异步任务",a:"异步任务"},"82.0":{t:"# location对象\r",p:"window 对象给我们提供了一个 location属性用于获取或者设置窗体的url，并且可以解析url。因为这个属性返回的 ...",l:"front-end/JavaScript/05-JavaScript进阶之BOM技术/04-location对象.html",a:"location对象"},"82.1":{t:"url\r",p:"统一资源定位符（uniform resouce locator是互联网上标准资源的地址。互联网上的每个文件都有一个唯一的 U ...",l:"front-end/JavaScript/05-JavaScript进阶之BOM技术/04-location对象.html#url",a:"url"},"82.2":{t:"location对象属性\r",p:`


location对象属性
返回值




location.href
获取或者设置整个URL


location.h ...`,l:"front-end/JavaScript/05-JavaScript进阶之BOM技术/04-location对象.html#location对象属性",a:"location对象属性"},"82.3":{t:"location对象方法\r",p:`


location对象方法
返回值




location.assign()
跟href一样，可以跳转页面（也称为重定 ...`,l:"front-end/JavaScript/05-JavaScript进阶之BOM技术/04-location对象.html#location对象方法",a:"location对象方法"},"83.0":{t:"# navigator对象\r",p:`
navigator 对象包含有关浏览器的信息，它有很多属性
我们常用的是userAgent,该属性可以返回由客户机发送服务 ...`,l:"front-end/JavaScript/05-JavaScript进阶之BOM技术/05-navigator对象.html",a:"navigator对象"},"84.0":{t:"# history对象\r",p:`
window 对象给我们提供了一个 history 对象，与浏览器历史记录进行交互
该对象包含用户（在浏览器窗口中）访问过 ...`,l:"front-end/JavaScript/05-JavaScript进阶之BOM技术/06-history对象.html",a:"history对象"},"85.0":{t:"# 面向对象编程介绍\r",p:"\r",l:"front-end/JavaScript/06-JavaScript高级之面向对象/01-面向对象编程介绍.html",a:"面向对象编程介绍"},"85.1":{t:"面向过程编程POP(Process-oriented programming)\r",p:`面向过程就是分析出解决问题所需要的步骤，然后用函数把这些步骤一步一步实现，使用的时候一个一个的依次调用就可以了
`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/01-面向对象编程介绍.html#面向过程编程pop-process-oriented-programming",a:"面向过程编程pop-process-oriented-programming"},"85.2":{t:"面向对象编程OOP(Object Oriented Programming)\r",p:`面向对象是把事物分解成为一个个对象,然后由对象之间分工和合作
面向对象的特性

封装性

把普通的对象进行封装，对象的属性设 ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/01-面向对象编程介绍.html#面向对象编程oop-object-oriented-programming",a:"面向对象编程oop-object-oriented-programming"},"85.3":{t:"对象\r",p:`对象是一个具体的事物
在JavaScript种,对象是一组无序的相关属性和方法的集合,所有事物都是对象
对象由属性和方法组成 ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/01-面向对象编程介绍.html#对象",a:"对象"},"85.4":{t:"类 Class\r",p:`在es6中新增加了类的概念,可以使用class关键字声明一个类,之后以这个类来实例化对象
类抽象了对象的公共部分,它泛指某一 ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/01-面向对象编程介绍.html#类-class",a:"类-class"},"85.5":{t:"创建类\r",p:`
class name {
//class body
}

//创建类
class Star {

}
//创建类的对象
n ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/01-面向对象编程介绍.html#创建类",a:"创建类"},"85.6":{t:"添加方法\r",p:`        //创建类
        class Star {
            constructor(una ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/01-面向对象编程介绍.html#添加方法",a:"添加方法"},"85.7":{t:"类的继承\r",p:"\r",l:"front-end/JavaScript/06-JavaScript高级之面向对象/01-面向对象编程介绍.html#类的继承",a:"类的继承"},"85.8":{t:"继承\r",p:`子类可以继承父类的方法
        class Father {
            constructor() { ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/01-面向对象编程介绍.html#继承",a:"继承"},"85.9":{t:"super关键字\r",p:`用于访问和调用对象父类上的函数.可以调用父类的构造函数,也可以调用父类的普通函数
            class Fat ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/01-面向对象编程介绍.html#super关键字",a:"super关键字"},"85.10":{t:"子类和父类方法的继承\r",p:`            class Father {
                say() {
            ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/01-面向对象编程介绍.html#子类和父类方法的继承",a:"子类和父类方法的继承"},"85.11":{t:"同时调用子类和父类方法\r",p:`参数一定要给super(a,b)
super要放在this前面
        class Father {
        ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/01-面向对象编程介绍.html#同时调用子类和父类方法",a:"同时调用子类和父类方法"},"85.12":{t:"注意点\r",p:`
实例化写在创建类的下面,不然会报错
方法里面传参,如果不声明形参,需要用this

        class Fathe ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/01-面向对象编程介绍.html#注意点",a:"注意点"},"86.0":{t:"# 构造函数和原型\r",p:"\r",l:"front-end/JavaScript/06-JavaScript高级之面向对象/02-构造函数和原型.html",a:"构造函数和原型"},"86.1":{t:"概述\r",p:`在典型的OOP的语言中，都存在类的概念，类就是对象的模板，对象就是类的实例。
ES6，全称ECMAScript，2015.0 ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/02-构造函数和原型.html#概述",a:"概述"},"86.2":{t:"静态成员和实例成员\r",p:"\r",l:"front-end/JavaScript/06-JavaScript高级之面向对象/02-构造函数和原型.html#静态成员和实例成员",a:"静态成员和实例成员"},"86.3":{t:"实例成员\r",p:`就是通过构造函数内部通过this添加的成员
只能通过实例化的对象来访问，不能通过构造函数来访问实例成员，比如对象的属性值
`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/02-构造函数和原型.html#实例成员",a:"实例成员"},"86.4":{t:"静态成员\r",p:`静态成员只能通过构造函数来访问，比如对象的属性或者在对象上面直接赋值
`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/02-构造函数和原型.html#静态成员",a:"静态成员"},"86.5":{t:"构造函数\r",p:"\r",l:"front-end/JavaScript/06-JavaScript高级之面向对象/02-构造函数和原型.html#构造函数",a:"构造函数"},"86.6":{t:"构造函数的特点\r",p:`
构造函数有原型对象prototype
构造函数原型对象prototype里面有constructor指向构造函数本身
构造 ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/02-构造函数和原型.html#构造函数的特点",a:"构造函数的特点"},"86.7":{t:"构造函数的问题\r",p:`存在浪费内存的问题
使用构造函数进行存储对象的时候，每创建一个新对象，就会开辟一个内存空间存放同一个方法/函数
!image ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/02-构造函数和原型.html#构造函数的问题",a:"构造函数的问题"},"86.8":{t:"构造函数原型prototype\r",p:`构造函数通过原型分配的函数是所有对象所共享的
JavaScript规定，每一个构造函数都有一个prototype属性，指向另 ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/02-构造函数和原型.html#构造函数原型prototype",a:"构造函数原型prototype"},"86.9":{t:"原型对象\\_\\_proto\\_\\_\r",p:"**对象都会有一个属性__proto__**指向构造函数的prototype原型对象，之所以我们对象可以使用构造函数prot ...",l:"front-end/JavaScript/06-JavaScript高级之面向对象/02-构造函数和原型.html#原型对象-proto",a:"原型对象-proto"},"86.10":{t:"constrctor构造函数\r",p:"对象原型__proto__和构造函数(prototype)原型对象里面都有一个属性constructor属性,constru ...",l:"front-end/JavaScript/06-JavaScript高级之面向对象/02-构造函数和原型.html#constrctor构造函数",a:"constrctor构造函数"},"86.11":{t:"构造函数，实例，原型对象三者之间的关系\r",p:`!image-20220428162056152
`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/02-构造函数和原型.html#构造函数-实例-原型对象三者之间的关系",a:"构造函数-实例-原型对象三者之间的关系"},"86.12":{t:"原型链\r",p:`只要是对象就有__proto__原型，指向原型对象。
Starprototype对象里面的__proto__指向Object ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/02-构造函数和原型.html#原型链",a:"原型链"},"86.13":{t:"JavaScript的成员查找机制(规则)\r",p:`
当访问一个对象的属性(包括方法)时,首先查找这个对象自身有没有属性
如果没有就查找它的原型(也就是__proto__)指向 ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/02-构造函数和原型.html#javascript的成员查找机制-规则",a:"javascript的成员查找机制-规则"},"86.14":{t:"原型对象中this指向\r",p:`
在构造函数中,里面this指向的是对象实例
在原型对象函数里面的this指向对象实例
需要调用才可以确定,一般指向函数的调 ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/02-构造函数和原型.html#原型对象中this指向",a:"原型对象中this指向"},"86.15":{t:"扩展内置对象\r",p:`可以通过原型对象,对原来的内置对象进行扩展自定义方法.比如给数组增加自定义求偶数和的功能
    


//不能这么用,会覆 ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/02-构造函数和原型.html#扩展内置对象",a:"扩展内置对象"},"87.0":{t:"# 继承\r",p:`ES6之前没有给我们提供extends继承,我们可以通过构造函数+原型对象模拟实现继承,被称为组合继承
`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/03-继承.html",a:"继承"},"87.1":{t:"call()\r",p:`调用这个函数,并且修改函数运行时的this指向

fn.call(thisArg,arg1,arg2,...)

thisA ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/03-继承.html#call",a:"call"},"87.2":{t:"借用构造函数继承父类型属性\r",p:`核心原理:通过call()把父类型的this指向子类型的this,这样就可以实现子类型继承父类型的属性
        // ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/03-继承.html#借用构造函数继承父类型属性",a:"借用构造函数继承父类型属性"},"87.3":{t:"借用原型对象继承方法\r",p:`        //父构造函数
        function Father(uname,age) {
          ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/03-继承.html#借用原型对象继承方法",a:"借用原型对象继承方法"},"87.4":{t:"类的本质\r",p:`ES6通过类实现面向对象编程

类的本质其实还是一个函数,我们可以简单的认为类就是构造函数的另一种写法

类的特点:

类有 ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/03-继承.html#类的本质",a:"类的本质"},"87.5":{t:"语法糖\r",p:`语法糖是一种便捷的写法.简单理解,有两种方法可以实现同样的功能,但是一种写法更加清晰,方便,那么这个方法就是语法糖。
`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/03-继承.html#语法糖",a:"语法糖"},"88.0":{t:"# ES5新增方法\r",p:"\r",l:"front-end/JavaScript/06-JavaScript高级之面向对象/04-ES5新增方法.html",a:"es5新增方法"},"88.1":{t:"数组方法\r",p:`迭代(遍历)方法:forEach(),map(),filter(),some(),every()

forEach()


 ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/04-ES5新增方法.html#数组方法",a:"数组方法"},"88.2":{t:"字符串方法\r",p:`trim()方法会从一个字符串的两端删除空白字符

str.trim()

trim()方法并不影响原字符串本身,它返回的是 ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/04-ES5新增方法.html#字符串方法",a:"字符串方法"},"88.3":{t:"对象方法\r",p:`Object.defineProperty()定义对象中新属性或修改原有的属性

Object.defineProperty ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/04-ES5新增方法.html#对象方法",a:"对象方法"},"89.0":{t:"# 函数进阶\r",p:"\r",l:"front-end/JavaScript/06-JavaScript高级之面向对象/05-函数进阶.html",a:"函数进阶"},"89.1":{t:"函数的定义方式\r",p:`
函数声明方式 function 关键字(命名函数)
函数表达式(匿名函数)
new Function()

var fn  ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/05-函数进阶.html#函数的定义方式",a:"函数的定义方式"},"89.2":{t:"函数的调用方式\r",p:`
普通函数
对象的方法
构造函数
绑定事件函数
定时器函数
立即执行函数

&lt;body&gt;
    
&lt;/b ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/05-函数进阶.html#函数的调用方式",a:"函数的调用方式"},"89.3":{t:"函数内this指向\r",p:`
this指向，是当我们调用函数的时候确定的，调用方式的不同决定了this的指向不同，一般我们指向我们的调用者




调用 ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/05-函数进阶.html#函数内this指向",a:"函数内this指向"},"89.4":{t:"改变函数内部this指向\r",p:"JavaScript为我们专门提供了一些函数方法来帮我们更优雅的处理函数内部this的指向问题，常用的有bind(),cal ...",l:"front-end/JavaScript/06-JavaScript高级之面向对象/05-函数进阶.html#改变函数内部this指向",a:"改变函数内部this指向"},"89.5":{t:"call()方法\r",p:`
call()方法调用一个对象，简单理解为调用函数的方式，但是它可以改变函数的this指向
fun.call(thisArg ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/05-函数进阶.html#call-方法",a:"call-方法"},"89.6":{t:"apply()方法\r",p:`
apply()方法调用一个函数，简单理解为调用函数的方式，但是它可以改变函数的 this指向
fun.apply(this ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/05-函数进阶.html#apply-方法",a:"apply-方法"},"89.7":{t:"bind()方法(重点)\r",p:`bind()方法不会调用函数.但是能改变函数内部this指向

fn.bind(thisArg,arg1,arg2,...) ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/05-函数进阶.html#bind-方法-重点",a:"bind-方法-重点"},"89.8":{t:"call,apply,bind总结\r",p:`相同点:
都可以改变函数内部的this指向
区别点:

call和apply会调用函数,并且改变函数内部this指向
cal ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/05-函数进阶.html#call-apply-bind总结",a:"call-apply-bind总结"},"90.0":{t:"# 严格模式\r",p:"\r",l:"front-end/JavaScript/06-JavaScript高级之面向对象/06-严格模式.html",a:"严格模式"},"90.1":{t:"什么是严格模式\r",p:"JavaScript除了提供正常模式外，还提供了==严格模式(strict mode)==.ES5的严格模式是采用具有限制性 ...",l:"front-end/JavaScript/06-JavaScript高级之面向对象/06-严格模式.html#什么是严格模式",a:"什么是严格模式"},"90.2":{t:"开启严格模式\r",p:`严格模式可以应用到整个脚本或个别函数中.因此在使用时,我们可以将严格模式分为为脚本开启严格模式和为函数开启严格模式两种情况
`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/06-严格模式.html#开启严格模式",a:"开启严格模式"},"90.3":{t:"1.为脚本开启严格模式\r",p:"为整个脚本文件开启严格模式,需要在所有语句之前放一个特定的语句&quot;use strict&quot;;(或'use s ...",l:"front-end/JavaScript/06-JavaScript高级之面向对象/06-严格模式.html#_1-为脚本开启严格模式",a:"_1-为脚本开启严格模式"},"90.4":{t:"2.为函数开启严格模式\r",p:`    &lt;/script&gt;
    &lt;!-- 为某个函数开启严格模式 --&gt;
    

`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/06-严格模式.html#_2-为函数开启严格模式",a:"_2-为函数开启严格模式"},"90.5":{t:"严格模式中的变化\r",p:"\r",l:"front-end/JavaScript/06-JavaScript高级之面向对象/06-严格模式.html#严格模式中的变化",a:"严格模式中的变化"},"90.6":{t:"变量的规定\r",p:`
在正常模式下,如果一个变量没有声明就赋值,默认是全局变量.
严格模式禁止这种用法,变量都必须先用var命令声明,然后再使用 ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/06-严格模式.html#变量的规定",a:"变量的规定"},"90.7":{t:"严格模式下this指向问题\r",p:`
以前在全局作用域函数中的this指向window对象
严格模式下全局作用域中函数中的this是undefined
以前构造 ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/06-严格模式.html#严格模式下this指向问题",a:"严格模式下this指向问题"},"90.8":{t:"函数变化\r",p:`
函数不能有重名的参数
函数必须声明在顶层.新版本的JavaScript会引入&quot;块级作用域&quot;(ES6中已 ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/06-严格模式.html#函数变化",a:"函数变化"},"90.9":{t:"高阶函数\r",p:`高阶函数是对其他函数进行操作的函数,它接受函数作为参数或者将函数作为返回值输出
!image-202304150253339 ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/06-严格模式.html#高阶函数",a:"高阶函数"},"91.0":{t:"# 闭包\r",p:"\r",l:"front-end/JavaScript/06-JavaScript高级之面向对象/07-闭包.html",a:"闭包"},"91.1":{t:"变量作用域\r",p:`变量根据作用域的不同分为两种：全局变量和局部变量

函数内部可以使用全局变量
函数外部不可以使用局部变量
当函数执行完毕，本 ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/07-闭包.html#变量作用域",a:"变量作用域"},"91.2":{t:"什么是闭包\r",p:`闭包(closure) 指有权访问另一个函数作用域中变量的函数.——《JavaScript高级程序设计》
简单理解：一个作用 ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/07-闭包.html#什么是闭包",a:"什么是闭包"},"91.3":{t:"在chrome中调式闭包\r",p:`

打开浏览器，按 F12 键启动 chrome 调试工具。


设置断点。


找到 Scope 选项（Scope 作用域 ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/07-闭包.html#在chrome中调式闭包",a:"在chrome中调式闭包"},"91.4":{t:"闭包的作用\r",p:`延伸变量的作用范围
&lt;body&gt;
    
&lt;/body&gt;

`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/07-闭包.html#闭包的作用",a:"闭包的作用"},"91.5":{t:"点击li输出索引号\r",p:`&lt;body&gt;
    &lt;ul class=&quot;nav&quot;&gt;
        &lt; ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/07-闭包.html#点击li输出索引号",a:"点击li输出索引号"},"91.6":{t:"定时器中的闭包\r",p:`&lt;body&gt;
    &lt;ul class=&quot;nav&quot;&gt;
        &lt; ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/07-闭包.html#定时器中的闭包",a:"定时器中的闭包"},"92.0":{t:"# 递归\r",p:`如果一个函数在内部可以调用其本身，那么这个函数就是递归函数
简单理解：函数内部自己调用自己，这个函数就是递归函数
递归函数的 ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/08-递归.html",a:"递归"},"92.1":{t:"浅拷贝和深拷贝\r",p:"\r",l:"front-end/JavaScript/06-JavaScript高级之面向对象/08-递归.html#浅拷贝和深拷贝",a:"浅拷贝和深拷贝"},"92.2":{t:"浅拷贝\r",p:`
浅拷贝只是拷贝一层,更深层次对象级别的只拷贝引用
深拷贝拷贝多层,每一级别的数据都会拷贝
Object.assign(ta ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/08-递归.html#浅拷贝",a:"浅拷贝"},"92.3":{t:"深拷贝\r",p:`        // 浅拷贝只是拷贝一层, 更深层次对象级别的只拷贝引用.
        // 深拷贝拷贝多层, 每一级别 ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/08-递归.html#深拷贝",a:"深拷贝"},"93.0":{t:"# 正则表达式\r",p:"\r",l:"front-end/JavaScript/06-JavaScript高级之面向对象/09-正则表达式.html",a:"正则表达式"},"93.1":{t:"正则表达式概述\r",p:"\r",l:"front-end/JavaScript/06-JavaScript高级之面向对象/09-正则表达式.html#正则表达式概述",a:"正则表达式概述"},"93.2":{t:"什么是正则表达式\r",p:"**正则表达式(Regular Expression)**是用于匹配字符串中字符组合.在JavaScript中,正则表达式也 ...",l:"front-end/JavaScript/06-JavaScript高级之面向对象/09-正则表达式.html#什么是正则表达式",a:"什么是正则表达式"},"93.3":{t:"正则表达式的特点\r",p:`
灵活性,逻辑性和功能性非常强
可以迅速地用极简单的方式达到字符串的复杂控制
对于刚接触的人来说,比较晦涩难懂.比如:^\\w ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/09-正则表达式.html#正则表达式的特点",a:"正则表达式的特点"},"93.4":{t:"正则表达式在JavaScript中的使用\r",p:"\r",l:"front-end/JavaScript/06-JavaScript高级之面向对象/09-正则表达式.html#正则表达式在javascript中的使用",a:"正则表达式在javascript中的使用"},"93.5":{t:"创建正则表达式\r",p:`在JavaScript中,可以通过两种方式创建一个正则表达式

通过调用RegExp对象的构造函数创建


var 变量名  ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/09-正则表达式.html#创建正则表达式",a:"创建正则表达式"},"93.6":{t:"测试正则表达式test\r",p:`test()正则对象方法,用于检测字符串是否符合该规则,该对象会返回true或false,其参数是测试字符串

regexO ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/09-正则表达式.html#测试正则表达式test",a:"测试正则表达式test"},"93.7":{t:"正则表达式的组成\r",p:"一个正则表达式可以由简单的字符构成,比如/abc/,也可以是简单和特殊字符的组合,比如/ab*c/.其中特殊字符也被称为元字 ...",l:"front-end/JavaScript/06-JavaScript高级之面向对象/09-正则表达式.html#正则表达式的组成",a:"正则表达式的组成"},"93.8":{t:"边界符\r",p:`正则表达式中的边界符(位置符)用来提供字符所处的位置,主要有两个字符



边界符
说明




^
表示匹配行首的文本(以 ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/09-正则表达式.html#边界符",a:"边界符"},"93.9":{t:"字符类\r",p:`
字符类表示有一系列字符可供选择，只要匹配其中一个就可以了
所有可供选择的字符都放在方括号内

`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/09-正则表达式.html#字符类",a:"字符类"},"93.10":{t:"[]方括号(多选一)\r",p:`/[abc]/.test('andy');     // true

后面的字符串只要包含 abc 中任意一个字符,都返回t ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/09-正则表达式.html#方括号-多选一",a:"方括号-多选一"},"93.11":{t:"[-]方括号内部 范围符\r",p:`/^[a-z]$/.test()

方括号内部加上 - 表示范围，这里表示 a-z 26个英文字母都可以
//例如
var  ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/09-正则表达式.html#方括号内部-范围符",a:"方括号内部-范围符"},"93.12":{t:"量词符\r",p:`量词符用来设定某个模式出现的次数



量词
说明




*
重复零次或更多次


+
重复一次或更多次


?
重复零次 ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/09-正则表达式.html#量词符",a:"量词符"},"93.13":{t:"界符和[]\r",p:`只能多选1
`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/09-正则表达式.html#界符和",a:"界符和"},"93.14":{t:"用户验证\r",p:`功能需求：

如果用户名输入合法, 则后面提示信息为 : 用户名合法,并且颜色为绿色
如果用户名输入不合法, 则后面提示信息 ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/09-正则表达式.html#用户验证",a:"用户验证"},"93.15":{t:"括号总结\r",p:`
大括号 量词符 里面面表示重复次数
中括号 字符集合 匹配方括号中的任意字符
小括号 表示优先级

// 中括号 字符集合 ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/09-正则表达式.html#括号总结",a:"括号总结"},"93.16":{t:"预定义类\r",p:`预定义类指的是 某些常见模式的简写写法



预定类
说明




\\d
匹配0-9之间的任一数字，相当于[0-9]


\\ ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/09-正则表达式.html#预定义类",a:"预定义类"},"93.17":{t:"表单验证\r",p:`分析：
1.手机号码: /^1[3|4|5|7|8][0-9]{9}$/
2.QQ: [1-9][0-9]{4,} (腾讯Q ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/09-正则表达式.html#表单验证",a:"表单验证"},"93.18":{t:"正则表达式替换replace()\r",p:`replace()方法可以实现替换字符串操作，用来替换的参数可以是一个字符串或是一个正则表达式

stringObject. ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/09-正则表达式.html#正则表达式替换replace",a:"正则表达式替换replace"},"93.19":{t:"正则表达式参数\r",p:`/表达式/[switch]

switch按照什么样的模式来匹配，有三种

g: 全局匹配
i:忽略大小写
gi: 全局匹配 ...`,l:"front-end/JavaScript/06-JavaScript高级之面向对象/09-正则表达式.html#正则表达式参数",a:"正则表达式参数"},"94.0":{t:"# 概述\r",p:"\r",l:"front-end/JavaScript/07-ES6~ES11/01-概述.html",a:"概述"},"94.1":{t:"1.什么是ECMA\r",p:"ECMA（European Computer Manufacturers Association）中文名称为欧洲计算机制造商 ...",l:"front-end/JavaScript/07-ES6~ES11/01-概述.html#_1-什么是ecma",a:"_1-什么是ecma"},"94.2":{t:"2.什么是ECMAScript\r",p:`ECMAScript是由ECMA国际通过ECMA-262标准化的脚本程序设计语言
`,l:"front-end/JavaScript/07-ES6~ES11/01-概述.html#_2-什么是ecmascript",a:"_2-什么是ecmascript"},"94.3":{t:"3.什么是ECMA-262\r",p:`Ecma 国际制定了许多标准，而 ECMA-262 只是其中的一个，所有标准列表查看：
http://www.ecma-in ...`,l:"front-end/JavaScript/07-ES6~ES11/01-概述.html#_3-什么是ecma-262",a:"_3-什么是ecma-262"},"94.4":{t:"4.ECMA-262历史\r",p:`ECMA-262（ECMAScript）历史版本查看网址：
http://www.ecma-international.or ...`,l:"front-end/JavaScript/07-ES6~ES11/01-概述.html#_4-ecma-262历史",a:"_4-ecma-262历史"},"94.5":{t:"5.谁在维护ECMA-262\r",p:"TC39（Technical Committee 39）是推进 ECMAScript 发展的委员会。其会员都是公司（其中主要 ...",l:"front-end/JavaScript/07-ES6~ES11/01-概述.html#_5-谁在维护ecma-262",a:"_5-谁在维护ecma-262"},"94.6":{t:"6.为什么要学习ES6\r",p:`
ES6的版本变动内容最多，具有里程碑意义
ES6加入许多新的语法特性，编程实现更简单，高效
ES6是前端发展趋势，就业必备 ...`,l:"front-end/JavaScript/07-ES6~ES11/01-概述.html#_6-为什么要学习es6",a:"_6-为什么要学习es6"},"94.7":{t:"7.ES6兼容性\r",p:`查看网址：ECMAScript 6 compatibility table (kangax.github.io)
`,l:"front-end/JavaScript/07-ES6~ES11/01-概述.html#_7-es6兼容性",a:"_7-es6兼容性"},"95.0":{t:"# let关键字(重点)\r",p:"\r",l:"front-end/JavaScript/07-ES6~ES11/ES6/02-let关键字（重点）.html",a:"let关键字-重点"},"95.1":{t:"特性\r",p:`let关键字用来声明变量，使用let声明的变量有几个特点：

不允许重复声明
块级作用域(局部变量)
不存在变量提升
不影响 ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6/02-let关键字（重点）.html#特性",a:"特性"},"95.2":{t:"let创建变量代码示例\r",p:`// let关键字使用示例：
let a; // 单个声明
let b,c,d; // 批量声明
let e = 100;  ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6/02-let关键字（重点）.html#let创建变量代码示例",a:"let创建变量代码示例"},"95.3":{t:"不允许重复声明\r",p:`代码实现:
// 1. 不允许重复声明；
let dog = &quot;狗&quot;;
let dog = &quot; ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6/02-let关键字（重点）.html#不允许重复声明",a:"不允许重复声明"},"95.4":{t:"块级作用域(局部变量)\r",p:`代码实现:
// 2. 块儿级作用域（局部变量）；
{
let cat = &quot;猫&quot;;
console.l ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6/02-let关键字（重点）.html#块级作用域-局部变量",a:"块级作用域-局部变量"},"95.5":{t:"不存在变量提升\r",p:"\r",l:"front-end/JavaScript/07-ES6~ES11/ES6/02-let关键字（重点）.html#不存在变量提升",a:"不存在变量提升"},"95.6":{t:"什么是变量提升\r",p:`就是在变量创建之前使用(比如输出:输出的是默认值),let不存在,var存在
代码实现:
// 3. 不存在变量提升；
// ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6/02-let关键字（重点）.html#什么是变量提升",a:"什么是变量提升"},"95.7":{t:"不影响作用域链\r",p:`// 4. 不影响作用域链；
// 什么是作用域链：很简单，就是代码块内有代码块，跟常规编程语言一样，上级代码块中的局部变量 ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6/02-let关键字（重点）.html#不影响作用域链",a:"不影响作用域链"},"95.8":{t:"let案例:点击div更改颜色\r",p:`代码实现:
&lt;!DOCTYPE html&gt;
&lt;html lang=&quot;en&quot;&gt;

 ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6/02-let关键字（重点）.html#let案例-点击div更改颜色",a:"let案例-点击div更改颜色"},"96.0":{t:"# const关键字(重点)\r",p:"\r",l:"front-end/JavaScript/07-ES6~ES11/ES6/03-const关键字（重点）.html",a:"const关键字-重点"},"96.1":{t:"特性\r",p:`const关键字用来声明常量,const声明有以下特点:

声明必须赋初始值
标识符一般为大写(习惯)
不允许重复声明
值不 ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6/03-const关键字（重点）.html#特性",a:"特性"},"97.0":{t:"# 变量和对象的解构赋值\r",p:"\r",l:"front-end/JavaScript/07-ES6~ES11/ES6/04-变量和对象的解构赋值.html",a:"变量和对象的解构赋值"},"97.1":{t:"什么是解构赋值\r",p:`ES6允许按照一定模式,从数组和对象中提取值,对变量进行赋值,这被称为解构赋值
&lt;!DOCTYPE html&gt;
 ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6/04-变量和对象的解构赋值.html#什么是解构赋值",a:"什么是解构赋值"},"98.0":{t:"# 模板字符串(重点)\r",p:"\r",l:"front-end/JavaScript/07-ES6~ES11/ES6/05-模板字符串（重点）.html",a:"模板字符串-重点"},"98.1":{t:"概述\r",p:`模板字符串(template string)是增强版的字符串,用反引号(\`\`)标识,特点:

字符串中可以出现换行符
可以使 ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6/05-模板字符串（重点）.html#概述",a:"概述"},"98.2":{t:"string的扩展方法\r",p:"\r",l:"front-end/JavaScript/07-ES6~ES11/ES6/05-模板字符串（重点）.html#string的扩展方法",a:"string的扩展方法"},"98.3":{t:"startsWith()和endsWith()\r",p:`
startsWith():表示参数字符串是否在原字符串的头部,返回布尔值
endsWith():表示参数字符串是否在原字符 ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6/05-模板字符串（重点）.html#startswith-和endswith",a:"startswith-和endswith"},"98.4":{t:"repeat()\r",p:`repeat方法表示将原字符串重复n次,返回一个新字符串
const str = 'xy';
        let str ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6/05-模板字符串（重点）.html#repeat",a:"repeat"},"98.5":{t:"Set()数据结构\r",p:`ES6提供了新的数据结构Set.它类似于数组,但是成员的值都是唯一的,没有重复的值
Set本身是一个构造函数,用来生成Set ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6/05-模板字符串（重点）.html#set-数据结构",a:"set-数据结构"},"99.0":{t:"# 简化对象和函数写法(重点)\r",p:"\r",l:"front-end/JavaScript/07-ES6~ES11/ES6/06-简化对象和函数写法（重点）.html",a:"简化对象和函数写法-重点"},"99.1":{t:"概述\r",p:`ES6允许在大括号里面,直接写入变量和函数,作为对象的属性和方法,这样书写更加简洁
&lt;!DOCTYPE html&gt ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6/06-简化对象和函数写法（重点）.html#概述",a:"概述"},"100.0":{t:"# 箭头函数(重点)\r",p:"\r",l:"front-end/JavaScript/07-ES6~ES11/ES6/07-箭头函数（重点）.html",a:"箭头函数-重点"},"100.1":{t:"概述\r",p:`ES6允许使用箭头(=&gt;)定义函数,箭头函数提供了一种更加简介的函数书写方式,箭头函数多用于匿名函数的定义
`,l:"front-end/JavaScript/07-ES6~ES11/ES6/07-箭头函数（重点）.html#概述",a:"概述"},"100.2":{t:"箭头函数的注意点\r",p:`
如果形参只有一个,则小括号可以省略
函数体如果只有一条语句,则花括号可以省略,函数的返回值为该条语句的执行结果;
箭头函数 ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6/07-箭头函数（重点）.html#箭头函数的注意点",a:"箭头函数的注意点"},"100.3":{t:"特性\r",p:`
箭头函数的this是静态的,始终指向函数声明时所在作用域下的this值
不能作为构造实例化对象
不能使用arguments ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6/07-箭头函数（重点）.html#特性",a:"特性"},"100.4":{t:"从数组中返回偶数的元素\r",p:`&lt;!DOCTYPE html&gt;
&lt;html&gt;
&lt;head&gt;
&lt;meta chars ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6/07-箭头函数（重点）.html#从数组中返回偶数的元素",a:"从数组中返回偶数的元素"},"101.0":{t:"# ES6中函数参数的默认值\r",p:"\r",l:"front-end/JavaScript/07-ES6~ES11/ES6/08-ES6中函数参数的默认值.html",a:"es6中函数参数的默认值"},"101.1":{t:"概述\r",p:`ES6允许给函数的参数赋初始值
&lt;!DOCTYPE html&gt;
&lt;html&gt;
&lt;head&gt ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6/08-ES6中函数参数的默认值.html#概述",a:"概述"},"102.0":{t:"# rest参数\r",p:"\r",l:"front-end/JavaScript/07-ES6~ES11/ES6/09-rest参数.html",a:"rest参数"},"102.1":{t:"概述\r",p:`ES6引入rest参数,用于获取函数的实参,用来代替arguments
&lt;!DOCTYPE html&gt;
&lt; ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6/09-rest参数.html#概述",a:"概述"},"103.0":{t:"# 扩展运算符(重点)\r",p:`...扩展运算符能将数组转换为逗号分隔的参数序列
扩展运算符(spread)也是三个点(...).它好比rest参数的逆运算 ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6/10-扩展运算符（重点）.html",a:"扩展运算符-重点"},"103.1":{t:"应用\r",p:`&lt;!DOCTYPE html&gt;
&lt;html&gt;
&lt;head&gt;
&lt;meta chars ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6/10-扩展运算符（重点）.html#应用",a:"应用"},"103.2":{t:"Array的扩展方法\r",p:"\r",l:"front-end/JavaScript/07-ES6~ES11/ES6/10-扩展运算符（重点）.html#array的扩展方法",a:"array的扩展方法"},"103.3":{t:"构造函数方法:Array.from()\r",p:`将数组或可遍历对象转换为真正的数组
var arraylike = {
            '0':'1',
      ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6/10-扩展运算符（重点）.html#构造函数方法-array-from",a:"构造函数方法-array-from"},"103.4":{t:"find()方法\r",p:`用于找出第一个符合条件的数组成员,如果没有找到返回undefined
 const ary = [{id:1,name:'z ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6/10-扩展运算符（重点）.html#find-方法",a:"find-方法"},"103.5":{t:"findindex()\r",p:`用于找出第一个符合条件的数组成员的位置,如果没有找到返回-1
const ary = [5, 12, 8, 130, 44] ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6/10-扩展运算符（重点）.html#findindex",a:"findindex"},"103.6":{t:"includes()\r",p:`用来判断一个数组是否包含一个指定的值，根据情况，如果包含则返回 true，否则返回 false。
const ary = [ ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6/10-扩展运算符（重点）.html#includes",a:"includes"},"104.0":{t:"# symbol\r",p:"\r",l:"front-end/JavaScript/07-ES6~ES11/ES6/11-symbol.html",a:"symbol"},"104.1":{t:"symbol概述\r",p:"ES6引入了一种新的原始数据类型Symbol,表示独一无二的值,它是JavaScript语言的第七种数据类型,是一种类似于字 ...",l:"front-end/JavaScript/07-ES6~ES11/ES6/11-symbol.html#symbol概述",a:"symbol概述"},"104.2":{t:"symbol特点\r",p:`
symbol的值是唯一的,用来解决命名冲突问题;
symbol值不能与其他数据进行运算;
symbol定义的对象属性不能使 ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6/11-symbol.html#symbol特点",a:"symbol特点"},"104.3":{t:"symbol内置值\r",p:"\r",l:"front-end/JavaScript/07-ES6~ES11/ES6/11-symbol.html#symbol内置值",a:"symbol内置值"},"104.4":{t:"概述\r",p:"除了定义自己使用的symbol值以外,ES6还提供了11个内置的symbol值,指向语言内部使用的方法,可以称这些方法为魔术 ...",l:"front-end/JavaScript/07-ES6~ES11/ES6/11-symbol.html#概述",a:"概述"},"105.0":{t:"# 生成器\r",p:`生成器函数是 ES6 提供的一种异步编程解决方案，语法行为与传统函数完全不同
function * gen(){
 yiel ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6/12-生成器.html",a:"生成器"},"106.0":{t:"# 迭代器\r",p:"\r",l:"front-end/JavaScript/07-ES6~ES11/ES6/13-迭代器.html",a:"迭代器"},"106.1":{t:"概述\r",p:"遍历器(iterator)就是一种机制.它是一种接口,为各种不同的数据结构提供统一的访问机制.任何数据结构只要部署itera ...",l:"front-end/JavaScript/07-ES6~ES11/ES6/13-迭代器.html#概述",a:"概述"},"107.0":{t:"# promise(重点)\r",p:"Promise 是 ES6 引入的异步编程的新解决方案。语法上 Promise 是一个构造函数， 用来封装异步操作并可以获取 ...",l:"front-end/JavaScript/07-ES6~ES11/ES6/14-promise（重点）.html",a:"promise-重点"},"108.0":{t:"# ES6模块化\r",p:"\r",l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/01-ES6模块化.html",a:"es6模块化"},"108.1":{t:"1. 回顾：node.js中如何实现模块化\r",p:`node.js 遵循了 CommonJS 的模块化规范。其中：

导入其它模块使用 require() 方法
模块对外共享成 ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/01-ES6模块化.html#_1-回顾-node-js中如何实现模块化",a:"_1-回顾-node-js中如何实现模块化"},"108.2":{t:"2. 前端模块化规范的分类\r",p:"在 ES6 模块化规范诞生之前，JavaScript 社区已经尝试并提出了 AMD、CMD、CommonJS 等模块化规范。 ...",l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/01-ES6模块化.html#_2-前端模块化规范的分类",a:"_2-前端模块化规范的分类"},"108.3":{t:"3. 什么是 ES6 模块化规范\r",p:"ES6 模块化规范是浏览器端与服务器端通用的模块化开发规范。它的出现极大的降低了前端开发者的模块化学 习成本，开发者不需再额 ...",l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/01-ES6模块化.html#_3-什么是-es6-模块化规范",a:"_3-什么是-es6-模块化规范"},"108.4":{t:"4. 在nodejs中体验ES6模块化\r",p:"node.js 中默认仅支持 CommonJS 模块化规范，若想基于 node.js 体验与学习 ES6 的模块化语法，可以 ...",l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/01-ES6模块化.html#_4-在nodejs中体验es6模块化",a:"_4-在nodejs中体验es6模块化"},"108.5":{t:"5. ES6 模块化的基本语法\r",p:`ES6 的模块化主要包含如下 3 种用法：

默认导出与默认导入
按需导出与按需导入
直接导入并执行模块中的代码

`,l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/01-ES6模块化.html#_5-es6-模块化的基本语法",a:"_5-es6-模块化的基本语法"},"108.6":{t:"默认导出\r",p:`默认导出的语法： ==export default== 默认导出的成员
let n1 = 10
let n2 = 20
fu ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/01-ES6模块化.html#默认导出",a:"默认导出"},"108.7":{t:"默认导入\r",p:`import m1 from './01默认导出.js'

console.log(m1)


`,l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/01-ES6模块化.html#默认导入",a:"默认导入"},"108.8":{t:"默认导出的*注意事项:exclamation:*\r",p:`每个模块中，只允许使用唯一的一次 export default，否则会报错！
`,l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/01-ES6模块化.html#默认导出的-注意事项-exclamation",a:"默认导出的-注意事项-exclamation"},"108.9":{t:"默认导入的*注意事项:exclamation:*\r",p:`默认导入时的接收名称可以任意名称，只要是合法的成员名称即可：
!image-20220518232154869
`,l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/01-ES6模块化.html#默认导入的-注意事项-exclamation",a:"默认导入的-注意事项-exclamation"},"108.10":{t:"按需导出\r",p:`按需导出的语法： export 按需导出的成员
`,l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/01-ES6模块化.html#按需导出",a:"按需导出"},"108.11":{t:"按需导入\r",p:`按需导入的语法： import { s1 } from '模块标识符'
import {s1,s2,say} from '. ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/01-ES6模块化.html#按需导入",a:"按需导入"},"108.12":{t:"按需导入/导出的*注意事项:exclamation:*\r",p:`

每个模块中可以使用多次按需导出


按需导入的成员名称必须和按需导出的名称保持一致


按需导入时，可以使用 as 关键 ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/01-ES6模块化.html#按需导入-导出的-注意事项-exclamation",a:"按需导入-导出的-注意事项-exclamation"},"108.13":{t:"直接导入并执行模块中的代码\r",p:`如果只想单纯地执行某个模块中的代码，并不需要得到模块中向外共享的成员。
此时，可以直接导入并执行模块代码，示例代码如下：
! ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/01-ES6模块化.html#直接导入并执行模块中的代码",a:"直接导入并执行模块中的代码"},"109.0":{t:"# Promise\r",p:"\r",l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/02-Promise.html",a:"promise"},"109.1":{t:"回调地狱:star:\r",p:`多层回调函数的相互嵌套，就形成了回调地狱。示例代码如下：
setTimeout(() =&gt; { //第1层回调函数
	 ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/02-Promise.html#回调地狱-star",a:"回调地狱-star"},"109.2":{t:"如何解决回调地狱的问题\r",p:`为了解决回调地狱的问题，ES6（ECMAScript 2015）中新增了 Promise 的概念。
`,l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/02-Promise.html#如何解决回调地狱的问题",a:"如何解决回调地狱的问题"},"109.3":{t:"Promise的基本概念\r",p:`
Promise是一个构造函数

可以创建Promise的实例 const p = new Promise()
实例对象，代 ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/02-Promise.html#promise的基本概念",a:"promise的基本概念"},"109.4":{t:"基于回调函数按顺序读取文件内容\r",p:`问题：层层嵌套，形成回调地狱
!image-20220518235023267
解决方案：
`,l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/02-Promise.html#基于回调函数按顺序读取文件内容",a:"基于回调函数按顺序读取文件内容"},"109.5":{t:"基于 then-fs 读取文件内容\r",p:"由于 node.js 官方提供的 fs 模块仅支持以回调函数的方式读取文件，不支持 Promise 的调用方式。因此，需 要 ...",l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/02-Promise.html#基于-then-fs-读取文件内容",a:"基于-then-fs-读取文件内容"},"109.6":{t:"then-fs的基本使用\r",p:"调用 then-fs 提供的 readFile() 方法，可以异步地读取文件的内容，它的返回值是 Promise 的实例对象 ...",l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/02-Promise.html#then-fs的基本使用",a:"then-fs的基本使用"},"109.7":{t:".then()方法的特性\r",p:"如果上一个 .then() 方法中返回了一个新的 Promise 实例对象，则可以通过下一个 .then() 继续进行处理。 ...",l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/02-Promise.html#then-方法的特性",a:"then-方法的特性"},"109.8":{t:"基于Promise按顺序读取文件的内容:star:\r",p:`Promise 支持链式调用，从而来解决回调地狱的问题。示例代码如下：
import thenfs from 'then-f ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/02-Promise.html#基于promise按顺序读取文件的内容-star",a:"基于promise按顺序读取文件的内容-star"},"109.9":{t:"通过.catch捕获错误:star:\r",p:"在 Promise 的链式操作中如果发生了错误，可以使用 Promise.prototype.catch 方法进行捕获和处理 ...",l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/02-Promise.html#通过-catch捕获错误-star",a:"通过-catch捕获错误-star"},"109.10":{t:"Promise.all()方法:star:\r",p:"Promise.all() 方法会发起并行的 Promise 异步操作，等所有的异步操作全部结束后才会执行下一步的 .the ...",l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/02-Promise.html#promise-all-方法-star",a:"promise-all-方法-star"},"109.11":{t:"Promise.race()方法:star:\r",p:"Promise.race() 方法会发起并行的 Promise 异步操作，只要任何一个异步操作完成，就立即执行下一步的 .t ...",l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/02-Promise.html#promise-race-方法-star",a:"promise-race-方法-star"},"109.12":{t:"基于Promise封装读文件的方法:sparkles:\r",p:`要求：

方法的名称要定义为 getFile
方法接收一个形参 fpath，表示要读取的文件的路径
方法的返回值为 Prom ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/02-Promise.html#基于promise封装读文件的方法-sparkles",a:"基于promise封装读文件的方法-sparkles"},"110.0":{t:"# async/await\r",p:"\r",l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/03-async await.html",a:"async-await"},"110.1":{t:"什么是async/await\r",p:"async/await 是 ES8（ECMAScript 2017）引入的新语法，用来简化 Promise 异步操作。在 a ...",l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/03-async await.html#什么是async-await",a:"什么是async-await"},"110.2":{t:"async/await基本使用:star:\r",p:`加上await后返回值不再是promise实例，而是真正的内容！！！
如果用了await，则该方法必须被async修饰
使用 ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/03-async await.html#async-await基本使用-star",a:"async-await基本使用-star"},"110.3":{t:"async/await的注意事项\r",p:`
如果在 function 中使用了 await，则 function 必须被 async 修饰
在 async 方法中，第 ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/03-async await.html#async-await的注意事项",a:"async-await的注意事项"},"111.0":{t:"# EventLoop\r",p:"\r",l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/04-EventLoop.html",a:"eventloop"},"111.1":{t:"JavaScript是单线程的语言\r",p:`JavaScript 是一门单线程执行的编程语言。也就是说，同一时间只能做一件事情。
!image-202205190103 ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/04-EventLoop.html#javascript是单线程的语言",a:"javascript是单线程的语言"},"111.2":{t:"同步任务和异步任务:star:\r",p:`为防止某个耗时任务导致程序假死的问题，JavaScript把待执行的任务分为了两类：

同步任务(synchronous)
 ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/04-EventLoop.html#同步任务和异步任务-star",a:"同步任务和异步任务-star"},"111.3":{t:"同步任务和异步任务的执行过程\r",p:`!image-20220519011856859

同步任务由 JavaScript 主线程次序执行
异步任务委托给宿主环境 ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/04-EventLoop.html#同步任务和异步任务的执行过程",a:"同步任务和异步任务的执行过程"},"111.4":{t:"EventLoop基本概念\r",p:"JavaScript 主线程从“任务队列”中读取异步任务的回调函数，放到执行栈中依次执行。这个过程是循环不断的，所以整个的这 ...",l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/04-EventLoop.html#eventloop基本概念",a:"eventloop基本概念"},"111.5":{t:"结合EventLoop分析输出的顺序\r",p:`!image-20220519013043403
正确的输出结果：ADCB。其中：

A 和 D 属于同步任务。会根据代码的 ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/04-EventLoop.html#结合eventloop分析输出的顺序",a:"结合eventloop分析输出的顺序"},"112.0":{t:"# 宏任务和微任务\r",p:"\r",l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/05-宏任务和微任务.html",a:"宏任务和微任务"},"112.1":{t:"什么是宏任务和微任务\r",p:`JavaScript 把异步任务又做了进一步的划分，异步任务又分为两类，分别是：

宏任务(macrotask)

异步Aj ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/05-宏任务和微任务.html#什么是宏任务和微任务",a:"什么是宏任务和微任务"},"112.2":{t:"宏任务和微任务的执行顺序\r",p:`!image-20220519155055354
每一个宏任务执行完之后，都会检查是否存在待执行的微任务，如果有，则执行完所 ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/05-宏任务和微任务.html#宏任务和微任务的执行顺序",a:"宏任务和微任务的执行顺序"},"112.3":{t:"分析以下代码输出的顺序\r",p:`!image-20220519160037761
正确的输出顺序是：2431
分析：

先执行所有的同步任务

执行第 6  ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/05-宏任务和微任务.html#分析以下代码输出的顺序",a:"分析以下代码输出的顺序"},"112.4":{t:"经典面试题\r",p:`请分析以下代码输出的顺序（代码较长，截取成了左中右 3 个部分） ：
!image-20220519160434426
正确 ...`,l:"front-end/JavaScript/07-ES6~ES11/ES6模块化/05-宏任务和微任务.html#经典面试题",a:"经典面试题"},"113.0":{t:"# jQuery概述\r",p:"\r",l:"front-end/jQuery/01-概述.html",a:"jquery概述"},"113.1":{t:"JavaScript库\r",p:`仓库：可以把很多东西放到这个仓库里面。找东西只需要到仓库里面查找到就可以了。
JavaScript库：即library，是一 ...`,l:"front-end/jQuery/01-概述.html#javascript库",a:"javascript库"},"113.2":{t:"jQuery的概念\r",p:"jQuery是一个快速,简洁的JavaScript库,其设计的宗旨是'write less,do more',即倡导写更少的 ...",l:"front-end/jQuery/01-概述.html#jquery的概念",a:"jquery的概念"},"113.3":{t:"jQuery的优点\r",p:`
轻量级,核心文件才几十kb,不会影响页面加载速度
跨浏览器兼容.基本兼容现在主流的浏览器
链式编程,隐式迭代
对事件,样式 ...`,l:"front-end/jQuery/01-概述.html#jquery的优点",a:"jquery的优点"},"114.0":{t:"# jQuery基本使用\r",p:`官网地址:jQuery
版本:

1x:兼容IE678等低版本浏览器,官网不再更新
2x:不兼容IE678等低版本浏览器,官 ...`,l:"front-end/jQuery/02-基本使用.html",a:"jquery基本使用"},"114.1":{t:"jQuery的入口函数\r",p:`$(function () {
 ...		//此处是页面DOM加载完成的入口
 });

$(document).read ...`,l:"front-end/jQuery/02-基本使用.html#jquery的入口函数",a:"jquery的入口函数"},"114.2":{t:"jQuery的顶级对象$\r",p:`1.$是jQuery的别称,在代码中可以使用jQuery代替$,但一般为了方便,通常都直接使用$
2.$是jQuery的顶级 ...`,l:"front-end/jQuery/02-基本使用.html#jquery的顶级对象",a:"jquery的顶级对象"},"114.3":{t:"jQuery对象和DOM对象\r",p:`1.原生js获取过来的对象就是DOM对象
2.jQuery方法获取的对象就是jQuery对象
3.jQuery对象本质是:利 ...`,l:"front-end/jQuery/02-基本使用.html#jquery对象和dom对象",a:"jquery对象和dom对象"},"114.4":{t:"jQuery对象和DOM对象转换\r",p:"因为原生js比jQuery更大,原生的一些属性和方法jQuery没有给我们封装,要想使用这些属性和方法需要把jQuery对象 ...",l:"front-end/jQuery/02-基本使用.html#jquery对象和dom对象转换",a:"jquery对象和dom对象转换"},"115.0":{t:"# jQuery选择器\r",p:"\r",l:"front-end/jQuery/03-jQuery选择器.html",a:"jquery选择器"},"115.1":{t:"jQuery基础选择器\r",p:`
$('选择器') //里面选择器直接写css选择器,但要加引号

!image-20230415040048039
`,l:"front-end/jQuery/03-jQuery选择器.html#jquery基础选择器",a:"jquery基础选择器"},"115.2":{t:"jQuery层级选择器\r",p:`


名称
用法
描述




子代选择器
$('ul&gt;li')
使用&gt;号,获取亲儿子层级的元素;注意,并不会获 ...`,l:"front-end/jQuery/03-jQuery选择器.html#jquery层级选择器",a:"jquery层级选择器"},"115.3":{t:"隐式迭代(重要)\r",p:`遍历内部DOM元素(伪数组形式存储)的过程就叫做隐式迭代
`,l:"front-end/jQuery/03-jQuery选择器.html#隐式迭代-重要",a:"隐式迭代-重要"},"115.4":{t:"jQuery筛选选择器\r",p:`


语法
用法
描述




:first
$('li:first')
获取第一个li元素


:last
$('li:l ...`,l:"front-end/jQuery/03-jQuery选择器.html#jquery筛选选择器",a:"jquery筛选选择器"},"115.5":{t:"jQuery筛选方法(重点)\r",p:`


语法
用法
说明




parents()
$('li').parents()/$('li').parent('.c ...`,l:"front-end/jQuery/03-jQuery选择器.html#jquery筛选方法-重点",a:"jquery筛选方法-重点"},"115.6":{t:"链式编程\r",p:`链式编程时为了节省代码量,看起来更优雅

$(this).css('color','red').sibling().css( ...`,l:"front-end/jQuery/03-jQuery选择器.html#链式编程",a:"链式编程"},"116.0":{t:"# jQuery样式操作\r",p:"\r",l:"front-end/jQuery/04-jQuery样式操作.html",a:"jquery样式操作"},"116.1":{t:"操作css方法\r",p:`1.参数只写属性名,返回属性值,带单位

$('div').css('width')

2.参数时属性名,属性值,逗号分隔, ...`,l:"front-end/jQuery/04-jQuery样式操作.html#操作css方法",a:"操作css方法"},"116.2":{t:"设置类样式方法\r",p:`
注意操作类里面的参数不要加点

1.添加类

$('div').addClass('current');

2.移除类

 ...`,l:"front-end/jQuery/04-jQuery样式操作.html#设置类样式方法",a:"设置类样式方法"},"116.3":{t:"类操作和className的区别\r",p:`原生js中className会覆盖元素原先里面的类名
jQuery里面类操作只是对指定类进行操作,不影响原先的类名
`,l:"front-end/jQuery/04-jQuery样式操作.html#类操作和classname的区别",a:"类操作和classname的区别"},"117.0":{t:"# jQuery效果\r",p:"\r",l:"front-end/jQuery/05-jQuery效果.html",a:"jquery效果"},"117.1":{t:"显示隐藏\r",p:`show([speed,[easing],[fn]])


参数都可以省略,无动画直接显示
speed:三种预定速度之一的字 ...`,l:"front-end/jQuery/05-jQuery效果.html#显示隐藏",a:"显示隐藏"},"117.2":{t:"事件切换\r",p:`同时实现鼠标移入和移出
hover{[over,]out}




over:鼠标移动到元素上要触发的函数(mouseent ...`,l:"front-end/jQuery/05-jQuery效果.html#事件切换",a:"事件切换"},"117.3":{t:"滑动\r",p:`
slideDown()//下滑
slideUp()//上滑
slideToggle()//切换

`,l:"front-end/jQuery/05-jQuery效果.html#滑动",a:"滑动"},"117.4":{t:"淡入淡出\r",p:`
fadeIn()//淡入
fadeOut()//淡出
fadeToggle()//淡入淡出切换
fadeTo()//调整透 ...`,l:"front-end/jQuery/05-jQuery效果.html#淡入淡出",a:"淡入淡出"},"117.5":{t:"自定义动画\r",p:`animate(params.[speed],[easing],[fn])

参数
params:想要修改的样式属性,以对象 ...`,l:"front-end/jQuery/05-jQuery效果.html#自定义动画",a:"自定义动画"},"117.6":{t:"动画队列及其停止排队方法\r",p:"\r",l:"front-end/jQuery/05-jQuery效果.html#动画队列及其停止排队方法",a:"动画队列及其停止排队方法"},"117.7":{t:"动画或效果队列\r",p:`动画或者效果一旦触发就会执行,如果多次触发,就造成多个动画或者效果排队执行
`,l:"front-end/jQuery/05-jQuery效果.html#动画或效果队列",a:"动画或效果队列"},"117.8":{t:"停止排队\r",p:`
stop()


stop()方法用于停止动画或效果
注意:stop()写到动画或者效果的前面,相当于停止结束上一次动画
 ...`,l:"front-end/jQuery/05-jQuery效果.html#停止排队",a:"停止排队"},"118.0":{t:"# jQuery属性操作\r",p:"\r",l:"front-end/jQuery/06-jQuery属性操作.html",a:"jquery属性操作"},"118.1":{t:"设置或获取元素固有属性值prop()\r",p:`不能获取自定义属性

获取属性语法


prop('属性')

2.设置属性语法

prop('属性','属性值')

`,l:"front-end/jQuery/06-jQuery属性操作.html#设置或获取元素固有属性值prop",a:"设置或获取元素固有属性值prop"},"118.2":{t:"设置或获取自定义属性值\r",p:`
attr('属性')
attr('属性','属性值)

`,l:"front-end/jQuery/06-jQuery属性操作.html#设置或获取自定义属性值",a:"设置或获取自定义属性值"},"118.3":{t:"数据缓存data()\r",p:`data()方法可以在指定的元素上存取数据,并不会修改DOM结构.一旦页面刷新,之前存放的数据都将被移除

data('属性 ...`,l:"front-end/jQuery/06-jQuery属性操作.html#数据缓存data",a:"数据缓存data"},"119.0":{t:"# jQuery文本属性值\r",p:`主要针对元素的内容还有表单的值操作
`,l:"front-end/jQuery/07-jQuery文本属性值.html",a:"jquery文本属性值"},"119.1":{t:"普通元素内容html()(相当于原生innerHTML)\r",p:`
html()//获取元素内容
html('内容')//设置元素的内容

`,l:"front-end/jQuery/07-jQuery文本属性值.html#普通元素内容html-相当于原生innerhtml",a:"普通元素内容html-相当于原生innerhtml"},"119.2":{t:"普通元素文本内容text()(相当于原生innerText)\r",p:`
只能获取文字,没有标签
text()//获取内容
text('内容')//设置元素内容

`,l:"front-end/jQuery/07-jQuery文本属性值.html#普通元素文本内容text-相当于原生innertext",a:"普通元素文本内容text-相当于原生innertext"},"119.3":{t:"设置表单值val()(相当于原生value())\r",p:`
val()//获取内容
val('内容')//设置元素内容

`,l:"front-end/jQuery/07-jQuery文本属性值.html#设置表单值val-相当于原生value",a:"设置表单值val-相当于原生value"},"120.0":{t:"# jQuery元素操作\r",p:"\r",l:"front-end/jQuery/08-jQuery元素操作.html",a:"jquery元素操作"},"120.1":{t:"遍历元素\r",p:`jQuery隐式迭代是对同一类元素做了同样的操作。如果想要给同一类元素做不同操作，就需要用到遍历
语法1：

$('div' ...`,l:"front-end/jQuery/08-jQuery元素操作.html#遍历元素",a:"遍历元素"},"120.2":{t:"创建元素\r",p:`
$('&lt;li&gt;&lt;/li&gt;')

`,l:"front-end/jQuery/08-jQuery元素操作.html#创建元素",a:"创建元素"},"120.3":{t:"添加元素\r",p:`
内部添加
//同一个元素只能添加一次,后面的添加会覆盖前面添加
element.append('内容')	//放在匹配元素 ...`,l:"front-end/jQuery/08-jQuery元素操作.html#添加元素",a:"添加元素"},"120.4":{t:"删除元素\r",p:`
element.remove()	//删除匹配的元素本身
element.empty()	//删除匹配的元素集合中所有的子 ...`,l:"front-end/jQuery/08-jQuery元素操作.html#删除元素",a:"删除元素"},"121.0":{t:"# jQuery尺寸,位置操作\r",p:"\r",l:"front-end/jQuery/09-jQuery尺寸、位置操作.html",a:"jquery尺寸-位置操作"},"121.1":{t:"jQuery尺寸\r",p:`


语法
用法




width()/height()
取得匹配元素宽度和高度值,只算width/height


in ...`,l:"front-end/jQuery/09-jQuery尺寸、位置操作.html#jquery尺寸",a:"jquery尺寸"},"121.2":{t:"jQuery位置\r",p:`位置主要有三个:offset(),position(),scrollTop()/scrollLeft()

offset() ...`,l:"front-end/jQuery/09-jQuery尺寸、位置操作.html#jquery位置",a:"jquery位置"},"122.0":{t:"# jQuery事件\r",p:"\r",l:"front-end/jQuery/10-jQuery事件.html",a:"jquery事件"},"122.1":{t:"jQuery事件注册\r",p:"\r",l:"front-end/jQuery/10-jQuery事件.html#jquery事件注册",a:"jquery事件注册"},"122.2":{t:"单个事件注册\r",p:`
element.事件(function(){})

其他事件和原生基本一致

mouseover,mouseout,blu ...`,l:"front-end/jQuery/10-jQuery事件.html#单个事件注册",a:"单个事件注册"},"122.3":{t:"jQuery事件处理\r",p:"\r",l:"front-end/jQuery/10-jQuery事件.html#jquery事件处理",a:"jquery事件处理"},"122.4":{t:"事件处理on()绑定事件\r",p:`on()方法在匹配元素上绑定一个或多个事件的事件处理函数

element.on(event,[selector],fn)
 ...`,l:"front-end/jQuery/10-jQuery事件.html#事件处理on-绑定事件",a:"事件处理on-绑定事件"},"122.5":{t:"事件委托\r",p:`
$('ul').on('click','li',function() {})
事件绑定在ul上,触发在li上

动态创建元 ...`,l:"front-end/jQuery/10-jQuery事件.html#事件委托",a:"事件委托"},"122.6":{t:"事件处理off()解绑事件\r",p:`off()方法可以移除通过on()方法添加的事件处理程序

$('div').off('click')	//解除所有事件
$ ...`,l:"front-end/jQuery/10-jQuery事件.html#事件处理off-解绑事件",a:"事件处理off-解绑事件"},"122.7":{t:"自动触发事件\r",p:`
$('div').click();	//第一种自动调用函数

`,l:"front-end/jQuery/10-jQuery事件.html#自动触发事件",a:"自动触发事件"},"122.8":{t:"trigger()自动触发\r",p:`
element.trigger('click')	//第二种自动触发 //input有光标 //会触发默认行为
eleme ...`,l:"front-end/jQuery/10-jQuery事件.html#trigger-自动触发",a:"trigger-自动触发"},"122.9":{t:"jQuery事件对象\r",p:`
element.on(event,[selector],function(event) {})
//回调函数里面的even ...`,l:"front-end/jQuery/10-jQuery事件.html#jquery事件对象",a:"jquery事件对象"},"123.0":{t:"# jQuery方法\r",p:"\r",l:"front-end/jQuery/11-jQuery方法.html",a:"jquery方法"},"123.1":{t:"jQuery拷贝对象\r",p:`如果想要把某个对象拷贝(合并)给另外一个对象使用,此时可以使用$.extend()方法

$.extend([deep],t ...`,l:"front-end/jQuery/11-jQuery方法.html#jquery拷贝对象",a:"jquery拷贝对象"},"123.2":{t:"多库共存\r",p:`jQuery使用$作为标识符,随着jQuery的流行,其他js库也会用这$作为标识符,这样一起使用会引起冲突
需要一个解决方 ...`,l:"front-end/jQuery/11-jQuery方法.html#多库共存",a:"多库共存"},"123.3":{t:"jQuery插件\r",p:`jQuery插件库-收集最全最新最好的jQuery插件 (jq22.com)
jQuery之家-自由分享jQuery、htm ...`,l:"front-end/jQuery/11-jQuery方法.html#jquery插件",a:"jquery插件"},"123.4":{t:"图片懒加载\r",p:`图片使用延迟加载可提高网页下载速度,他能帮助减轻服务器负载
当我们页面滑动到可视区域,再显示图片
EasyLazyload. ...`,l:"front-end/jQuery/11-jQuery方法.html#图片懒加载",a:"图片懒加载"},"123.5":{t:"全屏滚动\r",p:"alvarotrigo/fullPage.js: fullPage plugin by Alvaro Trigo. Crea ...",l:"front-end/jQuery/11-jQuery方法.html#全屏滚动",a:"全屏滚动"},"124.0":{t:"# jQuery 选择器\r",p:`jQuery 选择器允许对 HTML 元素组或单个元素进行操作。
jQuery 选择器基于元素的 id、类、类型、属性、属性 ...`,l:"front-end/jQuery/12-jQuery选择器（补充）.html",a:"jquery-选择器"},"124.1":{t:"基本选择器\r",p:`$(&quot;#test&quot;)       //选择id值为test的元素，id值是唯一的所以返回单个元素。
$( ...`,l:"front-end/jQuery/12-jQuery选择器（补充）.html#基本选择器",a:"基本选择器"},"124.2":{t:"层次选择器\r",p:`$(&quot;div span&quot;)		//选取&lt;div&gt;里的所有&lt;span&gt;元素
$(& ...`,l:"front-end/jQuery/12-jQuery选择器（补充）.html#层次选择器",a:"层次选择器"},"124.3":{t:"基本过滤选择器\r",p:"$(&quot;div:first&quot;)               　	//选取所有&lt;div&gt;元素中第 ...",l:"front-end/jQuery/12-jQuery选择器（补充）.html#基本过滤选择器",a:"基本过滤选择器"},"124.4":{t:"内容过滤选择器\r",p:"$(&quot;div:contains('Name')&quot;)       //选取所有&lt;div&gt;中含有 ...",l:"front-end/jQuery/12-jQuery选择器（补充）.html#内容过滤选择器",a:"内容过滤选择器"},"124.5":{t:"可见性过滤选择器\r",p:"$(&quot;div:hidden&quot;)                 //选取所有不可见的&lt;div&gt ...",l:"front-end/jQuery/12-jQuery选择器（补充）.html#可见性过滤选择器",a:"可见性过滤选择器"},"124.6":{t:"属性过滤选择器\r",p:`$(&quot;div[id]&quot;)              　　　//选取所有拥有属性id的元素
$(&quot ...`,l:"front-end/jQuery/12-jQuery选择器（补充）.html#属性过滤选择器",a:"属性过滤选择器"},"124.7":{t:"子元素过滤选择器\r",p:"$(&quot;div .one:nth-child(2)&quot;)       //选取class为'one'的&lt ...",l:"front-end/jQuery/12-jQuery选择器（补充）.html#子元素过滤选择器",a:"子元素过滤选择器"},"124.8":{t:"表单对象属性过滤选择器\r",p:"$(&quot;#form1 :enabled&quot;)             //选取id为'form1'的表单内所 ...",l:"front-end/jQuery/12-jQuery选择器（补充）.html#表单对象属性过滤选择器",a:"表单对象属性过滤选择器"},"124.9":{t:"表单选择器\r",p:"$(&quot;:input&quot;)                      //选取所有&lt;input&gt; ...",l:"front-end/jQuery/12-jQuery选择器（补充）.html#表单选择器",a:"表单选择器"}},r={previewLength:62,buttonLabel:"搜索",placeholder:"搜索文档",allow:[],ignore:[]},a={INDEX_DATA:t,PREVIEW_LOOKUP:n,Options:r};export{a as default};
